function ExecuteScript(strId)
{
  switch (strId)
  {
      case "5yqscY9bUJ9":
        Script1();
        break;
      case "5snArMne24t":
        Script2();
        break;
      case "6nRoBj1ElF3":
        Script3();
        break;
      case "6aedAEDbu2f":
        Script4();
        break;
      case "6LClOydupND":
        Script5();
        break;
      case "6O7hcQ7JddO":
        Script6();
        break;
      case "64eWhNNh2ev":
        Script7();
        break;
      case "6gnWwOcont2":
        Script8();
        break;
  }
}

function Script1()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" السلوك الرقمي يشير إلى السلوك الذي يتم عبر وسائل الاتصال الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي. وفيما يلي بعض آداب السلوك الرقمي التي يُفضل اتباعها: احترام الآخرين: تجنب نشر معلومات خاصة بالآخرين دون إذن. تجنب استخدام لغة جارحة أو مهينة في التعليقات والردود. النقاش البناء: المشاركة في المناقشات بطريقة بناءة ومحترمة. تجنب الخلافات الشخصية والتحاور بشكل مثقف. تحديد الهوية: تجنب استخدام الهويات المزيفة أو الانتحال للهويات الأخرى. كن صادقًا في التفاعلات الرقمية. الحفاظ على الخصوصية: تجنب مشاركة معلومات خاصة تتعلق بالحياة الشخصية دون تفكير جيد. ضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي والحفاظ على حقوقك. مراعاة حقوق الملكية: عدم استخدام محتوى آخرين دون إذن منهم. الاحترام الكامل لحقوق الملكية الفكرية. التحقق من صحة المعلومات: التحقق من صحة المعلومات قبل نشرها لتفادي نشر المعلومات الخاطئة ";

let txt2=" أهمية آداب السلوك الرقمي تشير إلى مجموعة من السلوكيات والقواعد التي يجب على الأفراد اتباعها أثناء استخدامهم للتكنولوجيا الرقمية ووسائل التواصل الاجتماعي. تتنوع هذه القواعد والآداب وتشمل الاحترام والأمان الرقمي والتواصل اللائق عبر الإنترنت. إليك بعض أهمية آداب السلوك الرقمي: الاحترام وحقوق الآخرين: تشجع آداب السلوك الرقمي على احترام خصوصية الأفراد وحقوقهم عبر الإنترنت. يتضمن ذلك عدم نشر معلومات خاصة بالآخرين دون إذنهم وتجنب التحرش الرقمي. التواصل اللائق: يشجع السلوك الرقمي على التواصل بطريقة لائقة ومحترمة عبر وسائل التواصل الاجتماعي والرسائل الإلكترونية، مع تجنب اللغة العدائية أو التجاوزية. الأمان الرقمي: تشمل آداب السلوك الرقمي الحرص على الأمان الشخصي والرقمي، مثل استخدام كلمات مرور قوية وتحديث البرامج والتطبيقات بانتظام. الوعي بالمعلومات: يجب على المستخدمين تطوير وعيهم بشكل دائم حيال تحقق الأخبار والمعلومات عبر الإنترنت، والتحقق من مصداقية المصادر قبل نشر المعلومات. التواصل الإيجابي: يشجع السلوك الرقمي على التفاعل الإيجابي والداعم عبر وسائل التواصل الاجتماعي، وتجنب الانجراف إلى التعليقات السلبية أو الهجومية.";

let txt3=" آداب السلوك في التواصل الرقمي تتطلب السلوكيات الجيدة في التواصل الرقمي احترامًا وتوجيهًا للتفاعلات الإلكترونية. إليك بعض آداب السلوك في التواصل الرقمي: احترام الآخرين: تجنب اللغة الجارحة أو التعليقات المسيئة. تجنب نشر محتوى مسيء أو مسيء للغير. استخدام لغة مهذبة:  اكتب بلغة محترمة وواضحة. تجنب استخدام الحروف الكبيرة بشكل مفرط لتجنب إظهار الغضب أو التهكم. حقوق الخصوصية: احترم خصوصية الآخرين وتجنب نشر معلومات شخصية دون إذن. التفاعل البناء: شجع على الحوار البناء وتبادل الأفكار بشكل محترم. تجنب النقد البناء واستخدم النصائح بشكل إيجابي. التحقق من الحقائق: تجنب نشر معلومات غير مؤكدة قد تؤدي إلى انتشار المعلومات الخاطئة. ";

let txt4=" التعاطف في العالم الرقمي يمكن أن يظهر بشكل مختلف عن التعاطف في الواقع الحقيقي، ولكنه لا يزال يلعب دورًا هامًا في تشكيل تفاعلات الأفراد عبر الإنترنت. إليك بعض النقاط التي تعكس كيفية تجسيد التعاطف في العالم الرقمي: التواصل الاجتماعي: الردود الإيجابية على منشورات الأفراد، وتقديم الدعم العاطفي عبر منصات التواصل الاجتماعي. مشاركة تجارب شخصية أو قصص حياة تهدف إلى إلهام الآخرين أو مشاركة المشاعر. التبرع عبر الإنترنت: المشاركة في حملات تبرع عبر الإنترنت للمساعدة في حالات الطوارئ أو دعم القضايا الاجتماعية. التفاعل مع المحتوى: إبداء التفاعل الإيجابي مع المحتوى الذي يعبر عن مشاعر إيجابية أو يروج للتفاهم والتسامح. التحدث عبر وسائل الاتصال عبر الإنترنت: مشاركة التجارب الشخصية وتقديم النصائح أو الدعم للأفراد الذين يمرون بصعوبات. المشاركة في المجتمعات عبر الإنترنت: الانخراط في منتديات أو مجتمعات عبر الإنترنت التي تركز على التبادل الإيجابي ودعم الأعضاء. إبراز التفاهم والاحترام: الامتناع عن التحدث بشكل سلبي أو إلحاق الضرر العاطفي بالآخرين عبر الإنترنت. التواصل عبر وسائل الاتصال المباشر: استخدام التطبيقات الرقمية للتحدث مباشرة مع الأصدقاء والعائلة لتقديم الدعم العاطفي.";

let txt5=" التواصل والعلاقات الرقمية يشيران إلى كيفية التفاعل والتواصل بين الأفراد والمجتمعات في العصر الرقمي الحديث، حيث تلعب التكنولوجيا ووسائل الإعلام الاجتماعية دورًا هامًا في تشكيل هذه العلاقات. إليك بعض الجوانب المهمة حول هذا الموضوع: وسائل التواصل الاجتماعي: تلعب الشبكات الاجتماعية مثل فيسبوك، تويتر، إنستجرام، ولينكدإن دوراً كبيراً في تيسير التواصل وبناء العلاقات الرقمية. يمكن للأفراد التواصل مع بعضهم البعض بسهولة ومشاركة تجاربهم وآرائهم. البريد الإلكتروني: يظل البريد الإلكتروني وسيلة فعّالة للتواصل الرقمي، سواء كان في العلاقات الشخصية أو العملية. يتيح البريد الإلكتروني التفاعل الفعّال والتبادل السريع للرسائل والملفات. التواصل عبر الفيديو: تقنيات الفيديو كالمكالمات الصوتية ومكالمات الفيديو تمكن الأفراد من رؤية بعضهم البعض عبر الإنترنت، مما يجعل التواصل أكثر واقعية وشخصية. التسويق الرقمي: في سياق الأعمال، يعتبر التسويق الرقمي وسيلة مهمة لبناء العلاقات مع العملاء وجذب انتباههم. من خلال وسائل مثل الإعلانات عبر الإنترنت، والتسويق عبر البريد الإلكتروني، يمكن للشركات التواصل مع جمهورها بشكل مستمر. الأمان الرقمي وحماية الخصوصية: يجب أن يكون التواصل الرقمي آمنًا ويحترم خصوصية المستخدمين. الحفاظ على معلومات الأفراد بشكل آمن يسهم في بناء الثقة وتعزيز العلاقات الرقمية.";

let txt6=" تشير قنوات التواصل والعلاقات الرقمية إلى وسائل التواصل الإلكتروني والمنصات الرقمية التي يمكن استخدامها للتفاعل والتواصل بين الأفراد والمؤسسات. تطورت هذه القنوات بسرعة مع التقدم التكنولوجي وانتشار الإنترنت.  إليك بعض القنوات الشائعة في هذا السياق: وسائل التواصل الاجتماعي -  البريد الإلكتروني - البريد الإلكتروني الشخصي - حملات البريد الإلكتروني التسويقي - الدردشة الفورية - المدونات والمنصات الرقمية - المنتديات ومجتمعات الإنترنت - التطبيقات الهاتفية";

let txt7="تحديد حدود التواصل في العلاقات الرقمية يعتمد على عدة عوامل، وهذه الحدود تختلف من شخص لآخر وتعتمد على التفاهم المشترك واحترام الخصوصية. فيما يلي بعض النصائح التي يمكن أن تساعد في تحديد حدود صحية للتواصل الرقمي: تحديد الأوقات المناسبة: حدد أوقات محددة للتواصل عبر وسائل الإعلام الاجتماعية أو البريد الإلكتروني. يمكن أن يساعد هذا في تقليل التشتت وتحسين التركيز على الأمور الأخرى في الحياة. احترام الخصوصية: تحدث مع الأشخاص الآخرين حول مدى رغبتك في مشاركة المعلومات الشخصية وضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي بطريقة تلبي توقعاتك. الحفاظ على التوازن: لا تدمر حياتك الشخصية أو المهنية بسبب الوقت الكبير الذي تقضيه على وسائل التواصل الاجتماعي أو البريد الإلكتروني. حافظ على توازن صحي بين الحياة الرقمية والحياة الواقعية. تحديد الأولويات: قد تكون هناك فعاليات رقمية هامة أكثر من غيرها. حدد الأولويات وقم بتخصيص الوقت والجهد بشكل مناسب.";

let txt8=" الحوار المتحضر في العالم الرقمي يعتمد على احترام الآراء والتعبير عنها بشكل مدروس ومحترم عبر وسائل الاتصال الرقمية، مثل الشبكات الاجتماعية والمنتديات الإلكترونية. فيما يلي بعض الخصائص التي تميز الحوار المتحضر في العالم الرقمي: احترام التنوع: يعتمد الحوار المتحضر على قبول واحترام التنوع في الآراء والثقافات. يجب على المشاركين في الحوار أن يكونوا مفتوحين لفهم وجهات نظر الآخرين والاستماع إليها بدون تحيز. التفاعل الإيجابي: يشمل الحوار المتحضر التعبير عن الرأي بطريقة إيجابية وبناءة. يجب تجنب اللغة الجارحة أو التعبيرات التي قد تؤدي إلى التوتر أو الانقسام. المصداقية والشفافية: يجب على المشاركين في الحوار توفير المعلومات بشكل دقيق وصادق، وتجنب نشر المعلومات المضللة أو الزائفة. الشفافية تسهم في بناء ثقة بين الأفراد المشاركين. استخدام اللغة بعناية: ينبغي على المشاركين في الحوار استخدام لغة محترمة ومتسامحة. تجنب اللغة العدائية أو الإساءة، والتركيز على التواصل بشكل فعال. التركيز على الحقائق والأدلة: يجب دعم الآراء بالحقائق والأدلة عند الإشارة إلى مواضيع محددة. ذلك يعزز المناقشات المستندة إلى الأساسيات الواقعية.";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}
}

function Script2()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" السلوك الرقمي يشير إلى السلوك الذي يتم عبر وسائل الاتصال الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي. وفيما يلي بعض آداب السلوك الرقمي التي يُفضل اتباعها: احترام الآخرين: تجنب نشر معلومات خاصة بالآخرين دون إذن. تجنب استخدام لغة جارحة أو مهينة في التعليقات والردود. النقاش البناء: المشاركة في المناقشات بطريقة بناءة ومحترمة. تجنب الخلافات الشخصية والتحاور بشكل مثقف. تحديد الهوية: تجنب استخدام الهويات المزيفة أو الانتحال للهويات الأخرى. كن صادقًا في التفاعلات الرقمية. الحفاظ على الخصوصية: تجنب مشاركة معلومات خاصة تتعلق بالحياة الشخصية دون تفكير جيد. ضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي والحفاظ على حقوقك. مراعاة حقوق الملكية: عدم استخدام محتوى آخرين دون إذن منهم. الاحترام الكامل لحقوق الملكية الفكرية. التحقق من صحة المعلومات: التحقق من صحة المعلومات قبل نشرها لتفادي نشر المعلومات الخاطئة ";

let txt2=" أهمية آداب السلوك الرقمي تشير إلى مجموعة من السلوكيات والقواعد التي يجب على الأفراد اتباعها أثناء استخدامهم للتكنولوجيا الرقمية ووسائل التواصل الاجتماعي. تتنوع هذه القواعد والآداب وتشمل الاحترام والأمان الرقمي والتواصل اللائق عبر الإنترنت. إليك بعض أهمية آداب السلوك الرقمي: الاحترام وحقوق الآخرين: تشجع آداب السلوك الرقمي على احترام خصوصية الأفراد وحقوقهم عبر الإنترنت. يتضمن ذلك عدم نشر معلومات خاصة بالآخرين دون إذنهم وتجنب التحرش الرقمي. التواصل اللائق: يشجع السلوك الرقمي على التواصل بطريقة لائقة ومحترمة عبر وسائل التواصل الاجتماعي والرسائل الإلكترونية، مع تجنب اللغة العدائية أو التجاوزية. الأمان الرقمي: تشمل آداب السلوك الرقمي الحرص على الأمان الشخصي والرقمي، مثل استخدام كلمات مرور قوية وتحديث البرامج والتطبيقات بانتظام. الوعي بالمعلومات: يجب على المستخدمين تطوير وعيهم بشكل دائم حيال تحقق الأخبار والمعلومات عبر الإنترنت، والتحقق من مصداقية المصادر قبل نشر المعلومات. التواصل الإيجابي: يشجع السلوك الرقمي على التفاعل الإيجابي والداعم عبر وسائل التواصل الاجتماعي، وتجنب الانجراف إلى التعليقات السلبية أو الهجومية.";

let txt3=" آداب السلوك في التواصل الرقمي تتطلب السلوكيات الجيدة في التواصل الرقمي احترامًا وتوجيهًا للتفاعلات الإلكترونية. إليك بعض آداب السلوك في التواصل الرقمي: احترام الآخرين: تجنب اللغة الجارحة أو التعليقات المسيئة. تجنب نشر محتوى مسيء أو مسيء للغير. استخدام لغة مهذبة:  اكتب بلغة محترمة وواضحة. تجنب استخدام الحروف الكبيرة بشكل مفرط لتجنب إظهار الغضب أو التهكم. حقوق الخصوصية: احترم خصوصية الآخرين وتجنب نشر معلومات شخصية دون إذن. التفاعل البناء: شجع على الحوار البناء وتبادل الأفكار بشكل محترم. تجنب النقد البناء واستخدم النصائح بشكل إيجابي. التحقق من الحقائق: تجنب نشر معلومات غير مؤكدة قد تؤدي إلى انتشار المعلومات الخاطئة. ";

let txt4=" التعاطف في العالم الرقمي يمكن أن يظهر بشكل مختلف عن التعاطف في الواقع الحقيقي، ولكنه لا يزال يلعب دورًا هامًا في تشكيل تفاعلات الأفراد عبر الإنترنت. إليك بعض النقاط التي تعكس كيفية تجسيد التعاطف في العالم الرقمي: التواصل الاجتماعي: الردود الإيجابية على منشورات الأفراد، وتقديم الدعم العاطفي عبر منصات التواصل الاجتماعي. مشاركة تجارب شخصية أو قصص حياة تهدف إلى إلهام الآخرين أو مشاركة المشاعر. التبرع عبر الإنترنت: المشاركة في حملات تبرع عبر الإنترنت للمساعدة في حالات الطوارئ أو دعم القضايا الاجتماعية. التفاعل مع المحتوى: إبداء التفاعل الإيجابي مع المحتوى الذي يعبر عن مشاعر إيجابية أو يروج للتفاهم والتسامح. التحدث عبر وسائل الاتصال عبر الإنترنت: مشاركة التجارب الشخصية وتقديم النصائح أو الدعم للأفراد الذين يمرون بصعوبات. المشاركة في المجتمعات عبر الإنترنت: الانخراط في منتديات أو مجتمعات عبر الإنترنت التي تركز على التبادل الإيجابي ودعم الأعضاء. إبراز التفاهم والاحترام: الامتناع عن التحدث بشكل سلبي أو إلحاق الضرر العاطفي بالآخرين عبر الإنترنت. التواصل عبر وسائل الاتصال المباشر: استخدام التطبيقات الرقمية للتحدث مباشرة مع الأصدقاء والعائلة لتقديم الدعم العاطفي.";

let txt5=" التواصل والعلاقات الرقمية يشيران إلى كيفية التفاعل والتواصل بين الأفراد والمجتمعات في العصر الرقمي الحديث، حيث تلعب التكنولوجيا ووسائل الإعلام الاجتماعية دورًا هامًا في تشكيل هذه العلاقات. إليك بعض الجوانب المهمة حول هذا الموضوع: وسائل التواصل الاجتماعي: تلعب الشبكات الاجتماعية مثل فيسبوك، تويتر، إنستجرام، ولينكدإن دوراً كبيراً في تيسير التواصل وبناء العلاقات الرقمية. يمكن للأفراد التواصل مع بعضهم البعض بسهولة ومشاركة تجاربهم وآرائهم. البريد الإلكتروني: يظل البريد الإلكتروني وسيلة فعّالة للتواصل الرقمي، سواء كان في العلاقات الشخصية أو العملية. يتيح البريد الإلكتروني التفاعل الفعّال والتبادل السريع للرسائل والملفات. التواصل عبر الفيديو: تقنيات الفيديو كالمكالمات الصوتية ومكالمات الفيديو تمكن الأفراد من رؤية بعضهم البعض عبر الإنترنت، مما يجعل التواصل أكثر واقعية وشخصية. التسويق الرقمي: في سياق الأعمال، يعتبر التسويق الرقمي وسيلة مهمة لبناء العلاقات مع العملاء وجذب انتباههم. من خلال وسائل مثل الإعلانات عبر الإنترنت، والتسويق عبر البريد الإلكتروني، يمكن للشركات التواصل مع جمهورها بشكل مستمر. الأمان الرقمي وحماية الخصوصية: يجب أن يكون التواصل الرقمي آمنًا ويحترم خصوصية المستخدمين. الحفاظ على معلومات الأفراد بشكل آمن يسهم في بناء الثقة وتعزيز العلاقات الرقمية.";

let txt6=" تشير قنوات التواصل والعلاقات الرقمية إلى وسائل التواصل الإلكتروني والمنصات الرقمية التي يمكن استخدامها للتفاعل والتواصل بين الأفراد والمؤسسات. تطورت هذه القنوات بسرعة مع التقدم التكنولوجي وانتشار الإنترنت.  إليك بعض القنوات الشائعة في هذا السياق: وسائل التواصل الاجتماعي -  البريد الإلكتروني - البريد الإلكتروني الشخصي - حملات البريد الإلكتروني التسويقي - الدردشة الفورية - المدونات والمنصات الرقمية - المنتديات ومجتمعات الإنترنت - التطبيقات الهاتفية";

let txt7="تحديد حدود التواصل في العلاقات الرقمية يعتمد على عدة عوامل، وهذه الحدود تختلف من شخص لآخر وتعتمد على التفاهم المشترك واحترام الخصوصية. فيما يلي بعض النصائح التي يمكن أن تساعد في تحديد حدود صحية للتواصل الرقمي: تحديد الأوقات المناسبة: حدد أوقات محددة للتواصل عبر وسائل الإعلام الاجتماعية أو البريد الإلكتروني. يمكن أن يساعد هذا في تقليل التشتت وتحسين التركيز على الأمور الأخرى في الحياة. احترام الخصوصية: تحدث مع الأشخاص الآخرين حول مدى رغبتك في مشاركة المعلومات الشخصية وضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي بطريقة تلبي توقعاتك. الحفاظ على التوازن: لا تدمر حياتك الشخصية أو المهنية بسبب الوقت الكبير الذي تقضيه على وسائل التواصل الاجتماعي أو البريد الإلكتروني. حافظ على توازن صحي بين الحياة الرقمية والحياة الواقعية. تحديد الأولويات: قد تكون هناك فعاليات رقمية هامة أكثر من غيرها. حدد الأولويات وقم بتخصيص الوقت والجهد بشكل مناسب.";

let txt8=" الحوار المتحضر في العالم الرقمي يعتمد على احترام الآراء والتعبير عنها بشكل مدروس ومحترم عبر وسائل الاتصال الرقمية، مثل الشبكات الاجتماعية والمنتديات الإلكترونية. فيما يلي بعض الخصائص التي تميز الحوار المتحضر في العالم الرقمي: احترام التنوع: يعتمد الحوار المتحضر على قبول واحترام التنوع في الآراء والثقافات. يجب على المشاركين في الحوار أن يكونوا مفتوحين لفهم وجهات نظر الآخرين والاستماع إليها بدون تحيز. التفاعل الإيجابي: يشمل الحوار المتحضر التعبير عن الرأي بطريقة إيجابية وبناءة. يجب تجنب اللغة الجارحة أو التعبيرات التي قد تؤدي إلى التوتر أو الانقسام. المصداقية والشفافية: يجب على المشاركين في الحوار توفير المعلومات بشكل دقيق وصادق، وتجنب نشر المعلومات المضللة أو الزائفة. الشفافية تسهم في بناء ثقة بين الأفراد المشاركين. استخدام اللغة بعناية: ينبغي على المشاركين في الحوار استخدام لغة محترمة ومتسامحة. تجنب اللغة العدائية أو الإساءة، والتركيز على التواصل بشكل فعال. التركيز على الحقائق والأدلة: يجب دعم الآراء بالحقائق والأدلة عند الإشارة إلى مواضيع محددة. ذلك يعزز المناقشات المستندة إلى الأساسيات الواقعية.";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}
}

function Script3()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" السلوك الرقمي يشير إلى السلوك الذي يتم عبر وسائل الاتصال الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي. وفيما يلي بعض آداب السلوك الرقمي التي يُفضل اتباعها: احترام الآخرين: تجنب نشر معلومات خاصة بالآخرين دون إذن. تجنب استخدام لغة جارحة أو مهينة في التعليقات والردود. النقاش البناء: المشاركة في المناقشات بطريقة بناءة ومحترمة. تجنب الخلافات الشخصية والتحاور بشكل مثقف. تحديد الهوية: تجنب استخدام الهويات المزيفة أو الانتحال للهويات الأخرى. كن صادقًا في التفاعلات الرقمية. الحفاظ على الخصوصية: تجنب مشاركة معلومات خاصة تتعلق بالحياة الشخصية دون تفكير جيد. ضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي والحفاظ على حقوقك. مراعاة حقوق الملكية: عدم استخدام محتوى آخرين دون إذن منهم. الاحترام الكامل لحقوق الملكية الفكرية. التحقق من صحة المعلومات: التحقق من صحة المعلومات قبل نشرها لتفادي نشر المعلومات الخاطئة ";

let txt2=" أهمية آداب السلوك الرقمي تشير إلى مجموعة من السلوكيات والقواعد التي يجب على الأفراد اتباعها أثناء استخدامهم للتكنولوجيا الرقمية ووسائل التواصل الاجتماعي. تتنوع هذه القواعد والآداب وتشمل الاحترام والأمان الرقمي والتواصل اللائق عبر الإنترنت. إليك بعض أهمية آداب السلوك الرقمي: الاحترام وحقوق الآخرين: تشجع آداب السلوك الرقمي على احترام خصوصية الأفراد وحقوقهم عبر الإنترنت. يتضمن ذلك عدم نشر معلومات خاصة بالآخرين دون إذنهم وتجنب التحرش الرقمي. التواصل اللائق: يشجع السلوك الرقمي على التواصل بطريقة لائقة ومحترمة عبر وسائل التواصل الاجتماعي والرسائل الإلكترونية، مع تجنب اللغة العدائية أو التجاوزية. الأمان الرقمي: تشمل آداب السلوك الرقمي الحرص على الأمان الشخصي والرقمي، مثل استخدام كلمات مرور قوية وتحديث البرامج والتطبيقات بانتظام. الوعي بالمعلومات: يجب على المستخدمين تطوير وعيهم بشكل دائم حيال تحقق الأخبار والمعلومات عبر الإنترنت، والتحقق من مصداقية المصادر قبل نشر المعلومات. التواصل الإيجابي: يشجع السلوك الرقمي على التفاعل الإيجابي والداعم عبر وسائل التواصل الاجتماعي، وتجنب الانجراف إلى التعليقات السلبية أو الهجومية.";

let txt3=" آداب السلوك في التواصل الرقمي تتطلب السلوكيات الجيدة في التواصل الرقمي احترامًا وتوجيهًا للتفاعلات الإلكترونية. إليك بعض آداب السلوك في التواصل الرقمي: احترام الآخرين: تجنب اللغة الجارحة أو التعليقات المسيئة. تجنب نشر محتوى مسيء أو مسيء للغير. استخدام لغة مهذبة:  اكتب بلغة محترمة وواضحة. تجنب استخدام الحروف الكبيرة بشكل مفرط لتجنب إظهار الغضب أو التهكم. حقوق الخصوصية: احترم خصوصية الآخرين وتجنب نشر معلومات شخصية دون إذن. التفاعل البناء: شجع على الحوار البناء وتبادل الأفكار بشكل محترم. تجنب النقد البناء واستخدم النصائح بشكل إيجابي. التحقق من الحقائق: تجنب نشر معلومات غير مؤكدة قد تؤدي إلى انتشار المعلومات الخاطئة. ";

let txt4=" التعاطف في العالم الرقمي يمكن أن يظهر بشكل مختلف عن التعاطف في الواقع الحقيقي، ولكنه لا يزال يلعب دورًا هامًا في تشكيل تفاعلات الأفراد عبر الإنترنت. إليك بعض النقاط التي تعكس كيفية تجسيد التعاطف في العالم الرقمي: التواصل الاجتماعي: الردود الإيجابية على منشورات الأفراد، وتقديم الدعم العاطفي عبر منصات التواصل الاجتماعي. مشاركة تجارب شخصية أو قصص حياة تهدف إلى إلهام الآخرين أو مشاركة المشاعر. التبرع عبر الإنترنت: المشاركة في حملات تبرع عبر الإنترنت للمساعدة في حالات الطوارئ أو دعم القضايا الاجتماعية. التفاعل مع المحتوى: إبداء التفاعل الإيجابي مع المحتوى الذي يعبر عن مشاعر إيجابية أو يروج للتفاهم والتسامح. التحدث عبر وسائل الاتصال عبر الإنترنت: مشاركة التجارب الشخصية وتقديم النصائح أو الدعم للأفراد الذين يمرون بصعوبات. المشاركة في المجتمعات عبر الإنترنت: الانخراط في منتديات أو مجتمعات عبر الإنترنت التي تركز على التبادل الإيجابي ودعم الأعضاء. إبراز التفاهم والاحترام: الامتناع عن التحدث بشكل سلبي أو إلحاق الضرر العاطفي بالآخرين عبر الإنترنت. التواصل عبر وسائل الاتصال المباشر: استخدام التطبيقات الرقمية للتحدث مباشرة مع الأصدقاء والعائلة لتقديم الدعم العاطفي.";

let txt5=" التواصل والعلاقات الرقمية يشيران إلى كيفية التفاعل والتواصل بين الأفراد والمجتمعات في العصر الرقمي الحديث، حيث تلعب التكنولوجيا ووسائل الإعلام الاجتماعية دورًا هامًا في تشكيل هذه العلاقات. إليك بعض الجوانب المهمة حول هذا الموضوع: وسائل التواصل الاجتماعي: تلعب الشبكات الاجتماعية مثل فيسبوك، تويتر، إنستجرام، ولينكدإن دوراً كبيراً في تيسير التواصل وبناء العلاقات الرقمية. يمكن للأفراد التواصل مع بعضهم البعض بسهولة ومشاركة تجاربهم وآرائهم. البريد الإلكتروني: يظل البريد الإلكتروني وسيلة فعّالة للتواصل الرقمي، سواء كان في العلاقات الشخصية أو العملية. يتيح البريد الإلكتروني التفاعل الفعّال والتبادل السريع للرسائل والملفات. التواصل عبر الفيديو: تقنيات الفيديو كالمكالمات الصوتية ومكالمات الفيديو تمكن الأفراد من رؤية بعضهم البعض عبر الإنترنت، مما يجعل التواصل أكثر واقعية وشخصية. التسويق الرقمي: في سياق الأعمال، يعتبر التسويق الرقمي وسيلة مهمة لبناء العلاقات مع العملاء وجذب انتباههم. من خلال وسائل مثل الإعلانات عبر الإنترنت، والتسويق عبر البريد الإلكتروني، يمكن للشركات التواصل مع جمهورها بشكل مستمر. الأمان الرقمي وحماية الخصوصية: يجب أن يكون التواصل الرقمي آمنًا ويحترم خصوصية المستخدمين. الحفاظ على معلومات الأفراد بشكل آمن يسهم في بناء الثقة وتعزيز العلاقات الرقمية.";

let txt6=" تشير قنوات التواصل والعلاقات الرقمية إلى وسائل التواصل الإلكتروني والمنصات الرقمية التي يمكن استخدامها للتفاعل والتواصل بين الأفراد والمؤسسات. تطورت هذه القنوات بسرعة مع التقدم التكنولوجي وانتشار الإنترنت.  إليك بعض القنوات الشائعة في هذا السياق: وسائل التواصل الاجتماعي -  البريد الإلكتروني - البريد الإلكتروني الشخصي - حملات البريد الإلكتروني التسويقي - الدردشة الفورية - المدونات والمنصات الرقمية - المنتديات ومجتمعات الإنترنت - التطبيقات الهاتفية";

let txt7="تحديد حدود التواصل في العلاقات الرقمية يعتمد على عدة عوامل، وهذه الحدود تختلف من شخص لآخر وتعتمد على التفاهم المشترك واحترام الخصوصية. فيما يلي بعض النصائح التي يمكن أن تساعد في تحديد حدود صحية للتواصل الرقمي: تحديد الأوقات المناسبة: حدد أوقات محددة للتواصل عبر وسائل الإعلام الاجتماعية أو البريد الإلكتروني. يمكن أن يساعد هذا في تقليل التشتت وتحسين التركيز على الأمور الأخرى في الحياة. احترام الخصوصية: تحدث مع الأشخاص الآخرين حول مدى رغبتك في مشاركة المعلومات الشخصية وضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي بطريقة تلبي توقعاتك. الحفاظ على التوازن: لا تدمر حياتك الشخصية أو المهنية بسبب الوقت الكبير الذي تقضيه على وسائل التواصل الاجتماعي أو البريد الإلكتروني. حافظ على توازن صحي بين الحياة الرقمية والحياة الواقعية. تحديد الأولويات: قد تكون هناك فعاليات رقمية هامة أكثر من غيرها. حدد الأولويات وقم بتخصيص الوقت والجهد بشكل مناسب.";

let txt8=" الحوار المتحضر في العالم الرقمي يعتمد على احترام الآراء والتعبير عنها بشكل مدروس ومحترم عبر وسائل الاتصال الرقمية، مثل الشبكات الاجتماعية والمنتديات الإلكترونية. فيما يلي بعض الخصائص التي تميز الحوار المتحضر في العالم الرقمي: احترام التنوع: يعتمد الحوار المتحضر على قبول واحترام التنوع في الآراء والثقافات. يجب على المشاركين في الحوار أن يكونوا مفتوحين لفهم وجهات نظر الآخرين والاستماع إليها بدون تحيز. التفاعل الإيجابي: يشمل الحوار المتحضر التعبير عن الرأي بطريقة إيجابية وبناءة. يجب تجنب اللغة الجارحة أو التعبيرات التي قد تؤدي إلى التوتر أو الانقسام. المصداقية والشفافية: يجب على المشاركين في الحوار توفير المعلومات بشكل دقيق وصادق، وتجنب نشر المعلومات المضللة أو الزائفة. الشفافية تسهم في بناء ثقة بين الأفراد المشاركين. استخدام اللغة بعناية: ينبغي على المشاركين في الحوار استخدام لغة محترمة ومتسامحة. تجنب اللغة العدائية أو الإساءة، والتركيز على التواصل بشكل فعال. التركيز على الحقائق والأدلة: يجب دعم الآراء بالحقائق والأدلة عند الإشارة إلى مواضيع محددة. ذلك يعزز المناقشات المستندة إلى الأساسيات الواقعية.";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}
}

function Script4()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" السلوك الرقمي يشير إلى السلوك الذي يتم عبر وسائل الاتصال الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي. وفيما يلي بعض آداب السلوك الرقمي التي يُفضل اتباعها: احترام الآخرين: تجنب نشر معلومات خاصة بالآخرين دون إذن. تجنب استخدام لغة جارحة أو مهينة في التعليقات والردود. النقاش البناء: المشاركة في المناقشات بطريقة بناءة ومحترمة. تجنب الخلافات الشخصية والتحاور بشكل مثقف. تحديد الهوية: تجنب استخدام الهويات المزيفة أو الانتحال للهويات الأخرى. كن صادقًا في التفاعلات الرقمية. الحفاظ على الخصوصية: تجنب مشاركة معلومات خاصة تتعلق بالحياة الشخصية دون تفكير جيد. ضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي والحفاظ على حقوقك. مراعاة حقوق الملكية: عدم استخدام محتوى آخرين دون إذن منهم. الاحترام الكامل لحقوق الملكية الفكرية. التحقق من صحة المعلومات: التحقق من صحة المعلومات قبل نشرها لتفادي نشر المعلومات الخاطئة ";

let txt2=" أهمية آداب السلوك الرقمي تشير إلى مجموعة من السلوكيات والقواعد التي يجب على الأفراد اتباعها أثناء استخدامهم للتكنولوجيا الرقمية ووسائل التواصل الاجتماعي. تتنوع هذه القواعد والآداب وتشمل الاحترام والأمان الرقمي والتواصل اللائق عبر الإنترنت. إليك بعض أهمية آداب السلوك الرقمي: الاحترام وحقوق الآخرين: تشجع آداب السلوك الرقمي على احترام خصوصية الأفراد وحقوقهم عبر الإنترنت. يتضمن ذلك عدم نشر معلومات خاصة بالآخرين دون إذنهم وتجنب التحرش الرقمي. التواصل اللائق: يشجع السلوك الرقمي على التواصل بطريقة لائقة ومحترمة عبر وسائل التواصل الاجتماعي والرسائل الإلكترونية، مع تجنب اللغة العدائية أو التجاوزية. الأمان الرقمي: تشمل آداب السلوك الرقمي الحرص على الأمان الشخصي والرقمي، مثل استخدام كلمات مرور قوية وتحديث البرامج والتطبيقات بانتظام. الوعي بالمعلومات: يجب على المستخدمين تطوير وعيهم بشكل دائم حيال تحقق الأخبار والمعلومات عبر الإنترنت، والتحقق من مصداقية المصادر قبل نشر المعلومات. التواصل الإيجابي: يشجع السلوك الرقمي على التفاعل الإيجابي والداعم عبر وسائل التواصل الاجتماعي، وتجنب الانجراف إلى التعليقات السلبية أو الهجومية.";

let txt3=" آداب السلوك في التواصل الرقمي تتطلب السلوكيات الجيدة في التواصل الرقمي احترامًا وتوجيهًا للتفاعلات الإلكترونية. إليك بعض آداب السلوك في التواصل الرقمي: احترام الآخرين: تجنب اللغة الجارحة أو التعليقات المسيئة. تجنب نشر محتوى مسيء أو مسيء للغير. استخدام لغة مهذبة:  اكتب بلغة محترمة وواضحة. تجنب استخدام الحروف الكبيرة بشكل مفرط لتجنب إظهار الغضب أو التهكم. حقوق الخصوصية: احترم خصوصية الآخرين وتجنب نشر معلومات شخصية دون إذن. التفاعل البناء: شجع على الحوار البناء وتبادل الأفكار بشكل محترم. تجنب النقد البناء واستخدم النصائح بشكل إيجابي. التحقق من الحقائق: تجنب نشر معلومات غير مؤكدة قد تؤدي إلى انتشار المعلومات الخاطئة. ";

let txt4=" التعاطف في العالم الرقمي يمكن أن يظهر بشكل مختلف عن التعاطف في الواقع الحقيقي، ولكنه لا يزال يلعب دورًا هامًا في تشكيل تفاعلات الأفراد عبر الإنترنت. إليك بعض النقاط التي تعكس كيفية تجسيد التعاطف في العالم الرقمي: التواصل الاجتماعي: الردود الإيجابية على منشورات الأفراد، وتقديم الدعم العاطفي عبر منصات التواصل الاجتماعي. مشاركة تجارب شخصية أو قصص حياة تهدف إلى إلهام الآخرين أو مشاركة المشاعر. التبرع عبر الإنترنت: المشاركة في حملات تبرع عبر الإنترنت للمساعدة في حالات الطوارئ أو دعم القضايا الاجتماعية. التفاعل مع المحتوى: إبداء التفاعل الإيجابي مع المحتوى الذي يعبر عن مشاعر إيجابية أو يروج للتفاهم والتسامح. التحدث عبر وسائل الاتصال عبر الإنترنت: مشاركة التجارب الشخصية وتقديم النصائح أو الدعم للأفراد الذين يمرون بصعوبات. المشاركة في المجتمعات عبر الإنترنت: الانخراط في منتديات أو مجتمعات عبر الإنترنت التي تركز على التبادل الإيجابي ودعم الأعضاء. إبراز التفاهم والاحترام: الامتناع عن التحدث بشكل سلبي أو إلحاق الضرر العاطفي بالآخرين عبر الإنترنت. التواصل عبر وسائل الاتصال المباشر: استخدام التطبيقات الرقمية للتحدث مباشرة مع الأصدقاء والعائلة لتقديم الدعم العاطفي.";

let txt5=" التواصل والعلاقات الرقمية يشيران إلى كيفية التفاعل والتواصل بين الأفراد والمجتمعات في العصر الرقمي الحديث، حيث تلعب التكنولوجيا ووسائل الإعلام الاجتماعية دورًا هامًا في تشكيل هذه العلاقات. إليك بعض الجوانب المهمة حول هذا الموضوع: وسائل التواصل الاجتماعي: تلعب الشبكات الاجتماعية مثل فيسبوك، تويتر، إنستجرام، ولينكدإن دوراً كبيراً في تيسير التواصل وبناء العلاقات الرقمية. يمكن للأفراد التواصل مع بعضهم البعض بسهولة ومشاركة تجاربهم وآرائهم. البريد الإلكتروني: يظل البريد الإلكتروني وسيلة فعّالة للتواصل الرقمي، سواء كان في العلاقات الشخصية أو العملية. يتيح البريد الإلكتروني التفاعل الفعّال والتبادل السريع للرسائل والملفات. التواصل عبر الفيديو: تقنيات الفيديو كالمكالمات الصوتية ومكالمات الفيديو تمكن الأفراد من رؤية بعضهم البعض عبر الإنترنت، مما يجعل التواصل أكثر واقعية وشخصية. التسويق الرقمي: في سياق الأعمال، يعتبر التسويق الرقمي وسيلة مهمة لبناء العلاقات مع العملاء وجذب انتباههم. من خلال وسائل مثل الإعلانات عبر الإنترنت، والتسويق عبر البريد الإلكتروني، يمكن للشركات التواصل مع جمهورها بشكل مستمر. الأمان الرقمي وحماية الخصوصية: يجب أن يكون التواصل الرقمي آمنًا ويحترم خصوصية المستخدمين. الحفاظ على معلومات الأفراد بشكل آمن يسهم في بناء الثقة وتعزيز العلاقات الرقمية.";

let txt6=" تشير قنوات التواصل والعلاقات الرقمية إلى وسائل التواصل الإلكتروني والمنصات الرقمية التي يمكن استخدامها للتفاعل والتواصل بين الأفراد والمؤسسات. تطورت هذه القنوات بسرعة مع التقدم التكنولوجي وانتشار الإنترنت.  إليك بعض القنوات الشائعة في هذا السياق: وسائل التواصل الاجتماعي -  البريد الإلكتروني - البريد الإلكتروني الشخصي - حملات البريد الإلكتروني التسويقي - الدردشة الفورية - المدونات والمنصات الرقمية - المنتديات ومجتمعات الإنترنت - التطبيقات الهاتفية";

let txt7="تحديد حدود التواصل في العلاقات الرقمية يعتمد على عدة عوامل، وهذه الحدود تختلف من شخص لآخر وتعتمد على التفاهم المشترك واحترام الخصوصية. فيما يلي بعض النصائح التي يمكن أن تساعد في تحديد حدود صحية للتواصل الرقمي: تحديد الأوقات المناسبة: حدد أوقات محددة للتواصل عبر وسائل الإعلام الاجتماعية أو البريد الإلكتروني. يمكن أن يساعد هذا في تقليل التشتت وتحسين التركيز على الأمور الأخرى في الحياة. احترام الخصوصية: تحدث مع الأشخاص الآخرين حول مدى رغبتك في مشاركة المعلومات الشخصية وضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي بطريقة تلبي توقعاتك. الحفاظ على التوازن: لا تدمر حياتك الشخصية أو المهنية بسبب الوقت الكبير الذي تقضيه على وسائل التواصل الاجتماعي أو البريد الإلكتروني. حافظ على توازن صحي بين الحياة الرقمية والحياة الواقعية. تحديد الأولويات: قد تكون هناك فعاليات رقمية هامة أكثر من غيرها. حدد الأولويات وقم بتخصيص الوقت والجهد بشكل مناسب.";

let txt8=" الحوار المتحضر في العالم الرقمي يعتمد على احترام الآراء والتعبير عنها بشكل مدروس ومحترم عبر وسائل الاتصال الرقمية، مثل الشبكات الاجتماعية والمنتديات الإلكترونية. فيما يلي بعض الخصائص التي تميز الحوار المتحضر في العالم الرقمي: احترام التنوع: يعتمد الحوار المتحضر على قبول واحترام التنوع في الآراء والثقافات. يجب على المشاركين في الحوار أن يكونوا مفتوحين لفهم وجهات نظر الآخرين والاستماع إليها بدون تحيز. التفاعل الإيجابي: يشمل الحوار المتحضر التعبير عن الرأي بطريقة إيجابية وبناءة. يجب تجنب اللغة الجارحة أو التعبيرات التي قد تؤدي إلى التوتر أو الانقسام. المصداقية والشفافية: يجب على المشاركين في الحوار توفير المعلومات بشكل دقيق وصادق، وتجنب نشر المعلومات المضللة أو الزائفة. الشفافية تسهم في بناء ثقة بين الأفراد المشاركين. استخدام اللغة بعناية: ينبغي على المشاركين في الحوار استخدام لغة محترمة ومتسامحة. تجنب اللغة العدائية أو الإساءة، والتركيز على التواصل بشكل فعال. التركيز على الحقائق والأدلة: يجب دعم الآراء بالحقائق والأدلة عند الإشارة إلى مواضيع محددة. ذلك يعزز المناقشات المستندة إلى الأساسيات الواقعية.";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}
}

function Script5()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" السلوك الرقمي يشير إلى السلوك الذي يتم عبر وسائل الاتصال الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي. وفيما يلي بعض آداب السلوك الرقمي التي يُفضل اتباعها: احترام الآخرين: تجنب نشر معلومات خاصة بالآخرين دون إذن. تجنب استخدام لغة جارحة أو مهينة في التعليقات والردود. النقاش البناء: المشاركة في المناقشات بطريقة بناءة ومحترمة. تجنب الخلافات الشخصية والتحاور بشكل مثقف. تحديد الهوية: تجنب استخدام الهويات المزيفة أو الانتحال للهويات الأخرى. كن صادقًا في التفاعلات الرقمية. الحفاظ على الخصوصية: تجنب مشاركة معلومات خاصة تتعلق بالحياة الشخصية دون تفكير جيد. ضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي والحفاظ على حقوقك. مراعاة حقوق الملكية: عدم استخدام محتوى آخرين دون إذن منهم. الاحترام الكامل لحقوق الملكية الفكرية. التحقق من صحة المعلومات: التحقق من صحة المعلومات قبل نشرها لتفادي نشر المعلومات الخاطئة ";

let txt2=" أهمية آداب السلوك الرقمي تشير إلى مجموعة من السلوكيات والقواعد التي يجب على الأفراد اتباعها أثناء استخدامهم للتكنولوجيا الرقمية ووسائل التواصل الاجتماعي. تتنوع هذه القواعد والآداب وتشمل الاحترام والأمان الرقمي والتواصل اللائق عبر الإنترنت. إليك بعض أهمية آداب السلوك الرقمي: الاحترام وحقوق الآخرين: تشجع آداب السلوك الرقمي على احترام خصوصية الأفراد وحقوقهم عبر الإنترنت. يتضمن ذلك عدم نشر معلومات خاصة بالآخرين دون إذنهم وتجنب التحرش الرقمي. التواصل اللائق: يشجع السلوك الرقمي على التواصل بطريقة لائقة ومحترمة عبر وسائل التواصل الاجتماعي والرسائل الإلكترونية، مع تجنب اللغة العدائية أو التجاوزية. الأمان الرقمي: تشمل آداب السلوك الرقمي الحرص على الأمان الشخصي والرقمي، مثل استخدام كلمات مرور قوية وتحديث البرامج والتطبيقات بانتظام. الوعي بالمعلومات: يجب على المستخدمين تطوير وعيهم بشكل دائم حيال تحقق الأخبار والمعلومات عبر الإنترنت، والتحقق من مصداقية المصادر قبل نشر المعلومات. التواصل الإيجابي: يشجع السلوك الرقمي على التفاعل الإيجابي والداعم عبر وسائل التواصل الاجتماعي، وتجنب الانجراف إلى التعليقات السلبية أو الهجومية.";

let txt3=" آداب السلوك في التواصل الرقمي تتطلب السلوكيات الجيدة في التواصل الرقمي احترامًا وتوجيهًا للتفاعلات الإلكترونية. إليك بعض آداب السلوك في التواصل الرقمي: احترام الآخرين: تجنب اللغة الجارحة أو التعليقات المسيئة. تجنب نشر محتوى مسيء أو مسيء للغير. استخدام لغة مهذبة:  اكتب بلغة محترمة وواضحة. تجنب استخدام الحروف الكبيرة بشكل مفرط لتجنب إظهار الغضب أو التهكم. حقوق الخصوصية: احترم خصوصية الآخرين وتجنب نشر معلومات شخصية دون إذن. التفاعل البناء: شجع على الحوار البناء وتبادل الأفكار بشكل محترم. تجنب النقد البناء واستخدم النصائح بشكل إيجابي. التحقق من الحقائق: تجنب نشر معلومات غير مؤكدة قد تؤدي إلى انتشار المعلومات الخاطئة. ";

let txt4=" التعاطف في العالم الرقمي يمكن أن يظهر بشكل مختلف عن التعاطف في الواقع الحقيقي، ولكنه لا يزال يلعب دورًا هامًا في تشكيل تفاعلات الأفراد عبر الإنترنت. إليك بعض النقاط التي تعكس كيفية تجسيد التعاطف في العالم الرقمي: التواصل الاجتماعي: الردود الإيجابية على منشورات الأفراد، وتقديم الدعم العاطفي عبر منصات التواصل الاجتماعي. مشاركة تجارب شخصية أو قصص حياة تهدف إلى إلهام الآخرين أو مشاركة المشاعر. التبرع عبر الإنترنت: المشاركة في حملات تبرع عبر الإنترنت للمساعدة في حالات الطوارئ أو دعم القضايا الاجتماعية. التفاعل مع المحتوى: إبداء التفاعل الإيجابي مع المحتوى الذي يعبر عن مشاعر إيجابية أو يروج للتفاهم والتسامح. التحدث عبر وسائل الاتصال عبر الإنترنت: مشاركة التجارب الشخصية وتقديم النصائح أو الدعم للأفراد الذين يمرون بصعوبات. المشاركة في المجتمعات عبر الإنترنت: الانخراط في منتديات أو مجتمعات عبر الإنترنت التي تركز على التبادل الإيجابي ودعم الأعضاء. إبراز التفاهم والاحترام: الامتناع عن التحدث بشكل سلبي أو إلحاق الضرر العاطفي بالآخرين عبر الإنترنت. التواصل عبر وسائل الاتصال المباشر: استخدام التطبيقات الرقمية للتحدث مباشرة مع الأصدقاء والعائلة لتقديم الدعم العاطفي.";

let txt5=" التواصل والعلاقات الرقمية يشيران إلى كيفية التفاعل والتواصل بين الأفراد والمجتمعات في العصر الرقمي الحديث، حيث تلعب التكنولوجيا ووسائل الإعلام الاجتماعية دورًا هامًا في تشكيل هذه العلاقات. إليك بعض الجوانب المهمة حول هذا الموضوع: وسائل التواصل الاجتماعي: تلعب الشبكات الاجتماعية مثل فيسبوك، تويتر، إنستجرام، ولينكدإن دوراً كبيراً في تيسير التواصل وبناء العلاقات الرقمية. يمكن للأفراد التواصل مع بعضهم البعض بسهولة ومشاركة تجاربهم وآرائهم. البريد الإلكتروني: يظل البريد الإلكتروني وسيلة فعّالة للتواصل الرقمي، سواء كان في العلاقات الشخصية أو العملية. يتيح البريد الإلكتروني التفاعل الفعّال والتبادل السريع للرسائل والملفات. التواصل عبر الفيديو: تقنيات الفيديو كالمكالمات الصوتية ومكالمات الفيديو تمكن الأفراد من رؤية بعضهم البعض عبر الإنترنت، مما يجعل التواصل أكثر واقعية وشخصية. التسويق الرقمي: في سياق الأعمال، يعتبر التسويق الرقمي وسيلة مهمة لبناء العلاقات مع العملاء وجذب انتباههم. من خلال وسائل مثل الإعلانات عبر الإنترنت، والتسويق عبر البريد الإلكتروني، يمكن للشركات التواصل مع جمهورها بشكل مستمر. الأمان الرقمي وحماية الخصوصية: يجب أن يكون التواصل الرقمي آمنًا ويحترم خصوصية المستخدمين. الحفاظ على معلومات الأفراد بشكل آمن يسهم في بناء الثقة وتعزيز العلاقات الرقمية.";

let txt6=" تشير قنوات التواصل والعلاقات الرقمية إلى وسائل التواصل الإلكتروني والمنصات الرقمية التي يمكن استخدامها للتفاعل والتواصل بين الأفراد والمؤسسات. تطورت هذه القنوات بسرعة مع التقدم التكنولوجي وانتشار الإنترنت.  إليك بعض القنوات الشائعة في هذا السياق: وسائل التواصل الاجتماعي -  البريد الإلكتروني - البريد الإلكتروني الشخصي - حملات البريد الإلكتروني التسويقي - الدردشة الفورية - المدونات والمنصات الرقمية - المنتديات ومجتمعات الإنترنت - التطبيقات الهاتفية";

let txt7="تحديد حدود التواصل في العلاقات الرقمية يعتمد على عدة عوامل، وهذه الحدود تختلف من شخص لآخر وتعتمد على التفاهم المشترك واحترام الخصوصية. فيما يلي بعض النصائح التي يمكن أن تساعد في تحديد حدود صحية للتواصل الرقمي: تحديد الأوقات المناسبة: حدد أوقات محددة للتواصل عبر وسائل الإعلام الاجتماعية أو البريد الإلكتروني. يمكن أن يساعد هذا في تقليل التشتت وتحسين التركيز على الأمور الأخرى في الحياة. احترام الخصوصية: تحدث مع الأشخاص الآخرين حول مدى رغبتك في مشاركة المعلومات الشخصية وضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي بطريقة تلبي توقعاتك. الحفاظ على التوازن: لا تدمر حياتك الشخصية أو المهنية بسبب الوقت الكبير الذي تقضيه على وسائل التواصل الاجتماعي أو البريد الإلكتروني. حافظ على توازن صحي بين الحياة الرقمية والحياة الواقعية. تحديد الأولويات: قد تكون هناك فعاليات رقمية هامة أكثر من غيرها. حدد الأولويات وقم بتخصيص الوقت والجهد بشكل مناسب.";

let txt8=" الحوار المتحضر في العالم الرقمي يعتمد على احترام الآراء والتعبير عنها بشكل مدروس ومحترم عبر وسائل الاتصال الرقمية، مثل الشبكات الاجتماعية والمنتديات الإلكترونية. فيما يلي بعض الخصائص التي تميز الحوار المتحضر في العالم الرقمي: احترام التنوع: يعتمد الحوار المتحضر على قبول واحترام التنوع في الآراء والثقافات. يجب على المشاركين في الحوار أن يكونوا مفتوحين لفهم وجهات نظر الآخرين والاستماع إليها بدون تحيز. التفاعل الإيجابي: يشمل الحوار المتحضر التعبير عن الرأي بطريقة إيجابية وبناءة. يجب تجنب اللغة الجارحة أو التعبيرات التي قد تؤدي إلى التوتر أو الانقسام. المصداقية والشفافية: يجب على المشاركين في الحوار توفير المعلومات بشكل دقيق وصادق، وتجنب نشر المعلومات المضللة أو الزائفة. الشفافية تسهم في بناء ثقة بين الأفراد المشاركين. استخدام اللغة بعناية: ينبغي على المشاركين في الحوار استخدام لغة محترمة ومتسامحة. تجنب اللغة العدائية أو الإساءة، والتركيز على التواصل بشكل فعال. التركيز على الحقائق والأدلة: يجب دعم الآراء بالحقائق والأدلة عند الإشارة إلى مواضيع محددة. ذلك يعزز المناقشات المستندة إلى الأساسيات الواقعية.";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}
}

function Script6()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" السلوك الرقمي يشير إلى السلوك الذي يتم عبر وسائل الاتصال الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي. وفيما يلي بعض آداب السلوك الرقمي التي يُفضل اتباعها: احترام الآخرين: تجنب نشر معلومات خاصة بالآخرين دون إذن. تجنب استخدام لغة جارحة أو مهينة في التعليقات والردود. النقاش البناء: المشاركة في المناقشات بطريقة بناءة ومحترمة. تجنب الخلافات الشخصية والتحاور بشكل مثقف. تحديد الهوية: تجنب استخدام الهويات المزيفة أو الانتحال للهويات الأخرى. كن صادقًا في التفاعلات الرقمية. الحفاظ على الخصوصية: تجنب مشاركة معلومات خاصة تتعلق بالحياة الشخصية دون تفكير جيد. ضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي والحفاظ على حقوقك. مراعاة حقوق الملكية: عدم استخدام محتوى آخرين دون إذن منهم. الاحترام الكامل لحقوق الملكية الفكرية. التحقق من صحة المعلومات: التحقق من صحة المعلومات قبل نشرها لتفادي نشر المعلومات الخاطئة ";

let txt2=" أهمية آداب السلوك الرقمي تشير إلى مجموعة من السلوكيات والقواعد التي يجب على الأفراد اتباعها أثناء استخدامهم للتكنولوجيا الرقمية ووسائل التواصل الاجتماعي. تتنوع هذه القواعد والآداب وتشمل الاحترام والأمان الرقمي والتواصل اللائق عبر الإنترنت. إليك بعض أهمية آداب السلوك الرقمي: الاحترام وحقوق الآخرين: تشجع آداب السلوك الرقمي على احترام خصوصية الأفراد وحقوقهم عبر الإنترنت. يتضمن ذلك عدم نشر معلومات خاصة بالآخرين دون إذنهم وتجنب التحرش الرقمي. التواصل اللائق: يشجع السلوك الرقمي على التواصل بطريقة لائقة ومحترمة عبر وسائل التواصل الاجتماعي والرسائل الإلكترونية، مع تجنب اللغة العدائية أو التجاوزية. الأمان الرقمي: تشمل آداب السلوك الرقمي الحرص على الأمان الشخصي والرقمي، مثل استخدام كلمات مرور قوية وتحديث البرامج والتطبيقات بانتظام. الوعي بالمعلومات: يجب على المستخدمين تطوير وعيهم بشكل دائم حيال تحقق الأخبار والمعلومات عبر الإنترنت، والتحقق من مصداقية المصادر قبل نشر المعلومات. التواصل الإيجابي: يشجع السلوك الرقمي على التفاعل الإيجابي والداعم عبر وسائل التواصل الاجتماعي، وتجنب الانجراف إلى التعليقات السلبية أو الهجومية.";

let txt3=" آداب السلوك في التواصل الرقمي تتطلب السلوكيات الجيدة في التواصل الرقمي احترامًا وتوجيهًا للتفاعلات الإلكترونية. إليك بعض آداب السلوك في التواصل الرقمي: احترام الآخرين: تجنب اللغة الجارحة أو التعليقات المسيئة. تجنب نشر محتوى مسيء أو مسيء للغير. استخدام لغة مهذبة:  اكتب بلغة محترمة وواضحة. تجنب استخدام الحروف الكبيرة بشكل مفرط لتجنب إظهار الغضب أو التهكم. حقوق الخصوصية: احترم خصوصية الآخرين وتجنب نشر معلومات شخصية دون إذن. التفاعل البناء: شجع على الحوار البناء وتبادل الأفكار بشكل محترم. تجنب النقد البناء واستخدم النصائح بشكل إيجابي. التحقق من الحقائق: تجنب نشر معلومات غير مؤكدة قد تؤدي إلى انتشار المعلومات الخاطئة. ";

let txt4=" التعاطف في العالم الرقمي يمكن أن يظهر بشكل مختلف عن التعاطف في الواقع الحقيقي، ولكنه لا يزال يلعب دورًا هامًا في تشكيل تفاعلات الأفراد عبر الإنترنت. إليك بعض النقاط التي تعكس كيفية تجسيد التعاطف في العالم الرقمي: التواصل الاجتماعي: الردود الإيجابية على منشورات الأفراد، وتقديم الدعم العاطفي عبر منصات التواصل الاجتماعي. مشاركة تجارب شخصية أو قصص حياة تهدف إلى إلهام الآخرين أو مشاركة المشاعر. التبرع عبر الإنترنت: المشاركة في حملات تبرع عبر الإنترنت للمساعدة في حالات الطوارئ أو دعم القضايا الاجتماعية. التفاعل مع المحتوى: إبداء التفاعل الإيجابي مع المحتوى الذي يعبر عن مشاعر إيجابية أو يروج للتفاهم والتسامح. التحدث عبر وسائل الاتصال عبر الإنترنت: مشاركة التجارب الشخصية وتقديم النصائح أو الدعم للأفراد الذين يمرون بصعوبات. المشاركة في المجتمعات عبر الإنترنت: الانخراط في منتديات أو مجتمعات عبر الإنترنت التي تركز على التبادل الإيجابي ودعم الأعضاء. إبراز التفاهم والاحترام: الامتناع عن التحدث بشكل سلبي أو إلحاق الضرر العاطفي بالآخرين عبر الإنترنت. التواصل عبر وسائل الاتصال المباشر: استخدام التطبيقات الرقمية للتحدث مباشرة مع الأصدقاء والعائلة لتقديم الدعم العاطفي.";

let txt5=" التواصل والعلاقات الرقمية يشيران إلى كيفية التفاعل والتواصل بين الأفراد والمجتمعات في العصر الرقمي الحديث، حيث تلعب التكنولوجيا ووسائل الإعلام الاجتماعية دورًا هامًا في تشكيل هذه العلاقات. إليك بعض الجوانب المهمة حول هذا الموضوع: وسائل التواصل الاجتماعي: تلعب الشبكات الاجتماعية مثل فيسبوك، تويتر، إنستجرام، ولينكدإن دوراً كبيراً في تيسير التواصل وبناء العلاقات الرقمية. يمكن للأفراد التواصل مع بعضهم البعض بسهولة ومشاركة تجاربهم وآرائهم. البريد الإلكتروني: يظل البريد الإلكتروني وسيلة فعّالة للتواصل الرقمي، سواء كان في العلاقات الشخصية أو العملية. يتيح البريد الإلكتروني التفاعل الفعّال والتبادل السريع للرسائل والملفات. التواصل عبر الفيديو: تقنيات الفيديو كالمكالمات الصوتية ومكالمات الفيديو تمكن الأفراد من رؤية بعضهم البعض عبر الإنترنت، مما يجعل التواصل أكثر واقعية وشخصية. التسويق الرقمي: في سياق الأعمال، يعتبر التسويق الرقمي وسيلة مهمة لبناء العلاقات مع العملاء وجذب انتباههم. من خلال وسائل مثل الإعلانات عبر الإنترنت، والتسويق عبر البريد الإلكتروني، يمكن للشركات التواصل مع جمهورها بشكل مستمر. الأمان الرقمي وحماية الخصوصية: يجب أن يكون التواصل الرقمي آمنًا ويحترم خصوصية المستخدمين. الحفاظ على معلومات الأفراد بشكل آمن يسهم في بناء الثقة وتعزيز العلاقات الرقمية.";

let txt6=" تشير قنوات التواصل والعلاقات الرقمية إلى وسائل التواصل الإلكتروني والمنصات الرقمية التي يمكن استخدامها للتفاعل والتواصل بين الأفراد والمؤسسات. تطورت هذه القنوات بسرعة مع التقدم التكنولوجي وانتشار الإنترنت.  إليك بعض القنوات الشائعة في هذا السياق: وسائل التواصل الاجتماعي -  البريد الإلكتروني - البريد الإلكتروني الشخصي - حملات البريد الإلكتروني التسويقي - الدردشة الفورية - المدونات والمنصات الرقمية - المنتديات ومجتمعات الإنترنت - التطبيقات الهاتفية";

let txt7="تحديد حدود التواصل في العلاقات الرقمية يعتمد على عدة عوامل، وهذه الحدود تختلف من شخص لآخر وتعتمد على التفاهم المشترك واحترام الخصوصية. فيما يلي بعض النصائح التي يمكن أن تساعد في تحديد حدود صحية للتواصل الرقمي: تحديد الأوقات المناسبة: حدد أوقات محددة للتواصل عبر وسائل الإعلام الاجتماعية أو البريد الإلكتروني. يمكن أن يساعد هذا في تقليل التشتت وتحسين التركيز على الأمور الأخرى في الحياة. احترام الخصوصية: تحدث مع الأشخاص الآخرين حول مدى رغبتك في مشاركة المعلومات الشخصية وضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي بطريقة تلبي توقعاتك. الحفاظ على التوازن: لا تدمر حياتك الشخصية أو المهنية بسبب الوقت الكبير الذي تقضيه على وسائل التواصل الاجتماعي أو البريد الإلكتروني. حافظ على توازن صحي بين الحياة الرقمية والحياة الواقعية. تحديد الأولويات: قد تكون هناك فعاليات رقمية هامة أكثر من غيرها. حدد الأولويات وقم بتخصيص الوقت والجهد بشكل مناسب.";

let txt8=" الحوار المتحضر في العالم الرقمي يعتمد على احترام الآراء والتعبير عنها بشكل مدروس ومحترم عبر وسائل الاتصال الرقمية، مثل الشبكات الاجتماعية والمنتديات الإلكترونية. فيما يلي بعض الخصائص التي تميز الحوار المتحضر في العالم الرقمي: احترام التنوع: يعتمد الحوار المتحضر على قبول واحترام التنوع في الآراء والثقافات. يجب على المشاركين في الحوار أن يكونوا مفتوحين لفهم وجهات نظر الآخرين والاستماع إليها بدون تحيز. التفاعل الإيجابي: يشمل الحوار المتحضر التعبير عن الرأي بطريقة إيجابية وبناءة. يجب تجنب اللغة الجارحة أو التعبيرات التي قد تؤدي إلى التوتر أو الانقسام. المصداقية والشفافية: يجب على المشاركين في الحوار توفير المعلومات بشكل دقيق وصادق، وتجنب نشر المعلومات المضللة أو الزائفة. الشفافية تسهم في بناء ثقة بين الأفراد المشاركين. استخدام اللغة بعناية: ينبغي على المشاركين في الحوار استخدام لغة محترمة ومتسامحة. تجنب اللغة العدائية أو الإساءة، والتركيز على التواصل بشكل فعال. التركيز على الحقائق والأدلة: يجب دعم الآراء بالحقائق والأدلة عند الإشارة إلى مواضيع محددة. ذلك يعزز المناقشات المستندة إلى الأساسيات الواقعية.";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}
}

function Script7()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" السلوك الرقمي يشير إلى السلوك الذي يتم عبر وسائل الاتصال الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي. وفيما يلي بعض آداب السلوك الرقمي التي يُفضل اتباعها: احترام الآخرين: تجنب نشر معلومات خاصة بالآخرين دون إذن. تجنب استخدام لغة جارحة أو مهينة في التعليقات والردود. النقاش البناء: المشاركة في المناقشات بطريقة بناءة ومحترمة. تجنب الخلافات الشخصية والتحاور بشكل مثقف. تحديد الهوية: تجنب استخدام الهويات المزيفة أو الانتحال للهويات الأخرى. كن صادقًا في التفاعلات الرقمية. الحفاظ على الخصوصية: تجنب مشاركة معلومات خاصة تتعلق بالحياة الشخصية دون تفكير جيد. ضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي والحفاظ على حقوقك. مراعاة حقوق الملكية: عدم استخدام محتوى آخرين دون إذن منهم. الاحترام الكامل لحقوق الملكية الفكرية. التحقق من صحة المعلومات: التحقق من صحة المعلومات قبل نشرها لتفادي نشر المعلومات الخاطئة ";

let txt2=" أهمية آداب السلوك الرقمي تشير إلى مجموعة من السلوكيات والقواعد التي يجب على الأفراد اتباعها أثناء استخدامهم للتكنولوجيا الرقمية ووسائل التواصل الاجتماعي. تتنوع هذه القواعد والآداب وتشمل الاحترام والأمان الرقمي والتواصل اللائق عبر الإنترنت. إليك بعض أهمية آداب السلوك الرقمي: الاحترام وحقوق الآخرين: تشجع آداب السلوك الرقمي على احترام خصوصية الأفراد وحقوقهم عبر الإنترنت. يتضمن ذلك عدم نشر معلومات خاصة بالآخرين دون إذنهم وتجنب التحرش الرقمي. التواصل اللائق: يشجع السلوك الرقمي على التواصل بطريقة لائقة ومحترمة عبر وسائل التواصل الاجتماعي والرسائل الإلكترونية، مع تجنب اللغة العدائية أو التجاوزية. الأمان الرقمي: تشمل آداب السلوك الرقمي الحرص على الأمان الشخصي والرقمي، مثل استخدام كلمات مرور قوية وتحديث البرامج والتطبيقات بانتظام. الوعي بالمعلومات: يجب على المستخدمين تطوير وعيهم بشكل دائم حيال تحقق الأخبار والمعلومات عبر الإنترنت، والتحقق من مصداقية المصادر قبل نشر المعلومات. التواصل الإيجابي: يشجع السلوك الرقمي على التفاعل الإيجابي والداعم عبر وسائل التواصل الاجتماعي، وتجنب الانجراف إلى التعليقات السلبية أو الهجومية.";

let txt3=" آداب السلوك في التواصل الرقمي تتطلب السلوكيات الجيدة في التواصل الرقمي احترامًا وتوجيهًا للتفاعلات الإلكترونية. إليك بعض آداب السلوك في التواصل الرقمي: احترام الآخرين: تجنب اللغة الجارحة أو التعليقات المسيئة. تجنب نشر محتوى مسيء أو مسيء للغير. استخدام لغة مهذبة:  اكتب بلغة محترمة وواضحة. تجنب استخدام الحروف الكبيرة بشكل مفرط لتجنب إظهار الغضب أو التهكم. حقوق الخصوصية: احترم خصوصية الآخرين وتجنب نشر معلومات شخصية دون إذن. التفاعل البناء: شجع على الحوار البناء وتبادل الأفكار بشكل محترم. تجنب النقد البناء واستخدم النصائح بشكل إيجابي. التحقق من الحقائق: تجنب نشر معلومات غير مؤكدة قد تؤدي إلى انتشار المعلومات الخاطئة. ";

let txt4=" التعاطف في العالم الرقمي يمكن أن يظهر بشكل مختلف عن التعاطف في الواقع الحقيقي، ولكنه لا يزال يلعب دورًا هامًا في تشكيل تفاعلات الأفراد عبر الإنترنت. إليك بعض النقاط التي تعكس كيفية تجسيد التعاطف في العالم الرقمي: التواصل الاجتماعي: الردود الإيجابية على منشورات الأفراد، وتقديم الدعم العاطفي عبر منصات التواصل الاجتماعي. مشاركة تجارب شخصية أو قصص حياة تهدف إلى إلهام الآخرين أو مشاركة المشاعر. التبرع عبر الإنترنت: المشاركة في حملات تبرع عبر الإنترنت للمساعدة في حالات الطوارئ أو دعم القضايا الاجتماعية. التفاعل مع المحتوى: إبداء التفاعل الإيجابي مع المحتوى الذي يعبر عن مشاعر إيجابية أو يروج للتفاهم والتسامح. التحدث عبر وسائل الاتصال عبر الإنترنت: مشاركة التجارب الشخصية وتقديم النصائح أو الدعم للأفراد الذين يمرون بصعوبات. المشاركة في المجتمعات عبر الإنترنت: الانخراط في منتديات أو مجتمعات عبر الإنترنت التي تركز على التبادل الإيجابي ودعم الأعضاء. إبراز التفاهم والاحترام: الامتناع عن التحدث بشكل سلبي أو إلحاق الضرر العاطفي بالآخرين عبر الإنترنت. التواصل عبر وسائل الاتصال المباشر: استخدام التطبيقات الرقمية للتحدث مباشرة مع الأصدقاء والعائلة لتقديم الدعم العاطفي.";

let txt5=" التواصل والعلاقات الرقمية يشيران إلى كيفية التفاعل والتواصل بين الأفراد والمجتمعات في العصر الرقمي الحديث، حيث تلعب التكنولوجيا ووسائل الإعلام الاجتماعية دورًا هامًا في تشكيل هذه العلاقات. إليك بعض الجوانب المهمة حول هذا الموضوع: وسائل التواصل الاجتماعي: تلعب الشبكات الاجتماعية مثل فيسبوك، تويتر، إنستجرام، ولينكدإن دوراً كبيراً في تيسير التواصل وبناء العلاقات الرقمية. يمكن للأفراد التواصل مع بعضهم البعض بسهولة ومشاركة تجاربهم وآرائهم. البريد الإلكتروني: يظل البريد الإلكتروني وسيلة فعّالة للتواصل الرقمي، سواء كان في العلاقات الشخصية أو العملية. يتيح البريد الإلكتروني التفاعل الفعّال والتبادل السريع للرسائل والملفات. التواصل عبر الفيديو: تقنيات الفيديو كالمكالمات الصوتية ومكالمات الفيديو تمكن الأفراد من رؤية بعضهم البعض عبر الإنترنت، مما يجعل التواصل أكثر واقعية وشخصية. التسويق الرقمي: في سياق الأعمال، يعتبر التسويق الرقمي وسيلة مهمة لبناء العلاقات مع العملاء وجذب انتباههم. من خلال وسائل مثل الإعلانات عبر الإنترنت، والتسويق عبر البريد الإلكتروني، يمكن للشركات التواصل مع جمهورها بشكل مستمر. الأمان الرقمي وحماية الخصوصية: يجب أن يكون التواصل الرقمي آمنًا ويحترم خصوصية المستخدمين. الحفاظ على معلومات الأفراد بشكل آمن يسهم في بناء الثقة وتعزيز العلاقات الرقمية.";

let txt6=" تشير قنوات التواصل والعلاقات الرقمية إلى وسائل التواصل الإلكتروني والمنصات الرقمية التي يمكن استخدامها للتفاعل والتواصل بين الأفراد والمؤسسات. تطورت هذه القنوات بسرعة مع التقدم التكنولوجي وانتشار الإنترنت.  إليك بعض القنوات الشائعة في هذا السياق: وسائل التواصل الاجتماعي -  البريد الإلكتروني - البريد الإلكتروني الشخصي - حملات البريد الإلكتروني التسويقي - الدردشة الفورية - المدونات والمنصات الرقمية - المنتديات ومجتمعات الإنترنت - التطبيقات الهاتفية";

let txt7="تحديد حدود التواصل في العلاقات الرقمية يعتمد على عدة عوامل، وهذه الحدود تختلف من شخص لآخر وتعتمد على التفاهم المشترك واحترام الخصوصية. فيما يلي بعض النصائح التي يمكن أن تساعد في تحديد حدود صحية للتواصل الرقمي: تحديد الأوقات المناسبة: حدد أوقات محددة للتواصل عبر وسائل الإعلام الاجتماعية أو البريد الإلكتروني. يمكن أن يساعد هذا في تقليل التشتت وتحسين التركيز على الأمور الأخرى في الحياة. احترام الخصوصية: تحدث مع الأشخاص الآخرين حول مدى رغبتك في مشاركة المعلومات الشخصية وضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي بطريقة تلبي توقعاتك. الحفاظ على التوازن: لا تدمر حياتك الشخصية أو المهنية بسبب الوقت الكبير الذي تقضيه على وسائل التواصل الاجتماعي أو البريد الإلكتروني. حافظ على توازن صحي بين الحياة الرقمية والحياة الواقعية. تحديد الأولويات: قد تكون هناك فعاليات رقمية هامة أكثر من غيرها. حدد الأولويات وقم بتخصيص الوقت والجهد بشكل مناسب.";

let txt8=" الحوار المتحضر في العالم الرقمي يعتمد على احترام الآراء والتعبير عنها بشكل مدروس ومحترم عبر وسائل الاتصال الرقمية، مثل الشبكات الاجتماعية والمنتديات الإلكترونية. فيما يلي بعض الخصائص التي تميز الحوار المتحضر في العالم الرقمي: احترام التنوع: يعتمد الحوار المتحضر على قبول واحترام التنوع في الآراء والثقافات. يجب على المشاركين في الحوار أن يكونوا مفتوحين لفهم وجهات نظر الآخرين والاستماع إليها بدون تحيز. التفاعل الإيجابي: يشمل الحوار المتحضر التعبير عن الرأي بطريقة إيجابية وبناءة. يجب تجنب اللغة الجارحة أو التعبيرات التي قد تؤدي إلى التوتر أو الانقسام. المصداقية والشفافية: يجب على المشاركين في الحوار توفير المعلومات بشكل دقيق وصادق، وتجنب نشر المعلومات المضللة أو الزائفة. الشفافية تسهم في بناء ثقة بين الأفراد المشاركين. استخدام اللغة بعناية: ينبغي على المشاركين في الحوار استخدام لغة محترمة ومتسامحة. تجنب اللغة العدائية أو الإساءة، والتركيز على التواصل بشكل فعال. التركيز على الحقائق والأدلة: يجب دعم الآراء بالحقائق والأدلة عند الإشارة إلى مواضيع محددة. ذلك يعزز المناقشات المستندة إلى الأساسيات الواقعية.";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}
}

function Script8()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" السلوك الرقمي يشير إلى السلوك الذي يتم عبر وسائل الاتصال الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي. وفيما يلي بعض آداب السلوك الرقمي التي يُفضل اتباعها: احترام الآخرين: تجنب نشر معلومات خاصة بالآخرين دون إذن. تجنب استخدام لغة جارحة أو مهينة في التعليقات والردود. النقاش البناء: المشاركة في المناقشات بطريقة بناءة ومحترمة. تجنب الخلافات الشخصية والتحاور بشكل مثقف. تحديد الهوية: تجنب استخدام الهويات المزيفة أو الانتحال للهويات الأخرى. كن صادقًا في التفاعلات الرقمية. الحفاظ على الخصوصية: تجنب مشاركة معلومات خاصة تتعلق بالحياة الشخصية دون تفكير جيد. ضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي والحفاظ على حقوقك. مراعاة حقوق الملكية: عدم استخدام محتوى آخرين دون إذن منهم. الاحترام الكامل لحقوق الملكية الفكرية. التحقق من صحة المعلومات: التحقق من صحة المعلومات قبل نشرها لتفادي نشر المعلومات الخاطئة ";

let txt2=" أهمية آداب السلوك الرقمي تشير إلى مجموعة من السلوكيات والقواعد التي يجب على الأفراد اتباعها أثناء استخدامهم للتكنولوجيا الرقمية ووسائل التواصل الاجتماعي. تتنوع هذه القواعد والآداب وتشمل الاحترام والأمان الرقمي والتواصل اللائق عبر الإنترنت. إليك بعض أهمية آداب السلوك الرقمي: الاحترام وحقوق الآخرين: تشجع آداب السلوك الرقمي على احترام خصوصية الأفراد وحقوقهم عبر الإنترنت. يتضمن ذلك عدم نشر معلومات خاصة بالآخرين دون إذنهم وتجنب التحرش الرقمي. التواصل اللائق: يشجع السلوك الرقمي على التواصل بطريقة لائقة ومحترمة عبر وسائل التواصل الاجتماعي والرسائل الإلكترونية، مع تجنب اللغة العدائية أو التجاوزية. الأمان الرقمي: تشمل آداب السلوك الرقمي الحرص على الأمان الشخصي والرقمي، مثل استخدام كلمات مرور قوية وتحديث البرامج والتطبيقات بانتظام. الوعي بالمعلومات: يجب على المستخدمين تطوير وعيهم بشكل دائم حيال تحقق الأخبار والمعلومات عبر الإنترنت، والتحقق من مصداقية المصادر قبل نشر المعلومات. التواصل الإيجابي: يشجع السلوك الرقمي على التفاعل الإيجابي والداعم عبر وسائل التواصل الاجتماعي، وتجنب الانجراف إلى التعليقات السلبية أو الهجومية.";

let txt3=" آداب السلوك في التواصل الرقمي تتطلب السلوكيات الجيدة في التواصل الرقمي احترامًا وتوجيهًا للتفاعلات الإلكترونية. إليك بعض آداب السلوك في التواصل الرقمي: احترام الآخرين: تجنب اللغة الجارحة أو التعليقات المسيئة. تجنب نشر محتوى مسيء أو مسيء للغير. استخدام لغة مهذبة:  اكتب بلغة محترمة وواضحة. تجنب استخدام الحروف الكبيرة بشكل مفرط لتجنب إظهار الغضب أو التهكم. حقوق الخصوصية: احترم خصوصية الآخرين وتجنب نشر معلومات شخصية دون إذن. التفاعل البناء: شجع على الحوار البناء وتبادل الأفكار بشكل محترم. تجنب النقد البناء واستخدم النصائح بشكل إيجابي. التحقق من الحقائق: تجنب نشر معلومات غير مؤكدة قد تؤدي إلى انتشار المعلومات الخاطئة. ";

let txt4=" التعاطف في العالم الرقمي يمكن أن يظهر بشكل مختلف عن التعاطف في الواقع الحقيقي، ولكنه لا يزال يلعب دورًا هامًا في تشكيل تفاعلات الأفراد عبر الإنترنت. إليك بعض النقاط التي تعكس كيفية تجسيد التعاطف في العالم الرقمي: التواصل الاجتماعي: الردود الإيجابية على منشورات الأفراد، وتقديم الدعم العاطفي عبر منصات التواصل الاجتماعي. مشاركة تجارب شخصية أو قصص حياة تهدف إلى إلهام الآخرين أو مشاركة المشاعر. التبرع عبر الإنترنت: المشاركة في حملات تبرع عبر الإنترنت للمساعدة في حالات الطوارئ أو دعم القضايا الاجتماعية. التفاعل مع المحتوى: إبداء التفاعل الإيجابي مع المحتوى الذي يعبر عن مشاعر إيجابية أو يروج للتفاهم والتسامح. التحدث عبر وسائل الاتصال عبر الإنترنت: مشاركة التجارب الشخصية وتقديم النصائح أو الدعم للأفراد الذين يمرون بصعوبات. المشاركة في المجتمعات عبر الإنترنت: الانخراط في منتديات أو مجتمعات عبر الإنترنت التي تركز على التبادل الإيجابي ودعم الأعضاء. إبراز التفاهم والاحترام: الامتناع عن التحدث بشكل سلبي أو إلحاق الضرر العاطفي بالآخرين عبر الإنترنت. التواصل عبر وسائل الاتصال المباشر: استخدام التطبيقات الرقمية للتحدث مباشرة مع الأصدقاء والعائلة لتقديم الدعم العاطفي.";

let txt5=" التواصل والعلاقات الرقمية يشيران إلى كيفية التفاعل والتواصل بين الأفراد والمجتمعات في العصر الرقمي الحديث، حيث تلعب التكنولوجيا ووسائل الإعلام الاجتماعية دورًا هامًا في تشكيل هذه العلاقات. إليك بعض الجوانب المهمة حول هذا الموضوع: وسائل التواصل الاجتماعي: تلعب الشبكات الاجتماعية مثل فيسبوك، تويتر، إنستجرام، ولينكدإن دوراً كبيراً في تيسير التواصل وبناء العلاقات الرقمية. يمكن للأفراد التواصل مع بعضهم البعض بسهولة ومشاركة تجاربهم وآرائهم. البريد الإلكتروني: يظل البريد الإلكتروني وسيلة فعّالة للتواصل الرقمي، سواء كان في العلاقات الشخصية أو العملية. يتيح البريد الإلكتروني التفاعل الفعّال والتبادل السريع للرسائل والملفات. التواصل عبر الفيديو: تقنيات الفيديو كالمكالمات الصوتية ومكالمات الفيديو تمكن الأفراد من رؤية بعضهم البعض عبر الإنترنت، مما يجعل التواصل أكثر واقعية وشخصية. التسويق الرقمي: في سياق الأعمال، يعتبر التسويق الرقمي وسيلة مهمة لبناء العلاقات مع العملاء وجذب انتباههم. من خلال وسائل مثل الإعلانات عبر الإنترنت، والتسويق عبر البريد الإلكتروني، يمكن للشركات التواصل مع جمهورها بشكل مستمر. الأمان الرقمي وحماية الخصوصية: يجب أن يكون التواصل الرقمي آمنًا ويحترم خصوصية المستخدمين. الحفاظ على معلومات الأفراد بشكل آمن يسهم في بناء الثقة وتعزيز العلاقات الرقمية.";

let txt6=" تشير قنوات التواصل والعلاقات الرقمية إلى وسائل التواصل الإلكتروني والمنصات الرقمية التي يمكن استخدامها للتفاعل والتواصل بين الأفراد والمؤسسات. تطورت هذه القنوات بسرعة مع التقدم التكنولوجي وانتشار الإنترنت.  إليك بعض القنوات الشائعة في هذا السياق: وسائل التواصل الاجتماعي -  البريد الإلكتروني - البريد الإلكتروني الشخصي - حملات البريد الإلكتروني التسويقي - الدردشة الفورية - المدونات والمنصات الرقمية - المنتديات ومجتمعات الإنترنت - التطبيقات الهاتفية";

let txt7="تحديد حدود التواصل في العلاقات الرقمية يعتمد على عدة عوامل، وهذه الحدود تختلف من شخص لآخر وتعتمد على التفاهم المشترك واحترام الخصوصية. فيما يلي بعض النصائح التي يمكن أن تساعد في تحديد حدود صحية للتواصل الرقمي: تحديد الأوقات المناسبة: حدد أوقات محددة للتواصل عبر وسائل الإعلام الاجتماعية أو البريد الإلكتروني. يمكن أن يساعد هذا في تقليل التشتت وتحسين التركيز على الأمور الأخرى في الحياة. احترام الخصوصية: تحدث مع الأشخاص الآخرين حول مدى رغبتك في مشاركة المعلومات الشخصية وضبط إعدادات الخصوصية على وسائل التواصل الاجتماعي بطريقة تلبي توقعاتك. الحفاظ على التوازن: لا تدمر حياتك الشخصية أو المهنية بسبب الوقت الكبير الذي تقضيه على وسائل التواصل الاجتماعي أو البريد الإلكتروني. حافظ على توازن صحي بين الحياة الرقمية والحياة الواقعية. تحديد الأولويات: قد تكون هناك فعاليات رقمية هامة أكثر من غيرها. حدد الأولويات وقم بتخصيص الوقت والجهد بشكل مناسب.";

let txt8=" الحوار المتحضر في العالم الرقمي يعتمد على احترام الآراء والتعبير عنها بشكل مدروس ومحترم عبر وسائل الاتصال الرقمية، مثل الشبكات الاجتماعية والمنتديات الإلكترونية. فيما يلي بعض الخصائص التي تميز الحوار المتحضر في العالم الرقمي: احترام التنوع: يعتمد الحوار المتحضر على قبول واحترام التنوع في الآراء والثقافات. يجب على المشاركين في الحوار أن يكونوا مفتوحين لفهم وجهات نظر الآخرين والاستماع إليها بدون تحيز. التفاعل الإيجابي: يشمل الحوار المتحضر التعبير عن الرأي بطريقة إيجابية وبناءة. يجب تجنب اللغة الجارحة أو التعبيرات التي قد تؤدي إلى التوتر أو الانقسام. المصداقية والشفافية: يجب على المشاركين في الحوار توفير المعلومات بشكل دقيق وصادق، وتجنب نشر المعلومات المضللة أو الزائفة. الشفافية تسهم في بناء ثقة بين الأفراد المشاركين. استخدام اللغة بعناية: ينبغي على المشاركين في الحوار استخدام لغة محترمة ومتسامحة. تجنب اللغة العدائية أو الإساءة، والتركيز على التواصل بشكل فعال. التركيز على الحقائق والأدلة: يجب دعم الآراء بالحقائق والأدلة عند الإشارة إلى مواضيع محددة. ذلك يعزز المناقشات المستندة إلى الأساسيات الواقعية.";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}
}

