function ExecuteScript(strId)
{
  switch (strId)
  {
      case "5WanG4uFGI6":
        Script1();
        break;
      case "63pfd5NDcGJ":
        Script2();
        break;
      case "6mVHGDY4Ryr":
        Script3();
        break;
      case "5hQRTdFF2mj":
        Script4();
        break;
      case "5Vn4v6OQbbG":
        Script5();
        break;
      case "6G2c6iK2pye":
        Script6();
        break;
      case "6RvwjiT0WVM":
        Script7();
        break;
      case "6IaygfhiAC7":
        Script8();
        break;
  }
}

function Script1()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" أشكال العنف الإلكتروني تعتبر أشكال العنف الإلكتروني متنوعة وتشمل العديد من الأشكال المختلفة. إليك بعض أشكال العنف الإلكتروني الشائعة: التنميط: التنميط الكلامي : إرسال رسائل عنيفة أو تحقيرية عبر وسائل التواصل الاجتماعي أو المنتديات. التنميط العنصري : استخدام لغة عنصرية أو ترويج للكراهية بناءً على العرق. التحرش الإلكتروني: التحرش الجنسي عبر الإنترنت : متابعة الأفراد عبر الإنترنت بطرق مزعجة أو مخيفة. التحرش الإلكتروني الشخصي: إرسال رسائل تهديد أو مضايقة لشخص معين. الاحتيال والاحتيال الإلكتروني: التصيد الاحتيالي : إرسال رسائل زائفة تدعو الأفراد إلى كشف معلوماتهم الشخصية. التزوير الإلكتروني : تزوير المعلومات لتبدو كأنها من مصدر موثوق به. التشهير والابتزاز: نشر المعلومات الكاذبة: نشر معلومات كاذبة لتشويه سمعة الفرد. الابتزاز الرقمي: محاولة الحصول على مال أو خدمات بوساطة تهديدات إلكترونية. الهجمات السيبرانية: الهجمات الضخمة: توجيه حركة مرور إلكترونية كبيرة إلى خوادم معينة لتعطيلها. الاختراق : اختراق الأنظمة الإلكترونية للوصول إلى المعلومات أو التلاعب بها. التجسس الإلكتروني: اختراق الخصوصية: التجسس على الأفراد أو اختراق خصوصيتهم. التهديد بالعنف الجسدي: التهديد بالعنف عبر الإنترنت: تهديد الأفراد بالعنف عبر وسائل الإنترنت. ";

let txt2=" التعامل مع الدراما الرقمية يمكن أن يشير مصطلح الدراما الرقمية إلى محتوى ترفيهي يتم توفيره عبر الإنترنت، مثل المسلسلات والبرامج التلفزيونية التي يمكن مشاهدتها عبر منصات البث الرقمي. فيما يلي بعض النصائح للتعامل مع الدراما الرقمية: اختيار المنصة: قم باختيار منصة توفر محتوى الدراما الرقمية الذي يهمك.  التخطيط الزمني: قم بتحديد وقت محدد لمشاهدة الدراما الرقمية حتى لا تؤثر على وقتك الحياتي اليومي. مراعاة الحقوق التأليفية: تأكد من أنك تستخدم منصات قانونية لتجنب انتهاك حقوق الملكية الفكرية وتدعيم الصناعة الإبداعية. ";

let txt3=" التنمر الإلكتروني أو الإي-بلاغ هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتنمر على الأفراد أو المجموعات. يمكن أن يظهر التنمر الإلكتروني بأشكال مختلفة، منها: التنمر اللفظي: استخدام اللغة البذيئة أو العدائية عبر الإنترنت لإلحاق الأذى بالأشخاص. التنمر الاجتماعي: تشكيل مجموعات على وسائل التواصل الاجتماعي لاستهداف شخص معين والتنمر عليه. التنمر الإلكتروني الجنسي: إرسال رسائل جنسية غير مرغوب فيها أو مشاركة محتوى جنسي دون إذن. التنمر السيبراني: استخدام التكنولوجيا للتلاعب بالمعلومات أو الاختراق للحاق الضرر. التنمر الاقتصادي: استخدام الوسائل الرقمية للتأثير على الأوضاع الاقتصادية للأفراد أو المؤسسات.  ";

let txt4="آثار التنمر الإلكتروني التنمر الإلكتروني هو نوع من أنواع التنمر يتم عبر وسائل الاتصال الإلكترونية، مثل الإنترنت ووسائل التواصل الاجتماعي. يمكن أن يكون للتنمر الإلكتروني آثار سلبية جسيمة على الأفراد والمجتمعات. إليك بعض الآثار الشائعة للتنمر الإلكتروني: تأثير نفسي: يمكن أن يؤدي التنمر الإلكتروني إلى آثار نفسية خطيرة على الأفراد المتعرضين له. قد يعاني الضحايا من القلق، والاكتئاب، وانخراط في سلوكيات غير صحية نتيجة للتنمر الإلكتروني. تأثير اجتماعي: يمكن أن يؤدي التنمر الإلكتروني إلى الانعزال الاجتماعي وفقدان الثقة بالنفس، حيث يشعر الأفراد بأنهم غير محميين ومعرضين للخطر في بيئة الإنترنت. تأثير التعليم والعمل: يمكن أن يؤثر التنمر الإلكتروني على الأداء الأكاديمي للطلاب والموظفين، حيث يشعرون بصعوبة في التركيز والمشاركة في الأنشطة التعليمية أو العملية. تأثير صحي: يمكن أن يؤدي التنمر الإلكتروني إلى مشاكل صحية في بعض الحالات، مثل الأرق والصداع والتوتر العصبي. تأثير قانوني: في بعض الحالات، يمكن أن يكون للتنمر الإلكتروني عواقب قانونية. يمكن محاسبة المتنمرين الإلكترونيين قانونيًا في بعض الدول على أفعالهم الضارة.";

let txt5=" دوافع التنمر الإلكتروني التنمر الإلكتروني هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتحرش أو التنمر على الأفراد. يمكن أن تكون هناك عدة دوافع للتنمر الإلكتروني، ومن بين هذه الدوافع: التسلية أو التسلية السلبية: قد يقوم بعض الأشخاص بمضايقة الآخرين عبر الإنترنت بسبب فراغهم الوقت أو للمتعة الشخصية، ويرىون أنها طريقة للتسلية على حساب الآخرين. الغضب والانتقام: يمكن أن يكون التنمر الإلكتروني رد فعل على إحساس بالغضب أو الانتقام. يمكن أن يكون هذا ناتجًا عن خلافات شخصية أو تصادم في العلاقات الاجتماعية. الغيرة والتحقير: قد يتم توجيه التنمر الإلكتروني نحو أفراد ذوي شهرة أو نجاح، حيث يمكن أن يكون الغيرة أو الرغبة في التحقير دافعًا للتصرف بشكل سلبي. عدم فهم للآخرين: قد يقوم بعض الأفراد بالتنمر الإلكتروني بسبب عدم فهمهم للتأثير السلبي لأفعالهم على الضحايا، حيث يمكن أن يكونوا غير حساسين لمشاعر الآخرين. التفرغ للإنترنت: بعض الأشخاص الذين يقضون وقتًا طويلاً على الإنترنت قد يلجأون إلى التنمر الإلكتروني كوسيلة لتملأة وقتهم أو لتحقيق الشهرة السريعة دون التفكير في تداولهم للمعلومات السلبية. المشاكل النفسية: قد يكون للمشاكل النفسية لدى الفرد دور في قيامه بأفعال تنمر إلكتروني، حيث يستخدم هذا الفعل كسيل لتفريغ مشاعره السلبية أو الضغط النفسي الذي يواجهه.";

let txt6=" التعامل مع التنمر الإلكتروني  التنمر الإلكتروني هو استخدام التكنولوجيا للتحرش أو التضييق الإلكتروني للأفراد أو المجموعات. يمكن أن يكون التنمر الإلكتروني عبر وسائل التواصل الاجتماعي، البريد الإلكتروني، الرسائل النصية، أو أي وسائل أخرى عبر الإنترنت. إذا كنت تواجه التنمر الإلكتروني، فإليك بعض الخطوات التي يمكنك اتخاذها للتعامل مع هذا الوضع: الابتعاد وعدم الاستجابة: قد يكون الرد على التنمر إشارة للمتنمرين بأنك تستجيب وتعتبر ذلك مهمًا. حاول تجاهل التنمر وعدم الاستجابة لتقليل فعالية المتنمرين. الإبلاغ: في حالة التنمر عبر منصات معينة، يفضل الإبلاغ عن المشكلة إلى الجهة المسؤولة. معظم المنصات لديها آليات للإبلاغ عن المضايقات والتنمر. حظر المتنمرين: قم بحظر الأشخاص الذين يقومون بالتنمر عليك عبر وسائل التواصل الاجتماعي أو أي وسائل أخرى. هذا يقلل من فرصهم للوصول إليك. الحفاظ على الأدلة: احتفظ بنسخ من جميع الرسائل أو المحتوى المسيء كدليل، حيث قد تكون هذه الأدلة مفيدة في حالة اللجوء إلى القانون. التحدث مع الأشخاص المختصين: إذا كنت تعتقد أن الموضوع قد تجاوز حدود التنمر الإلكتروني البسيط، فقد يكون من المفيد التحدث مع أصدقائك أو أفراد العائلة أو المعلمين أو المسؤولين في مؤسستك للحصول على الدعم والمساعدة. التوجه للسلطات: في حال استمرار التنمر وتدهور الوضع، قد تحتاج إلى اللجوء للسلطات المختصة. يجب عليك التوجه للشرطة أو الجهات القانونية للحصول على المساعدة. العناية بالصحة النفسية: قد يكون التنمر الإلكتروني مؤثرًا على الصحة النفسية. لا تتردد في البحث عن الدعم النفسي إذا كنت بحاجة إليه. ";

let txt7=" خطاب الكراهية عبر الإنترنت  يشكل تهديدًا خطيرًا للمجتمع والتواصل السلمي عبر العالم الرقمي. الخطاب الكراهية يمكن أن يكون أي نوع من التعبيرات التي تشجع على التمييز أو العنف ضد فئة معينة من الناس بناءً على عوامل مثل العرق، الدين، الجنس، الجنسية، الهوية الجندرية، أو أي سمة أخرى. تؤثر الكلمات بشكل كبير على آراء الأفراد وسلوكهم، وعندما يتم نشر خطاب الكراهية عبر الإنترنت، يمكن أن يؤدي ذلك إلى زيادة التوتر والتصاعد في المجتمع. إن استخدام اللغة لتحريض الكراهية يعرض الأفراد والمجتمعات للخطر، ويمكن أن يؤدي إلى أعمال عنف وتمييز. تحمي العديد من الدول حرية التعبير، ولكن يجب أن يكون هذا الحق مصحوبًا بالمسؤولية. يجب على مستخدمي الإنترنت أن يكونوا حذرين ويتجنبوا نشر أو ترويج للخطاب الكراهية. يعتبر التفاعل بشكل إيجابي واحترام الآراء المختلفة أمورًا أساسية في بناء مجتمع رقمي صحي ومتنوع.";

let txt8=" التعامل مع الخطاب الكراهية التعامل مع الخطاب الكراهية يمكن أن يكون تحديًا، ولكن هناك بعض الطرق التي يمكنك اتباعها للتعامل معه بشكل فعال: البقاء هادئًا: حاول أن تظل هادئًا ولا تستجيب بعنف. الرد بعنف قد يؤدي إلى تصاعد الموقف وزيادة التوتر. تجنب التجاوب المباشر: قد يكون من الأفضل تجاهل الخطاب الكراهية أو عدم الرد عليه مباشرة، خاصة إذا كان المرسل يبحث عن رد فعل سلبي. تحديد حدود: إذا كان بالإمكان، قد تحتاج إلى تحديد حدود واضحة مع الأشخاص الذين يروجون للخطاب الكراهي. اترك الشخص يعلم أن هناك خطوطًا لا يجب تجاوزها. البحث عن الدعم: لا تتردد في البحث عن دعم من الأصدقاء والعائلة أو المجتمع الذي تنتمي إليه. قد يكون لديهم نصائح قيمة أو دعم عاطفي يمكن أن يكون مفيدًا. الإبلاغ عن المضايقات: إذا كنت تشعر بأنك تتعرض لمضايقات على وسائل التواصل الاجتماعي أو في أي مكان آخر على الإنترنت، قد تكون هناك خيارات للإبلاغ عن هذا السلوك وطلب المساعدة. ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}

}

function Script2()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" أشكال العنف الإلكتروني تعتبر أشكال العنف الإلكتروني متنوعة وتشمل العديد من الأشكال المختلفة. إليك بعض أشكال العنف الإلكتروني الشائعة: التنميط: التنميط الكلامي : إرسال رسائل عنيفة أو تحقيرية عبر وسائل التواصل الاجتماعي أو المنتديات. التنميط العنصري : استخدام لغة عنصرية أو ترويج للكراهية بناءً على العرق. التحرش الإلكتروني: التحرش الجنسي عبر الإنترنت : متابعة الأفراد عبر الإنترنت بطرق مزعجة أو مخيفة. التحرش الإلكتروني الشخصي: إرسال رسائل تهديد أو مضايقة لشخص معين. الاحتيال والاحتيال الإلكتروني: التصيد الاحتيالي : إرسال رسائل زائفة تدعو الأفراد إلى كشف معلوماتهم الشخصية. التزوير الإلكتروني : تزوير المعلومات لتبدو كأنها من مصدر موثوق به. التشهير والابتزاز: نشر المعلومات الكاذبة: نشر معلومات كاذبة لتشويه سمعة الفرد. الابتزاز الرقمي: محاولة الحصول على مال أو خدمات بوساطة تهديدات إلكترونية. الهجمات السيبرانية: الهجمات الضخمة: توجيه حركة مرور إلكترونية كبيرة إلى خوادم معينة لتعطيلها. الاختراق : اختراق الأنظمة الإلكترونية للوصول إلى المعلومات أو التلاعب بها. التجسس الإلكتروني: اختراق الخصوصية: التجسس على الأفراد أو اختراق خصوصيتهم. التهديد بالعنف الجسدي: التهديد بالعنف عبر الإنترنت: تهديد الأفراد بالعنف عبر وسائل الإنترنت. ";

let txt2=" التعامل مع الدراما الرقمية يمكن أن يشير مصطلح الدراما الرقمية إلى محتوى ترفيهي يتم توفيره عبر الإنترنت، مثل المسلسلات والبرامج التلفزيونية التي يمكن مشاهدتها عبر منصات البث الرقمي. فيما يلي بعض النصائح للتعامل مع الدراما الرقمية: اختيار المنصة: قم باختيار منصة توفر محتوى الدراما الرقمية الذي يهمك.  التخطيط الزمني: قم بتحديد وقت محدد لمشاهدة الدراما الرقمية حتى لا تؤثر على وقتك الحياتي اليومي. مراعاة الحقوق التأليفية: تأكد من أنك تستخدم منصات قانونية لتجنب انتهاك حقوق الملكية الفكرية وتدعيم الصناعة الإبداعية. ";

let txt3=" التنمر الإلكتروني أو الإي-بلاغ هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتنمر على الأفراد أو المجموعات. يمكن أن يظهر التنمر الإلكتروني بأشكال مختلفة، منها: التنمر اللفظي: استخدام اللغة البذيئة أو العدائية عبر الإنترنت لإلحاق الأذى بالأشخاص. التنمر الاجتماعي: تشكيل مجموعات على وسائل التواصل الاجتماعي لاستهداف شخص معين والتنمر عليه. التنمر الإلكتروني الجنسي: إرسال رسائل جنسية غير مرغوب فيها أو مشاركة محتوى جنسي دون إذن. التنمر السيبراني: استخدام التكنولوجيا للتلاعب بالمعلومات أو الاختراق للحاق الضرر. التنمر الاقتصادي: استخدام الوسائل الرقمية للتأثير على الأوضاع الاقتصادية للأفراد أو المؤسسات.  ";

let txt4="آثار التنمر الإلكتروني التنمر الإلكتروني هو نوع من أنواع التنمر يتم عبر وسائل الاتصال الإلكترونية، مثل الإنترنت ووسائل التواصل الاجتماعي. يمكن أن يكون للتنمر الإلكتروني آثار سلبية جسيمة على الأفراد والمجتمعات. إليك بعض الآثار الشائعة للتنمر الإلكتروني: تأثير نفسي: يمكن أن يؤدي التنمر الإلكتروني إلى آثار نفسية خطيرة على الأفراد المتعرضين له. قد يعاني الضحايا من القلق، والاكتئاب، وانخراط في سلوكيات غير صحية نتيجة للتنمر الإلكتروني. تأثير اجتماعي: يمكن أن يؤدي التنمر الإلكتروني إلى الانعزال الاجتماعي وفقدان الثقة بالنفس، حيث يشعر الأفراد بأنهم غير محميين ومعرضين للخطر في بيئة الإنترنت. تأثير التعليم والعمل: يمكن أن يؤثر التنمر الإلكتروني على الأداء الأكاديمي للطلاب والموظفين، حيث يشعرون بصعوبة في التركيز والمشاركة في الأنشطة التعليمية أو العملية. تأثير صحي: يمكن أن يؤدي التنمر الإلكتروني إلى مشاكل صحية في بعض الحالات، مثل الأرق والصداع والتوتر العصبي. تأثير قانوني: في بعض الحالات، يمكن أن يكون للتنمر الإلكتروني عواقب قانونية. يمكن محاسبة المتنمرين الإلكترونيين قانونيًا في بعض الدول على أفعالهم الضارة.";

let txt5=" دوافع التنمر الإلكتروني التنمر الإلكتروني هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتحرش أو التنمر على الأفراد. يمكن أن تكون هناك عدة دوافع للتنمر الإلكتروني، ومن بين هذه الدوافع: التسلية أو التسلية السلبية: قد يقوم بعض الأشخاص بمضايقة الآخرين عبر الإنترنت بسبب فراغهم الوقت أو للمتعة الشخصية، ويرىون أنها طريقة للتسلية على حساب الآخرين. الغضب والانتقام: يمكن أن يكون التنمر الإلكتروني رد فعل على إحساس بالغضب أو الانتقام. يمكن أن يكون هذا ناتجًا عن خلافات شخصية أو تصادم في العلاقات الاجتماعية. الغيرة والتحقير: قد يتم توجيه التنمر الإلكتروني نحو أفراد ذوي شهرة أو نجاح، حيث يمكن أن يكون الغيرة أو الرغبة في التحقير دافعًا للتصرف بشكل سلبي. عدم فهم للآخرين: قد يقوم بعض الأفراد بالتنمر الإلكتروني بسبب عدم فهمهم للتأثير السلبي لأفعالهم على الضحايا، حيث يمكن أن يكونوا غير حساسين لمشاعر الآخرين. التفرغ للإنترنت: بعض الأشخاص الذين يقضون وقتًا طويلاً على الإنترنت قد يلجأون إلى التنمر الإلكتروني كوسيلة لتملأة وقتهم أو لتحقيق الشهرة السريعة دون التفكير في تداولهم للمعلومات السلبية. المشاكل النفسية: قد يكون للمشاكل النفسية لدى الفرد دور في قيامه بأفعال تنمر إلكتروني، حيث يستخدم هذا الفعل كسيل لتفريغ مشاعره السلبية أو الضغط النفسي الذي يواجهه.";

let txt6=" التعامل مع التنمر الإلكتروني  التنمر الإلكتروني هو استخدام التكنولوجيا للتحرش أو التضييق الإلكتروني للأفراد أو المجموعات. يمكن أن يكون التنمر الإلكتروني عبر وسائل التواصل الاجتماعي، البريد الإلكتروني، الرسائل النصية، أو أي وسائل أخرى عبر الإنترنت. إذا كنت تواجه التنمر الإلكتروني، فإليك بعض الخطوات التي يمكنك اتخاذها للتعامل مع هذا الوضع: الابتعاد وعدم الاستجابة: قد يكون الرد على التنمر إشارة للمتنمرين بأنك تستجيب وتعتبر ذلك مهمًا. حاول تجاهل التنمر وعدم الاستجابة لتقليل فعالية المتنمرين. الإبلاغ: في حالة التنمر عبر منصات معينة، يفضل الإبلاغ عن المشكلة إلى الجهة المسؤولة. معظم المنصات لديها آليات للإبلاغ عن المضايقات والتنمر. حظر المتنمرين: قم بحظر الأشخاص الذين يقومون بالتنمر عليك عبر وسائل التواصل الاجتماعي أو أي وسائل أخرى. هذا يقلل من فرصهم للوصول إليك. الحفاظ على الأدلة: احتفظ بنسخ من جميع الرسائل أو المحتوى المسيء كدليل، حيث قد تكون هذه الأدلة مفيدة في حالة اللجوء إلى القانون. التحدث مع الأشخاص المختصين: إذا كنت تعتقد أن الموضوع قد تجاوز حدود التنمر الإلكتروني البسيط، فقد يكون من المفيد التحدث مع أصدقائك أو أفراد العائلة أو المعلمين أو المسؤولين في مؤسستك للحصول على الدعم والمساعدة. التوجه للسلطات: في حال استمرار التنمر وتدهور الوضع، قد تحتاج إلى اللجوء للسلطات المختصة. يجب عليك التوجه للشرطة أو الجهات القانونية للحصول على المساعدة. العناية بالصحة النفسية: قد يكون التنمر الإلكتروني مؤثرًا على الصحة النفسية. لا تتردد في البحث عن الدعم النفسي إذا كنت بحاجة إليه. ";

let txt7=" خطاب الكراهية عبر الإنترنت  يشكل تهديدًا خطيرًا للمجتمع والتواصل السلمي عبر العالم الرقمي. الخطاب الكراهية يمكن أن يكون أي نوع من التعبيرات التي تشجع على التمييز أو العنف ضد فئة معينة من الناس بناءً على عوامل مثل العرق، الدين، الجنس، الجنسية، الهوية الجندرية، أو أي سمة أخرى. تؤثر الكلمات بشكل كبير على آراء الأفراد وسلوكهم، وعندما يتم نشر خطاب الكراهية عبر الإنترنت، يمكن أن يؤدي ذلك إلى زيادة التوتر والتصاعد في المجتمع. إن استخدام اللغة لتحريض الكراهية يعرض الأفراد والمجتمعات للخطر، ويمكن أن يؤدي إلى أعمال عنف وتمييز. تحمي العديد من الدول حرية التعبير، ولكن يجب أن يكون هذا الحق مصحوبًا بالمسؤولية. يجب على مستخدمي الإنترنت أن يكونوا حذرين ويتجنبوا نشر أو ترويج للخطاب الكراهية. يعتبر التفاعل بشكل إيجابي واحترام الآراء المختلفة أمورًا أساسية في بناء مجتمع رقمي صحي ومتنوع.";

let txt8=" التعامل مع الخطاب الكراهية التعامل مع الخطاب الكراهية يمكن أن يكون تحديًا، ولكن هناك بعض الطرق التي يمكنك اتباعها للتعامل معه بشكل فعال: البقاء هادئًا: حاول أن تظل هادئًا ولا تستجيب بعنف. الرد بعنف قد يؤدي إلى تصاعد الموقف وزيادة التوتر. تجنب التجاوب المباشر: قد يكون من الأفضل تجاهل الخطاب الكراهية أو عدم الرد عليه مباشرة، خاصة إذا كان المرسل يبحث عن رد فعل سلبي. تحديد حدود: إذا كان بالإمكان، قد تحتاج إلى تحديد حدود واضحة مع الأشخاص الذين يروجون للخطاب الكراهي. اترك الشخص يعلم أن هناك خطوطًا لا يجب تجاوزها. البحث عن الدعم: لا تتردد في البحث عن دعم من الأصدقاء والعائلة أو المجتمع الذي تنتمي إليه. قد يكون لديهم نصائح قيمة أو دعم عاطفي يمكن أن يكون مفيدًا. الإبلاغ عن المضايقات: إذا كنت تشعر بأنك تتعرض لمضايقات على وسائل التواصل الاجتماعي أو في أي مكان آخر على الإنترنت، قد تكون هناك خيارات للإبلاغ عن هذا السلوك وطلب المساعدة. ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}

}

function Script3()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" أشكال العنف الإلكتروني تعتبر أشكال العنف الإلكتروني متنوعة وتشمل العديد من الأشكال المختلفة. إليك بعض أشكال العنف الإلكتروني الشائعة: التنميط: التنميط الكلامي : إرسال رسائل عنيفة أو تحقيرية عبر وسائل التواصل الاجتماعي أو المنتديات. التنميط العنصري : استخدام لغة عنصرية أو ترويج للكراهية بناءً على العرق. التحرش الإلكتروني: التحرش الجنسي عبر الإنترنت : متابعة الأفراد عبر الإنترنت بطرق مزعجة أو مخيفة. التحرش الإلكتروني الشخصي: إرسال رسائل تهديد أو مضايقة لشخص معين. الاحتيال والاحتيال الإلكتروني: التصيد الاحتيالي : إرسال رسائل زائفة تدعو الأفراد إلى كشف معلوماتهم الشخصية. التزوير الإلكتروني : تزوير المعلومات لتبدو كأنها من مصدر موثوق به. التشهير والابتزاز: نشر المعلومات الكاذبة: نشر معلومات كاذبة لتشويه سمعة الفرد. الابتزاز الرقمي: محاولة الحصول على مال أو خدمات بوساطة تهديدات إلكترونية. الهجمات السيبرانية: الهجمات الضخمة: توجيه حركة مرور إلكترونية كبيرة إلى خوادم معينة لتعطيلها. الاختراق : اختراق الأنظمة الإلكترونية للوصول إلى المعلومات أو التلاعب بها. التجسس الإلكتروني: اختراق الخصوصية: التجسس على الأفراد أو اختراق خصوصيتهم. التهديد بالعنف الجسدي: التهديد بالعنف عبر الإنترنت: تهديد الأفراد بالعنف عبر وسائل الإنترنت. ";

let txt2=" التعامل مع الدراما الرقمية يمكن أن يشير مصطلح الدراما الرقمية إلى محتوى ترفيهي يتم توفيره عبر الإنترنت، مثل المسلسلات والبرامج التلفزيونية التي يمكن مشاهدتها عبر منصات البث الرقمي. فيما يلي بعض النصائح للتعامل مع الدراما الرقمية: اختيار المنصة: قم باختيار منصة توفر محتوى الدراما الرقمية الذي يهمك.  التخطيط الزمني: قم بتحديد وقت محدد لمشاهدة الدراما الرقمية حتى لا تؤثر على وقتك الحياتي اليومي. مراعاة الحقوق التأليفية: تأكد من أنك تستخدم منصات قانونية لتجنب انتهاك حقوق الملكية الفكرية وتدعيم الصناعة الإبداعية. ";

let txt3=" التنمر الإلكتروني أو الإي-بلاغ هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتنمر على الأفراد أو المجموعات. يمكن أن يظهر التنمر الإلكتروني بأشكال مختلفة، منها: التنمر اللفظي: استخدام اللغة البذيئة أو العدائية عبر الإنترنت لإلحاق الأذى بالأشخاص. التنمر الاجتماعي: تشكيل مجموعات على وسائل التواصل الاجتماعي لاستهداف شخص معين والتنمر عليه. التنمر الإلكتروني الجنسي: إرسال رسائل جنسية غير مرغوب فيها أو مشاركة محتوى جنسي دون إذن. التنمر السيبراني: استخدام التكنولوجيا للتلاعب بالمعلومات أو الاختراق للحاق الضرر. التنمر الاقتصادي: استخدام الوسائل الرقمية للتأثير على الأوضاع الاقتصادية للأفراد أو المؤسسات.  ";

let txt4="آثار التنمر الإلكتروني التنمر الإلكتروني هو نوع من أنواع التنمر يتم عبر وسائل الاتصال الإلكترونية، مثل الإنترنت ووسائل التواصل الاجتماعي. يمكن أن يكون للتنمر الإلكتروني آثار سلبية جسيمة على الأفراد والمجتمعات. إليك بعض الآثار الشائعة للتنمر الإلكتروني: تأثير نفسي: يمكن أن يؤدي التنمر الإلكتروني إلى آثار نفسية خطيرة على الأفراد المتعرضين له. قد يعاني الضحايا من القلق، والاكتئاب، وانخراط في سلوكيات غير صحية نتيجة للتنمر الإلكتروني. تأثير اجتماعي: يمكن أن يؤدي التنمر الإلكتروني إلى الانعزال الاجتماعي وفقدان الثقة بالنفس، حيث يشعر الأفراد بأنهم غير محميين ومعرضين للخطر في بيئة الإنترنت. تأثير التعليم والعمل: يمكن أن يؤثر التنمر الإلكتروني على الأداء الأكاديمي للطلاب والموظفين، حيث يشعرون بصعوبة في التركيز والمشاركة في الأنشطة التعليمية أو العملية. تأثير صحي: يمكن أن يؤدي التنمر الإلكتروني إلى مشاكل صحية في بعض الحالات، مثل الأرق والصداع والتوتر العصبي. تأثير قانوني: في بعض الحالات، يمكن أن يكون للتنمر الإلكتروني عواقب قانونية. يمكن محاسبة المتنمرين الإلكترونيين قانونيًا في بعض الدول على أفعالهم الضارة.";

let txt5=" دوافع التنمر الإلكتروني التنمر الإلكتروني هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتحرش أو التنمر على الأفراد. يمكن أن تكون هناك عدة دوافع للتنمر الإلكتروني، ومن بين هذه الدوافع: التسلية أو التسلية السلبية: قد يقوم بعض الأشخاص بمضايقة الآخرين عبر الإنترنت بسبب فراغهم الوقت أو للمتعة الشخصية، ويرىون أنها طريقة للتسلية على حساب الآخرين. الغضب والانتقام: يمكن أن يكون التنمر الإلكتروني رد فعل على إحساس بالغضب أو الانتقام. يمكن أن يكون هذا ناتجًا عن خلافات شخصية أو تصادم في العلاقات الاجتماعية. الغيرة والتحقير: قد يتم توجيه التنمر الإلكتروني نحو أفراد ذوي شهرة أو نجاح، حيث يمكن أن يكون الغيرة أو الرغبة في التحقير دافعًا للتصرف بشكل سلبي. عدم فهم للآخرين: قد يقوم بعض الأفراد بالتنمر الإلكتروني بسبب عدم فهمهم للتأثير السلبي لأفعالهم على الضحايا، حيث يمكن أن يكونوا غير حساسين لمشاعر الآخرين. التفرغ للإنترنت: بعض الأشخاص الذين يقضون وقتًا طويلاً على الإنترنت قد يلجأون إلى التنمر الإلكتروني كوسيلة لتملأة وقتهم أو لتحقيق الشهرة السريعة دون التفكير في تداولهم للمعلومات السلبية. المشاكل النفسية: قد يكون للمشاكل النفسية لدى الفرد دور في قيامه بأفعال تنمر إلكتروني، حيث يستخدم هذا الفعل كسيل لتفريغ مشاعره السلبية أو الضغط النفسي الذي يواجهه.";

let txt6=" التعامل مع التنمر الإلكتروني  التنمر الإلكتروني هو استخدام التكنولوجيا للتحرش أو التضييق الإلكتروني للأفراد أو المجموعات. يمكن أن يكون التنمر الإلكتروني عبر وسائل التواصل الاجتماعي، البريد الإلكتروني، الرسائل النصية، أو أي وسائل أخرى عبر الإنترنت. إذا كنت تواجه التنمر الإلكتروني، فإليك بعض الخطوات التي يمكنك اتخاذها للتعامل مع هذا الوضع: الابتعاد وعدم الاستجابة: قد يكون الرد على التنمر إشارة للمتنمرين بأنك تستجيب وتعتبر ذلك مهمًا. حاول تجاهل التنمر وعدم الاستجابة لتقليل فعالية المتنمرين. الإبلاغ: في حالة التنمر عبر منصات معينة، يفضل الإبلاغ عن المشكلة إلى الجهة المسؤولة. معظم المنصات لديها آليات للإبلاغ عن المضايقات والتنمر. حظر المتنمرين: قم بحظر الأشخاص الذين يقومون بالتنمر عليك عبر وسائل التواصل الاجتماعي أو أي وسائل أخرى. هذا يقلل من فرصهم للوصول إليك. الحفاظ على الأدلة: احتفظ بنسخ من جميع الرسائل أو المحتوى المسيء كدليل، حيث قد تكون هذه الأدلة مفيدة في حالة اللجوء إلى القانون. التحدث مع الأشخاص المختصين: إذا كنت تعتقد أن الموضوع قد تجاوز حدود التنمر الإلكتروني البسيط، فقد يكون من المفيد التحدث مع أصدقائك أو أفراد العائلة أو المعلمين أو المسؤولين في مؤسستك للحصول على الدعم والمساعدة. التوجه للسلطات: في حال استمرار التنمر وتدهور الوضع، قد تحتاج إلى اللجوء للسلطات المختصة. يجب عليك التوجه للشرطة أو الجهات القانونية للحصول على المساعدة. العناية بالصحة النفسية: قد يكون التنمر الإلكتروني مؤثرًا على الصحة النفسية. لا تتردد في البحث عن الدعم النفسي إذا كنت بحاجة إليه. ";

let txt7=" خطاب الكراهية عبر الإنترنت  يشكل تهديدًا خطيرًا للمجتمع والتواصل السلمي عبر العالم الرقمي. الخطاب الكراهية يمكن أن يكون أي نوع من التعبيرات التي تشجع على التمييز أو العنف ضد فئة معينة من الناس بناءً على عوامل مثل العرق، الدين، الجنس، الجنسية، الهوية الجندرية، أو أي سمة أخرى. تؤثر الكلمات بشكل كبير على آراء الأفراد وسلوكهم، وعندما يتم نشر خطاب الكراهية عبر الإنترنت، يمكن أن يؤدي ذلك إلى زيادة التوتر والتصاعد في المجتمع. إن استخدام اللغة لتحريض الكراهية يعرض الأفراد والمجتمعات للخطر، ويمكن أن يؤدي إلى أعمال عنف وتمييز. تحمي العديد من الدول حرية التعبير، ولكن يجب أن يكون هذا الحق مصحوبًا بالمسؤولية. يجب على مستخدمي الإنترنت أن يكونوا حذرين ويتجنبوا نشر أو ترويج للخطاب الكراهية. يعتبر التفاعل بشكل إيجابي واحترام الآراء المختلفة أمورًا أساسية في بناء مجتمع رقمي صحي ومتنوع.";

let txt8=" التعامل مع الخطاب الكراهية التعامل مع الخطاب الكراهية يمكن أن يكون تحديًا، ولكن هناك بعض الطرق التي يمكنك اتباعها للتعامل معه بشكل فعال: البقاء هادئًا: حاول أن تظل هادئًا ولا تستجيب بعنف. الرد بعنف قد يؤدي إلى تصاعد الموقف وزيادة التوتر. تجنب التجاوب المباشر: قد يكون من الأفضل تجاهل الخطاب الكراهية أو عدم الرد عليه مباشرة، خاصة إذا كان المرسل يبحث عن رد فعل سلبي. تحديد حدود: إذا كان بالإمكان، قد تحتاج إلى تحديد حدود واضحة مع الأشخاص الذين يروجون للخطاب الكراهي. اترك الشخص يعلم أن هناك خطوطًا لا يجب تجاوزها. البحث عن الدعم: لا تتردد في البحث عن دعم من الأصدقاء والعائلة أو المجتمع الذي تنتمي إليه. قد يكون لديهم نصائح قيمة أو دعم عاطفي يمكن أن يكون مفيدًا. الإبلاغ عن المضايقات: إذا كنت تشعر بأنك تتعرض لمضايقات على وسائل التواصل الاجتماعي أو في أي مكان آخر على الإنترنت، قد تكون هناك خيارات للإبلاغ عن هذا السلوك وطلب المساعدة. ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}

}

function Script4()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" أشكال العنف الإلكتروني تعتبر أشكال العنف الإلكتروني متنوعة وتشمل العديد من الأشكال المختلفة. إليك بعض أشكال العنف الإلكتروني الشائعة: التنميط: التنميط الكلامي : إرسال رسائل عنيفة أو تحقيرية عبر وسائل التواصل الاجتماعي أو المنتديات. التنميط العنصري : استخدام لغة عنصرية أو ترويج للكراهية بناءً على العرق. التحرش الإلكتروني: التحرش الجنسي عبر الإنترنت : متابعة الأفراد عبر الإنترنت بطرق مزعجة أو مخيفة. التحرش الإلكتروني الشخصي: إرسال رسائل تهديد أو مضايقة لشخص معين. الاحتيال والاحتيال الإلكتروني: التصيد الاحتيالي : إرسال رسائل زائفة تدعو الأفراد إلى كشف معلوماتهم الشخصية. التزوير الإلكتروني : تزوير المعلومات لتبدو كأنها من مصدر موثوق به. التشهير والابتزاز: نشر المعلومات الكاذبة: نشر معلومات كاذبة لتشويه سمعة الفرد. الابتزاز الرقمي: محاولة الحصول على مال أو خدمات بوساطة تهديدات إلكترونية. الهجمات السيبرانية: الهجمات الضخمة: توجيه حركة مرور إلكترونية كبيرة إلى خوادم معينة لتعطيلها. الاختراق : اختراق الأنظمة الإلكترونية للوصول إلى المعلومات أو التلاعب بها. التجسس الإلكتروني: اختراق الخصوصية: التجسس على الأفراد أو اختراق خصوصيتهم. التهديد بالعنف الجسدي: التهديد بالعنف عبر الإنترنت: تهديد الأفراد بالعنف عبر وسائل الإنترنت. ";

let txt2=" التعامل مع الدراما الرقمية يمكن أن يشير مصطلح الدراما الرقمية إلى محتوى ترفيهي يتم توفيره عبر الإنترنت، مثل المسلسلات والبرامج التلفزيونية التي يمكن مشاهدتها عبر منصات البث الرقمي. فيما يلي بعض النصائح للتعامل مع الدراما الرقمية: اختيار المنصة: قم باختيار منصة توفر محتوى الدراما الرقمية الذي يهمك.  التخطيط الزمني: قم بتحديد وقت محدد لمشاهدة الدراما الرقمية حتى لا تؤثر على وقتك الحياتي اليومي. مراعاة الحقوق التأليفية: تأكد من أنك تستخدم منصات قانونية لتجنب انتهاك حقوق الملكية الفكرية وتدعيم الصناعة الإبداعية. ";

let txt3=" التنمر الإلكتروني أو الإي-بلاغ هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتنمر على الأفراد أو المجموعات. يمكن أن يظهر التنمر الإلكتروني بأشكال مختلفة، منها: التنمر اللفظي: استخدام اللغة البذيئة أو العدائية عبر الإنترنت لإلحاق الأذى بالأشخاص. التنمر الاجتماعي: تشكيل مجموعات على وسائل التواصل الاجتماعي لاستهداف شخص معين والتنمر عليه. التنمر الإلكتروني الجنسي: إرسال رسائل جنسية غير مرغوب فيها أو مشاركة محتوى جنسي دون إذن. التنمر السيبراني: استخدام التكنولوجيا للتلاعب بالمعلومات أو الاختراق للحاق الضرر. التنمر الاقتصادي: استخدام الوسائل الرقمية للتأثير على الأوضاع الاقتصادية للأفراد أو المؤسسات.  ";

let txt4="آثار التنمر الإلكتروني التنمر الإلكتروني هو نوع من أنواع التنمر يتم عبر وسائل الاتصال الإلكترونية، مثل الإنترنت ووسائل التواصل الاجتماعي. يمكن أن يكون للتنمر الإلكتروني آثار سلبية جسيمة على الأفراد والمجتمعات. إليك بعض الآثار الشائعة للتنمر الإلكتروني: تأثير نفسي: يمكن أن يؤدي التنمر الإلكتروني إلى آثار نفسية خطيرة على الأفراد المتعرضين له. قد يعاني الضحايا من القلق، والاكتئاب، وانخراط في سلوكيات غير صحية نتيجة للتنمر الإلكتروني. تأثير اجتماعي: يمكن أن يؤدي التنمر الإلكتروني إلى الانعزال الاجتماعي وفقدان الثقة بالنفس، حيث يشعر الأفراد بأنهم غير محميين ومعرضين للخطر في بيئة الإنترنت. تأثير التعليم والعمل: يمكن أن يؤثر التنمر الإلكتروني على الأداء الأكاديمي للطلاب والموظفين، حيث يشعرون بصعوبة في التركيز والمشاركة في الأنشطة التعليمية أو العملية. تأثير صحي: يمكن أن يؤدي التنمر الإلكتروني إلى مشاكل صحية في بعض الحالات، مثل الأرق والصداع والتوتر العصبي. تأثير قانوني: في بعض الحالات، يمكن أن يكون للتنمر الإلكتروني عواقب قانونية. يمكن محاسبة المتنمرين الإلكترونيين قانونيًا في بعض الدول على أفعالهم الضارة.";

let txt5=" دوافع التنمر الإلكتروني التنمر الإلكتروني هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتحرش أو التنمر على الأفراد. يمكن أن تكون هناك عدة دوافع للتنمر الإلكتروني، ومن بين هذه الدوافع: التسلية أو التسلية السلبية: قد يقوم بعض الأشخاص بمضايقة الآخرين عبر الإنترنت بسبب فراغهم الوقت أو للمتعة الشخصية، ويرىون أنها طريقة للتسلية على حساب الآخرين. الغضب والانتقام: يمكن أن يكون التنمر الإلكتروني رد فعل على إحساس بالغضب أو الانتقام. يمكن أن يكون هذا ناتجًا عن خلافات شخصية أو تصادم في العلاقات الاجتماعية. الغيرة والتحقير: قد يتم توجيه التنمر الإلكتروني نحو أفراد ذوي شهرة أو نجاح، حيث يمكن أن يكون الغيرة أو الرغبة في التحقير دافعًا للتصرف بشكل سلبي. عدم فهم للآخرين: قد يقوم بعض الأفراد بالتنمر الإلكتروني بسبب عدم فهمهم للتأثير السلبي لأفعالهم على الضحايا، حيث يمكن أن يكونوا غير حساسين لمشاعر الآخرين. التفرغ للإنترنت: بعض الأشخاص الذين يقضون وقتًا طويلاً على الإنترنت قد يلجأون إلى التنمر الإلكتروني كوسيلة لتملأة وقتهم أو لتحقيق الشهرة السريعة دون التفكير في تداولهم للمعلومات السلبية. المشاكل النفسية: قد يكون للمشاكل النفسية لدى الفرد دور في قيامه بأفعال تنمر إلكتروني، حيث يستخدم هذا الفعل كسيل لتفريغ مشاعره السلبية أو الضغط النفسي الذي يواجهه.";

let txt6=" التعامل مع التنمر الإلكتروني  التنمر الإلكتروني هو استخدام التكنولوجيا للتحرش أو التضييق الإلكتروني للأفراد أو المجموعات. يمكن أن يكون التنمر الإلكتروني عبر وسائل التواصل الاجتماعي، البريد الإلكتروني، الرسائل النصية، أو أي وسائل أخرى عبر الإنترنت. إذا كنت تواجه التنمر الإلكتروني، فإليك بعض الخطوات التي يمكنك اتخاذها للتعامل مع هذا الوضع: الابتعاد وعدم الاستجابة: قد يكون الرد على التنمر إشارة للمتنمرين بأنك تستجيب وتعتبر ذلك مهمًا. حاول تجاهل التنمر وعدم الاستجابة لتقليل فعالية المتنمرين. الإبلاغ: في حالة التنمر عبر منصات معينة، يفضل الإبلاغ عن المشكلة إلى الجهة المسؤولة. معظم المنصات لديها آليات للإبلاغ عن المضايقات والتنمر. حظر المتنمرين: قم بحظر الأشخاص الذين يقومون بالتنمر عليك عبر وسائل التواصل الاجتماعي أو أي وسائل أخرى. هذا يقلل من فرصهم للوصول إليك. الحفاظ على الأدلة: احتفظ بنسخ من جميع الرسائل أو المحتوى المسيء كدليل، حيث قد تكون هذه الأدلة مفيدة في حالة اللجوء إلى القانون. التحدث مع الأشخاص المختصين: إذا كنت تعتقد أن الموضوع قد تجاوز حدود التنمر الإلكتروني البسيط، فقد يكون من المفيد التحدث مع أصدقائك أو أفراد العائلة أو المعلمين أو المسؤولين في مؤسستك للحصول على الدعم والمساعدة. التوجه للسلطات: في حال استمرار التنمر وتدهور الوضع، قد تحتاج إلى اللجوء للسلطات المختصة. يجب عليك التوجه للشرطة أو الجهات القانونية للحصول على المساعدة. العناية بالصحة النفسية: قد يكون التنمر الإلكتروني مؤثرًا على الصحة النفسية. لا تتردد في البحث عن الدعم النفسي إذا كنت بحاجة إليه. ";

let txt7=" خطاب الكراهية عبر الإنترنت  يشكل تهديدًا خطيرًا للمجتمع والتواصل السلمي عبر العالم الرقمي. الخطاب الكراهية يمكن أن يكون أي نوع من التعبيرات التي تشجع على التمييز أو العنف ضد فئة معينة من الناس بناءً على عوامل مثل العرق، الدين، الجنس، الجنسية، الهوية الجندرية، أو أي سمة أخرى. تؤثر الكلمات بشكل كبير على آراء الأفراد وسلوكهم، وعندما يتم نشر خطاب الكراهية عبر الإنترنت، يمكن أن يؤدي ذلك إلى زيادة التوتر والتصاعد في المجتمع. إن استخدام اللغة لتحريض الكراهية يعرض الأفراد والمجتمعات للخطر، ويمكن أن يؤدي إلى أعمال عنف وتمييز. تحمي العديد من الدول حرية التعبير، ولكن يجب أن يكون هذا الحق مصحوبًا بالمسؤولية. يجب على مستخدمي الإنترنت أن يكونوا حذرين ويتجنبوا نشر أو ترويج للخطاب الكراهية. يعتبر التفاعل بشكل إيجابي واحترام الآراء المختلفة أمورًا أساسية في بناء مجتمع رقمي صحي ومتنوع.";

let txt8=" التعامل مع الخطاب الكراهية التعامل مع الخطاب الكراهية يمكن أن يكون تحديًا، ولكن هناك بعض الطرق التي يمكنك اتباعها للتعامل معه بشكل فعال: البقاء هادئًا: حاول أن تظل هادئًا ولا تستجيب بعنف. الرد بعنف قد يؤدي إلى تصاعد الموقف وزيادة التوتر. تجنب التجاوب المباشر: قد يكون من الأفضل تجاهل الخطاب الكراهية أو عدم الرد عليه مباشرة، خاصة إذا كان المرسل يبحث عن رد فعل سلبي. تحديد حدود: إذا كان بالإمكان، قد تحتاج إلى تحديد حدود واضحة مع الأشخاص الذين يروجون للخطاب الكراهي. اترك الشخص يعلم أن هناك خطوطًا لا يجب تجاوزها. البحث عن الدعم: لا تتردد في البحث عن دعم من الأصدقاء والعائلة أو المجتمع الذي تنتمي إليه. قد يكون لديهم نصائح قيمة أو دعم عاطفي يمكن أن يكون مفيدًا. الإبلاغ عن المضايقات: إذا كنت تشعر بأنك تتعرض لمضايقات على وسائل التواصل الاجتماعي أو في أي مكان آخر على الإنترنت، قد تكون هناك خيارات للإبلاغ عن هذا السلوك وطلب المساعدة. ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}

}

function Script5()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" أشكال العنف الإلكتروني تعتبر أشكال العنف الإلكتروني متنوعة وتشمل العديد من الأشكال المختلفة. إليك بعض أشكال العنف الإلكتروني الشائعة: التنميط: التنميط الكلامي : إرسال رسائل عنيفة أو تحقيرية عبر وسائل التواصل الاجتماعي أو المنتديات. التنميط العنصري : استخدام لغة عنصرية أو ترويج للكراهية بناءً على العرق. التحرش الإلكتروني: التحرش الجنسي عبر الإنترنت : متابعة الأفراد عبر الإنترنت بطرق مزعجة أو مخيفة. التحرش الإلكتروني الشخصي: إرسال رسائل تهديد أو مضايقة لشخص معين. الاحتيال والاحتيال الإلكتروني: التصيد الاحتيالي : إرسال رسائل زائفة تدعو الأفراد إلى كشف معلوماتهم الشخصية. التزوير الإلكتروني : تزوير المعلومات لتبدو كأنها من مصدر موثوق به. التشهير والابتزاز: نشر المعلومات الكاذبة: نشر معلومات كاذبة لتشويه سمعة الفرد. الابتزاز الرقمي: محاولة الحصول على مال أو خدمات بوساطة تهديدات إلكترونية. الهجمات السيبرانية: الهجمات الضخمة: توجيه حركة مرور إلكترونية كبيرة إلى خوادم معينة لتعطيلها. الاختراق : اختراق الأنظمة الإلكترونية للوصول إلى المعلومات أو التلاعب بها. التجسس الإلكتروني: اختراق الخصوصية: التجسس على الأفراد أو اختراق خصوصيتهم. التهديد بالعنف الجسدي: التهديد بالعنف عبر الإنترنت: تهديد الأفراد بالعنف عبر وسائل الإنترنت. ";

let txt2=" التعامل مع الدراما الرقمية يمكن أن يشير مصطلح الدراما الرقمية إلى محتوى ترفيهي يتم توفيره عبر الإنترنت، مثل المسلسلات والبرامج التلفزيونية التي يمكن مشاهدتها عبر منصات البث الرقمي. فيما يلي بعض النصائح للتعامل مع الدراما الرقمية: اختيار المنصة: قم باختيار منصة توفر محتوى الدراما الرقمية الذي يهمك.  التخطيط الزمني: قم بتحديد وقت محدد لمشاهدة الدراما الرقمية حتى لا تؤثر على وقتك الحياتي اليومي. مراعاة الحقوق التأليفية: تأكد من أنك تستخدم منصات قانونية لتجنب انتهاك حقوق الملكية الفكرية وتدعيم الصناعة الإبداعية. ";

let txt3=" التنمر الإلكتروني أو الإي-بلاغ هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتنمر على الأفراد أو المجموعات. يمكن أن يظهر التنمر الإلكتروني بأشكال مختلفة، منها: التنمر اللفظي: استخدام اللغة البذيئة أو العدائية عبر الإنترنت لإلحاق الأذى بالأشخاص. التنمر الاجتماعي: تشكيل مجموعات على وسائل التواصل الاجتماعي لاستهداف شخص معين والتنمر عليه. التنمر الإلكتروني الجنسي: إرسال رسائل جنسية غير مرغوب فيها أو مشاركة محتوى جنسي دون إذن. التنمر السيبراني: استخدام التكنولوجيا للتلاعب بالمعلومات أو الاختراق للحاق الضرر. التنمر الاقتصادي: استخدام الوسائل الرقمية للتأثير على الأوضاع الاقتصادية للأفراد أو المؤسسات.  ";

let txt4="آثار التنمر الإلكتروني التنمر الإلكتروني هو نوع من أنواع التنمر يتم عبر وسائل الاتصال الإلكترونية، مثل الإنترنت ووسائل التواصل الاجتماعي. يمكن أن يكون للتنمر الإلكتروني آثار سلبية جسيمة على الأفراد والمجتمعات. إليك بعض الآثار الشائعة للتنمر الإلكتروني: تأثير نفسي: يمكن أن يؤدي التنمر الإلكتروني إلى آثار نفسية خطيرة على الأفراد المتعرضين له. قد يعاني الضحايا من القلق، والاكتئاب، وانخراط في سلوكيات غير صحية نتيجة للتنمر الإلكتروني. تأثير اجتماعي: يمكن أن يؤدي التنمر الإلكتروني إلى الانعزال الاجتماعي وفقدان الثقة بالنفس، حيث يشعر الأفراد بأنهم غير محميين ومعرضين للخطر في بيئة الإنترنت. تأثير التعليم والعمل: يمكن أن يؤثر التنمر الإلكتروني على الأداء الأكاديمي للطلاب والموظفين، حيث يشعرون بصعوبة في التركيز والمشاركة في الأنشطة التعليمية أو العملية. تأثير صحي: يمكن أن يؤدي التنمر الإلكتروني إلى مشاكل صحية في بعض الحالات، مثل الأرق والصداع والتوتر العصبي. تأثير قانوني: في بعض الحالات، يمكن أن يكون للتنمر الإلكتروني عواقب قانونية. يمكن محاسبة المتنمرين الإلكترونيين قانونيًا في بعض الدول على أفعالهم الضارة.";

let txt5=" دوافع التنمر الإلكتروني التنمر الإلكتروني هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتحرش أو التنمر على الأفراد. يمكن أن تكون هناك عدة دوافع للتنمر الإلكتروني، ومن بين هذه الدوافع: التسلية أو التسلية السلبية: قد يقوم بعض الأشخاص بمضايقة الآخرين عبر الإنترنت بسبب فراغهم الوقت أو للمتعة الشخصية، ويرىون أنها طريقة للتسلية على حساب الآخرين. الغضب والانتقام: يمكن أن يكون التنمر الإلكتروني رد فعل على إحساس بالغضب أو الانتقام. يمكن أن يكون هذا ناتجًا عن خلافات شخصية أو تصادم في العلاقات الاجتماعية. الغيرة والتحقير: قد يتم توجيه التنمر الإلكتروني نحو أفراد ذوي شهرة أو نجاح، حيث يمكن أن يكون الغيرة أو الرغبة في التحقير دافعًا للتصرف بشكل سلبي. عدم فهم للآخرين: قد يقوم بعض الأفراد بالتنمر الإلكتروني بسبب عدم فهمهم للتأثير السلبي لأفعالهم على الضحايا، حيث يمكن أن يكونوا غير حساسين لمشاعر الآخرين. التفرغ للإنترنت: بعض الأشخاص الذين يقضون وقتًا طويلاً على الإنترنت قد يلجأون إلى التنمر الإلكتروني كوسيلة لتملأة وقتهم أو لتحقيق الشهرة السريعة دون التفكير في تداولهم للمعلومات السلبية. المشاكل النفسية: قد يكون للمشاكل النفسية لدى الفرد دور في قيامه بأفعال تنمر إلكتروني، حيث يستخدم هذا الفعل كسيل لتفريغ مشاعره السلبية أو الضغط النفسي الذي يواجهه.";

let txt6=" التعامل مع التنمر الإلكتروني  التنمر الإلكتروني هو استخدام التكنولوجيا للتحرش أو التضييق الإلكتروني للأفراد أو المجموعات. يمكن أن يكون التنمر الإلكتروني عبر وسائل التواصل الاجتماعي، البريد الإلكتروني، الرسائل النصية، أو أي وسائل أخرى عبر الإنترنت. إذا كنت تواجه التنمر الإلكتروني، فإليك بعض الخطوات التي يمكنك اتخاذها للتعامل مع هذا الوضع: الابتعاد وعدم الاستجابة: قد يكون الرد على التنمر إشارة للمتنمرين بأنك تستجيب وتعتبر ذلك مهمًا. حاول تجاهل التنمر وعدم الاستجابة لتقليل فعالية المتنمرين. الإبلاغ: في حالة التنمر عبر منصات معينة، يفضل الإبلاغ عن المشكلة إلى الجهة المسؤولة. معظم المنصات لديها آليات للإبلاغ عن المضايقات والتنمر. حظر المتنمرين: قم بحظر الأشخاص الذين يقومون بالتنمر عليك عبر وسائل التواصل الاجتماعي أو أي وسائل أخرى. هذا يقلل من فرصهم للوصول إليك. الحفاظ على الأدلة: احتفظ بنسخ من جميع الرسائل أو المحتوى المسيء كدليل، حيث قد تكون هذه الأدلة مفيدة في حالة اللجوء إلى القانون. التحدث مع الأشخاص المختصين: إذا كنت تعتقد أن الموضوع قد تجاوز حدود التنمر الإلكتروني البسيط، فقد يكون من المفيد التحدث مع أصدقائك أو أفراد العائلة أو المعلمين أو المسؤولين في مؤسستك للحصول على الدعم والمساعدة. التوجه للسلطات: في حال استمرار التنمر وتدهور الوضع، قد تحتاج إلى اللجوء للسلطات المختصة. يجب عليك التوجه للشرطة أو الجهات القانونية للحصول على المساعدة. العناية بالصحة النفسية: قد يكون التنمر الإلكتروني مؤثرًا على الصحة النفسية. لا تتردد في البحث عن الدعم النفسي إذا كنت بحاجة إليه. ";

let txt7=" خطاب الكراهية عبر الإنترنت  يشكل تهديدًا خطيرًا للمجتمع والتواصل السلمي عبر العالم الرقمي. الخطاب الكراهية يمكن أن يكون أي نوع من التعبيرات التي تشجع على التمييز أو العنف ضد فئة معينة من الناس بناءً على عوامل مثل العرق، الدين، الجنس، الجنسية، الهوية الجندرية، أو أي سمة أخرى. تؤثر الكلمات بشكل كبير على آراء الأفراد وسلوكهم، وعندما يتم نشر خطاب الكراهية عبر الإنترنت، يمكن أن يؤدي ذلك إلى زيادة التوتر والتصاعد في المجتمع. إن استخدام اللغة لتحريض الكراهية يعرض الأفراد والمجتمعات للخطر، ويمكن أن يؤدي إلى أعمال عنف وتمييز. تحمي العديد من الدول حرية التعبير، ولكن يجب أن يكون هذا الحق مصحوبًا بالمسؤولية. يجب على مستخدمي الإنترنت أن يكونوا حذرين ويتجنبوا نشر أو ترويج للخطاب الكراهية. يعتبر التفاعل بشكل إيجابي واحترام الآراء المختلفة أمورًا أساسية في بناء مجتمع رقمي صحي ومتنوع.";

let txt8=" التعامل مع الخطاب الكراهية التعامل مع الخطاب الكراهية يمكن أن يكون تحديًا، ولكن هناك بعض الطرق التي يمكنك اتباعها للتعامل معه بشكل فعال: البقاء هادئًا: حاول أن تظل هادئًا ولا تستجيب بعنف. الرد بعنف قد يؤدي إلى تصاعد الموقف وزيادة التوتر. تجنب التجاوب المباشر: قد يكون من الأفضل تجاهل الخطاب الكراهية أو عدم الرد عليه مباشرة، خاصة إذا كان المرسل يبحث عن رد فعل سلبي. تحديد حدود: إذا كان بالإمكان، قد تحتاج إلى تحديد حدود واضحة مع الأشخاص الذين يروجون للخطاب الكراهي. اترك الشخص يعلم أن هناك خطوطًا لا يجب تجاوزها. البحث عن الدعم: لا تتردد في البحث عن دعم من الأصدقاء والعائلة أو المجتمع الذي تنتمي إليه. قد يكون لديهم نصائح قيمة أو دعم عاطفي يمكن أن يكون مفيدًا. الإبلاغ عن المضايقات: إذا كنت تشعر بأنك تتعرض لمضايقات على وسائل التواصل الاجتماعي أو في أي مكان آخر على الإنترنت، قد تكون هناك خيارات للإبلاغ عن هذا السلوك وطلب المساعدة. ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}

}

function Script6()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" أشكال العنف الإلكتروني تعتبر أشكال العنف الإلكتروني متنوعة وتشمل العديد من الأشكال المختلفة. إليك بعض أشكال العنف الإلكتروني الشائعة: التنميط: التنميط الكلامي : إرسال رسائل عنيفة أو تحقيرية عبر وسائل التواصل الاجتماعي أو المنتديات. التنميط العنصري : استخدام لغة عنصرية أو ترويج للكراهية بناءً على العرق. التحرش الإلكتروني: التحرش الجنسي عبر الإنترنت : متابعة الأفراد عبر الإنترنت بطرق مزعجة أو مخيفة. التحرش الإلكتروني الشخصي: إرسال رسائل تهديد أو مضايقة لشخص معين. الاحتيال والاحتيال الإلكتروني: التصيد الاحتيالي : إرسال رسائل زائفة تدعو الأفراد إلى كشف معلوماتهم الشخصية. التزوير الإلكتروني : تزوير المعلومات لتبدو كأنها من مصدر موثوق به. التشهير والابتزاز: نشر المعلومات الكاذبة: نشر معلومات كاذبة لتشويه سمعة الفرد. الابتزاز الرقمي: محاولة الحصول على مال أو خدمات بوساطة تهديدات إلكترونية. الهجمات السيبرانية: الهجمات الضخمة: توجيه حركة مرور إلكترونية كبيرة إلى خوادم معينة لتعطيلها. الاختراق : اختراق الأنظمة الإلكترونية للوصول إلى المعلومات أو التلاعب بها. التجسس الإلكتروني: اختراق الخصوصية: التجسس على الأفراد أو اختراق خصوصيتهم. التهديد بالعنف الجسدي: التهديد بالعنف عبر الإنترنت: تهديد الأفراد بالعنف عبر وسائل الإنترنت. ";

let txt2=" التعامل مع الدراما الرقمية يمكن أن يشير مصطلح الدراما الرقمية إلى محتوى ترفيهي يتم توفيره عبر الإنترنت، مثل المسلسلات والبرامج التلفزيونية التي يمكن مشاهدتها عبر منصات البث الرقمي. فيما يلي بعض النصائح للتعامل مع الدراما الرقمية: اختيار المنصة: قم باختيار منصة توفر محتوى الدراما الرقمية الذي يهمك.  التخطيط الزمني: قم بتحديد وقت محدد لمشاهدة الدراما الرقمية حتى لا تؤثر على وقتك الحياتي اليومي. مراعاة الحقوق التأليفية: تأكد من أنك تستخدم منصات قانونية لتجنب انتهاك حقوق الملكية الفكرية وتدعيم الصناعة الإبداعية. ";

let txt3=" التنمر الإلكتروني أو الإي-بلاغ هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتنمر على الأفراد أو المجموعات. يمكن أن يظهر التنمر الإلكتروني بأشكال مختلفة، منها: التنمر اللفظي: استخدام اللغة البذيئة أو العدائية عبر الإنترنت لإلحاق الأذى بالأشخاص. التنمر الاجتماعي: تشكيل مجموعات على وسائل التواصل الاجتماعي لاستهداف شخص معين والتنمر عليه. التنمر الإلكتروني الجنسي: إرسال رسائل جنسية غير مرغوب فيها أو مشاركة محتوى جنسي دون إذن. التنمر السيبراني: استخدام التكنولوجيا للتلاعب بالمعلومات أو الاختراق للحاق الضرر. التنمر الاقتصادي: استخدام الوسائل الرقمية للتأثير على الأوضاع الاقتصادية للأفراد أو المؤسسات.  ";

let txt4="آثار التنمر الإلكتروني التنمر الإلكتروني هو نوع من أنواع التنمر يتم عبر وسائل الاتصال الإلكترونية، مثل الإنترنت ووسائل التواصل الاجتماعي. يمكن أن يكون للتنمر الإلكتروني آثار سلبية جسيمة على الأفراد والمجتمعات. إليك بعض الآثار الشائعة للتنمر الإلكتروني: تأثير نفسي: يمكن أن يؤدي التنمر الإلكتروني إلى آثار نفسية خطيرة على الأفراد المتعرضين له. قد يعاني الضحايا من القلق، والاكتئاب، وانخراط في سلوكيات غير صحية نتيجة للتنمر الإلكتروني. تأثير اجتماعي: يمكن أن يؤدي التنمر الإلكتروني إلى الانعزال الاجتماعي وفقدان الثقة بالنفس، حيث يشعر الأفراد بأنهم غير محميين ومعرضين للخطر في بيئة الإنترنت. تأثير التعليم والعمل: يمكن أن يؤثر التنمر الإلكتروني على الأداء الأكاديمي للطلاب والموظفين، حيث يشعرون بصعوبة في التركيز والمشاركة في الأنشطة التعليمية أو العملية. تأثير صحي: يمكن أن يؤدي التنمر الإلكتروني إلى مشاكل صحية في بعض الحالات، مثل الأرق والصداع والتوتر العصبي. تأثير قانوني: في بعض الحالات، يمكن أن يكون للتنمر الإلكتروني عواقب قانونية. يمكن محاسبة المتنمرين الإلكترونيين قانونيًا في بعض الدول على أفعالهم الضارة.";

let txt5=" دوافع التنمر الإلكتروني التنمر الإلكتروني هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتحرش أو التنمر على الأفراد. يمكن أن تكون هناك عدة دوافع للتنمر الإلكتروني، ومن بين هذه الدوافع: التسلية أو التسلية السلبية: قد يقوم بعض الأشخاص بمضايقة الآخرين عبر الإنترنت بسبب فراغهم الوقت أو للمتعة الشخصية، ويرىون أنها طريقة للتسلية على حساب الآخرين. الغضب والانتقام: يمكن أن يكون التنمر الإلكتروني رد فعل على إحساس بالغضب أو الانتقام. يمكن أن يكون هذا ناتجًا عن خلافات شخصية أو تصادم في العلاقات الاجتماعية. الغيرة والتحقير: قد يتم توجيه التنمر الإلكتروني نحو أفراد ذوي شهرة أو نجاح، حيث يمكن أن يكون الغيرة أو الرغبة في التحقير دافعًا للتصرف بشكل سلبي. عدم فهم للآخرين: قد يقوم بعض الأفراد بالتنمر الإلكتروني بسبب عدم فهمهم للتأثير السلبي لأفعالهم على الضحايا، حيث يمكن أن يكونوا غير حساسين لمشاعر الآخرين. التفرغ للإنترنت: بعض الأشخاص الذين يقضون وقتًا طويلاً على الإنترنت قد يلجأون إلى التنمر الإلكتروني كوسيلة لتملأة وقتهم أو لتحقيق الشهرة السريعة دون التفكير في تداولهم للمعلومات السلبية. المشاكل النفسية: قد يكون للمشاكل النفسية لدى الفرد دور في قيامه بأفعال تنمر إلكتروني، حيث يستخدم هذا الفعل كسيل لتفريغ مشاعره السلبية أو الضغط النفسي الذي يواجهه.";

let txt6=" التعامل مع التنمر الإلكتروني  التنمر الإلكتروني هو استخدام التكنولوجيا للتحرش أو التضييق الإلكتروني للأفراد أو المجموعات. يمكن أن يكون التنمر الإلكتروني عبر وسائل التواصل الاجتماعي، البريد الإلكتروني، الرسائل النصية، أو أي وسائل أخرى عبر الإنترنت. إذا كنت تواجه التنمر الإلكتروني، فإليك بعض الخطوات التي يمكنك اتخاذها للتعامل مع هذا الوضع: الابتعاد وعدم الاستجابة: قد يكون الرد على التنمر إشارة للمتنمرين بأنك تستجيب وتعتبر ذلك مهمًا. حاول تجاهل التنمر وعدم الاستجابة لتقليل فعالية المتنمرين. الإبلاغ: في حالة التنمر عبر منصات معينة، يفضل الإبلاغ عن المشكلة إلى الجهة المسؤولة. معظم المنصات لديها آليات للإبلاغ عن المضايقات والتنمر. حظر المتنمرين: قم بحظر الأشخاص الذين يقومون بالتنمر عليك عبر وسائل التواصل الاجتماعي أو أي وسائل أخرى. هذا يقلل من فرصهم للوصول إليك. الحفاظ على الأدلة: احتفظ بنسخ من جميع الرسائل أو المحتوى المسيء كدليل، حيث قد تكون هذه الأدلة مفيدة في حالة اللجوء إلى القانون. التحدث مع الأشخاص المختصين: إذا كنت تعتقد أن الموضوع قد تجاوز حدود التنمر الإلكتروني البسيط، فقد يكون من المفيد التحدث مع أصدقائك أو أفراد العائلة أو المعلمين أو المسؤولين في مؤسستك للحصول على الدعم والمساعدة. التوجه للسلطات: في حال استمرار التنمر وتدهور الوضع، قد تحتاج إلى اللجوء للسلطات المختصة. يجب عليك التوجه للشرطة أو الجهات القانونية للحصول على المساعدة. العناية بالصحة النفسية: قد يكون التنمر الإلكتروني مؤثرًا على الصحة النفسية. لا تتردد في البحث عن الدعم النفسي إذا كنت بحاجة إليه. ";

let txt7=" خطاب الكراهية عبر الإنترنت  يشكل تهديدًا خطيرًا للمجتمع والتواصل السلمي عبر العالم الرقمي. الخطاب الكراهية يمكن أن يكون أي نوع من التعبيرات التي تشجع على التمييز أو العنف ضد فئة معينة من الناس بناءً على عوامل مثل العرق، الدين، الجنس، الجنسية، الهوية الجندرية، أو أي سمة أخرى. تؤثر الكلمات بشكل كبير على آراء الأفراد وسلوكهم، وعندما يتم نشر خطاب الكراهية عبر الإنترنت، يمكن أن يؤدي ذلك إلى زيادة التوتر والتصاعد في المجتمع. إن استخدام اللغة لتحريض الكراهية يعرض الأفراد والمجتمعات للخطر، ويمكن أن يؤدي إلى أعمال عنف وتمييز. تحمي العديد من الدول حرية التعبير، ولكن يجب أن يكون هذا الحق مصحوبًا بالمسؤولية. يجب على مستخدمي الإنترنت أن يكونوا حذرين ويتجنبوا نشر أو ترويج للخطاب الكراهية. يعتبر التفاعل بشكل إيجابي واحترام الآراء المختلفة أمورًا أساسية في بناء مجتمع رقمي صحي ومتنوع.";

let txt8=" التعامل مع الخطاب الكراهية التعامل مع الخطاب الكراهية يمكن أن يكون تحديًا، ولكن هناك بعض الطرق التي يمكنك اتباعها للتعامل معه بشكل فعال: البقاء هادئًا: حاول أن تظل هادئًا ولا تستجيب بعنف. الرد بعنف قد يؤدي إلى تصاعد الموقف وزيادة التوتر. تجنب التجاوب المباشر: قد يكون من الأفضل تجاهل الخطاب الكراهية أو عدم الرد عليه مباشرة، خاصة إذا كان المرسل يبحث عن رد فعل سلبي. تحديد حدود: إذا كان بالإمكان، قد تحتاج إلى تحديد حدود واضحة مع الأشخاص الذين يروجون للخطاب الكراهي. اترك الشخص يعلم أن هناك خطوطًا لا يجب تجاوزها. البحث عن الدعم: لا تتردد في البحث عن دعم من الأصدقاء والعائلة أو المجتمع الذي تنتمي إليه. قد يكون لديهم نصائح قيمة أو دعم عاطفي يمكن أن يكون مفيدًا. الإبلاغ عن المضايقات: إذا كنت تشعر بأنك تتعرض لمضايقات على وسائل التواصل الاجتماعي أو في أي مكان آخر على الإنترنت، قد تكون هناك خيارات للإبلاغ عن هذا السلوك وطلب المساعدة. ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}

}

function Script7()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" أشكال العنف الإلكتروني تعتبر أشكال العنف الإلكتروني متنوعة وتشمل العديد من الأشكال المختلفة. إليك بعض أشكال العنف الإلكتروني الشائعة: التنميط: التنميط الكلامي : إرسال رسائل عنيفة أو تحقيرية عبر وسائل التواصل الاجتماعي أو المنتديات. التنميط العنصري : استخدام لغة عنصرية أو ترويج للكراهية بناءً على العرق. التحرش الإلكتروني: التحرش الجنسي عبر الإنترنت : متابعة الأفراد عبر الإنترنت بطرق مزعجة أو مخيفة. التحرش الإلكتروني الشخصي: إرسال رسائل تهديد أو مضايقة لشخص معين. الاحتيال والاحتيال الإلكتروني: التصيد الاحتيالي : إرسال رسائل زائفة تدعو الأفراد إلى كشف معلوماتهم الشخصية. التزوير الإلكتروني : تزوير المعلومات لتبدو كأنها من مصدر موثوق به. التشهير والابتزاز: نشر المعلومات الكاذبة: نشر معلومات كاذبة لتشويه سمعة الفرد. الابتزاز الرقمي: محاولة الحصول على مال أو خدمات بوساطة تهديدات إلكترونية. الهجمات السيبرانية: الهجمات الضخمة: توجيه حركة مرور إلكترونية كبيرة إلى خوادم معينة لتعطيلها. الاختراق : اختراق الأنظمة الإلكترونية للوصول إلى المعلومات أو التلاعب بها. التجسس الإلكتروني: اختراق الخصوصية: التجسس على الأفراد أو اختراق خصوصيتهم. التهديد بالعنف الجسدي: التهديد بالعنف عبر الإنترنت: تهديد الأفراد بالعنف عبر وسائل الإنترنت. ";

let txt2=" التعامل مع الدراما الرقمية يمكن أن يشير مصطلح الدراما الرقمية إلى محتوى ترفيهي يتم توفيره عبر الإنترنت، مثل المسلسلات والبرامج التلفزيونية التي يمكن مشاهدتها عبر منصات البث الرقمي. فيما يلي بعض النصائح للتعامل مع الدراما الرقمية: اختيار المنصة: قم باختيار منصة توفر محتوى الدراما الرقمية الذي يهمك.  التخطيط الزمني: قم بتحديد وقت محدد لمشاهدة الدراما الرقمية حتى لا تؤثر على وقتك الحياتي اليومي. مراعاة الحقوق التأليفية: تأكد من أنك تستخدم منصات قانونية لتجنب انتهاك حقوق الملكية الفكرية وتدعيم الصناعة الإبداعية. ";

let txt3=" التنمر الإلكتروني أو الإي-بلاغ هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتنمر على الأفراد أو المجموعات. يمكن أن يظهر التنمر الإلكتروني بأشكال مختلفة، منها: التنمر اللفظي: استخدام اللغة البذيئة أو العدائية عبر الإنترنت لإلحاق الأذى بالأشخاص. التنمر الاجتماعي: تشكيل مجموعات على وسائل التواصل الاجتماعي لاستهداف شخص معين والتنمر عليه. التنمر الإلكتروني الجنسي: إرسال رسائل جنسية غير مرغوب فيها أو مشاركة محتوى جنسي دون إذن. التنمر السيبراني: استخدام التكنولوجيا للتلاعب بالمعلومات أو الاختراق للحاق الضرر. التنمر الاقتصادي: استخدام الوسائل الرقمية للتأثير على الأوضاع الاقتصادية للأفراد أو المؤسسات.  ";

let txt4="آثار التنمر الإلكتروني التنمر الإلكتروني هو نوع من أنواع التنمر يتم عبر وسائل الاتصال الإلكترونية، مثل الإنترنت ووسائل التواصل الاجتماعي. يمكن أن يكون للتنمر الإلكتروني آثار سلبية جسيمة على الأفراد والمجتمعات. إليك بعض الآثار الشائعة للتنمر الإلكتروني: تأثير نفسي: يمكن أن يؤدي التنمر الإلكتروني إلى آثار نفسية خطيرة على الأفراد المتعرضين له. قد يعاني الضحايا من القلق، والاكتئاب، وانخراط في سلوكيات غير صحية نتيجة للتنمر الإلكتروني. تأثير اجتماعي: يمكن أن يؤدي التنمر الإلكتروني إلى الانعزال الاجتماعي وفقدان الثقة بالنفس، حيث يشعر الأفراد بأنهم غير محميين ومعرضين للخطر في بيئة الإنترنت. تأثير التعليم والعمل: يمكن أن يؤثر التنمر الإلكتروني على الأداء الأكاديمي للطلاب والموظفين، حيث يشعرون بصعوبة في التركيز والمشاركة في الأنشطة التعليمية أو العملية. تأثير صحي: يمكن أن يؤدي التنمر الإلكتروني إلى مشاكل صحية في بعض الحالات، مثل الأرق والصداع والتوتر العصبي. تأثير قانوني: في بعض الحالات، يمكن أن يكون للتنمر الإلكتروني عواقب قانونية. يمكن محاسبة المتنمرين الإلكترونيين قانونيًا في بعض الدول على أفعالهم الضارة.";

let txt5=" دوافع التنمر الإلكتروني التنمر الإلكتروني هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتحرش أو التنمر على الأفراد. يمكن أن تكون هناك عدة دوافع للتنمر الإلكتروني، ومن بين هذه الدوافع: التسلية أو التسلية السلبية: قد يقوم بعض الأشخاص بمضايقة الآخرين عبر الإنترنت بسبب فراغهم الوقت أو للمتعة الشخصية، ويرىون أنها طريقة للتسلية على حساب الآخرين. الغضب والانتقام: يمكن أن يكون التنمر الإلكتروني رد فعل على إحساس بالغضب أو الانتقام. يمكن أن يكون هذا ناتجًا عن خلافات شخصية أو تصادم في العلاقات الاجتماعية. الغيرة والتحقير: قد يتم توجيه التنمر الإلكتروني نحو أفراد ذوي شهرة أو نجاح، حيث يمكن أن يكون الغيرة أو الرغبة في التحقير دافعًا للتصرف بشكل سلبي. عدم فهم للآخرين: قد يقوم بعض الأفراد بالتنمر الإلكتروني بسبب عدم فهمهم للتأثير السلبي لأفعالهم على الضحايا، حيث يمكن أن يكونوا غير حساسين لمشاعر الآخرين. التفرغ للإنترنت: بعض الأشخاص الذين يقضون وقتًا طويلاً على الإنترنت قد يلجأون إلى التنمر الإلكتروني كوسيلة لتملأة وقتهم أو لتحقيق الشهرة السريعة دون التفكير في تداولهم للمعلومات السلبية. المشاكل النفسية: قد يكون للمشاكل النفسية لدى الفرد دور في قيامه بأفعال تنمر إلكتروني، حيث يستخدم هذا الفعل كسيل لتفريغ مشاعره السلبية أو الضغط النفسي الذي يواجهه.";

let txt6=" التعامل مع التنمر الإلكتروني  التنمر الإلكتروني هو استخدام التكنولوجيا للتحرش أو التضييق الإلكتروني للأفراد أو المجموعات. يمكن أن يكون التنمر الإلكتروني عبر وسائل التواصل الاجتماعي، البريد الإلكتروني، الرسائل النصية، أو أي وسائل أخرى عبر الإنترنت. إذا كنت تواجه التنمر الإلكتروني، فإليك بعض الخطوات التي يمكنك اتخاذها للتعامل مع هذا الوضع: الابتعاد وعدم الاستجابة: قد يكون الرد على التنمر إشارة للمتنمرين بأنك تستجيب وتعتبر ذلك مهمًا. حاول تجاهل التنمر وعدم الاستجابة لتقليل فعالية المتنمرين. الإبلاغ: في حالة التنمر عبر منصات معينة، يفضل الإبلاغ عن المشكلة إلى الجهة المسؤولة. معظم المنصات لديها آليات للإبلاغ عن المضايقات والتنمر. حظر المتنمرين: قم بحظر الأشخاص الذين يقومون بالتنمر عليك عبر وسائل التواصل الاجتماعي أو أي وسائل أخرى. هذا يقلل من فرصهم للوصول إليك. الحفاظ على الأدلة: احتفظ بنسخ من جميع الرسائل أو المحتوى المسيء كدليل، حيث قد تكون هذه الأدلة مفيدة في حالة اللجوء إلى القانون. التحدث مع الأشخاص المختصين: إذا كنت تعتقد أن الموضوع قد تجاوز حدود التنمر الإلكتروني البسيط، فقد يكون من المفيد التحدث مع أصدقائك أو أفراد العائلة أو المعلمين أو المسؤولين في مؤسستك للحصول على الدعم والمساعدة. التوجه للسلطات: في حال استمرار التنمر وتدهور الوضع، قد تحتاج إلى اللجوء للسلطات المختصة. يجب عليك التوجه للشرطة أو الجهات القانونية للحصول على المساعدة. العناية بالصحة النفسية: قد يكون التنمر الإلكتروني مؤثرًا على الصحة النفسية. لا تتردد في البحث عن الدعم النفسي إذا كنت بحاجة إليه. ";

let txt7=" خطاب الكراهية عبر الإنترنت  يشكل تهديدًا خطيرًا للمجتمع والتواصل السلمي عبر العالم الرقمي. الخطاب الكراهية يمكن أن يكون أي نوع من التعبيرات التي تشجع على التمييز أو العنف ضد فئة معينة من الناس بناءً على عوامل مثل العرق، الدين، الجنس، الجنسية، الهوية الجندرية، أو أي سمة أخرى. تؤثر الكلمات بشكل كبير على آراء الأفراد وسلوكهم، وعندما يتم نشر خطاب الكراهية عبر الإنترنت، يمكن أن يؤدي ذلك إلى زيادة التوتر والتصاعد في المجتمع. إن استخدام اللغة لتحريض الكراهية يعرض الأفراد والمجتمعات للخطر، ويمكن أن يؤدي إلى أعمال عنف وتمييز. تحمي العديد من الدول حرية التعبير، ولكن يجب أن يكون هذا الحق مصحوبًا بالمسؤولية. يجب على مستخدمي الإنترنت أن يكونوا حذرين ويتجنبوا نشر أو ترويج للخطاب الكراهية. يعتبر التفاعل بشكل إيجابي واحترام الآراء المختلفة أمورًا أساسية في بناء مجتمع رقمي صحي ومتنوع.";

let txt8=" التعامل مع الخطاب الكراهية التعامل مع الخطاب الكراهية يمكن أن يكون تحديًا، ولكن هناك بعض الطرق التي يمكنك اتباعها للتعامل معه بشكل فعال: البقاء هادئًا: حاول أن تظل هادئًا ولا تستجيب بعنف. الرد بعنف قد يؤدي إلى تصاعد الموقف وزيادة التوتر. تجنب التجاوب المباشر: قد يكون من الأفضل تجاهل الخطاب الكراهية أو عدم الرد عليه مباشرة، خاصة إذا كان المرسل يبحث عن رد فعل سلبي. تحديد حدود: إذا كان بالإمكان، قد تحتاج إلى تحديد حدود واضحة مع الأشخاص الذين يروجون للخطاب الكراهي. اترك الشخص يعلم أن هناك خطوطًا لا يجب تجاوزها. البحث عن الدعم: لا تتردد في البحث عن دعم من الأصدقاء والعائلة أو المجتمع الذي تنتمي إليه. قد يكون لديهم نصائح قيمة أو دعم عاطفي يمكن أن يكون مفيدًا. الإبلاغ عن المضايقات: إذا كنت تشعر بأنك تتعرض لمضايقات على وسائل التواصل الاجتماعي أو في أي مكان آخر على الإنترنت، قد تكون هناك خيارات للإبلاغ عن هذا السلوك وطلب المساعدة. ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}

}

function Script8()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" أشكال العنف الإلكتروني تعتبر أشكال العنف الإلكتروني متنوعة وتشمل العديد من الأشكال المختلفة. إليك بعض أشكال العنف الإلكتروني الشائعة: التنميط: التنميط الكلامي : إرسال رسائل عنيفة أو تحقيرية عبر وسائل التواصل الاجتماعي أو المنتديات. التنميط العنصري : استخدام لغة عنصرية أو ترويج للكراهية بناءً على العرق. التحرش الإلكتروني: التحرش الجنسي عبر الإنترنت : متابعة الأفراد عبر الإنترنت بطرق مزعجة أو مخيفة. التحرش الإلكتروني الشخصي: إرسال رسائل تهديد أو مضايقة لشخص معين. الاحتيال والاحتيال الإلكتروني: التصيد الاحتيالي : إرسال رسائل زائفة تدعو الأفراد إلى كشف معلوماتهم الشخصية. التزوير الإلكتروني : تزوير المعلومات لتبدو كأنها من مصدر موثوق به. التشهير والابتزاز: نشر المعلومات الكاذبة: نشر معلومات كاذبة لتشويه سمعة الفرد. الابتزاز الرقمي: محاولة الحصول على مال أو خدمات بوساطة تهديدات إلكترونية. الهجمات السيبرانية: الهجمات الضخمة: توجيه حركة مرور إلكترونية كبيرة إلى خوادم معينة لتعطيلها. الاختراق : اختراق الأنظمة الإلكترونية للوصول إلى المعلومات أو التلاعب بها. التجسس الإلكتروني: اختراق الخصوصية: التجسس على الأفراد أو اختراق خصوصيتهم. التهديد بالعنف الجسدي: التهديد بالعنف عبر الإنترنت: تهديد الأفراد بالعنف عبر وسائل الإنترنت. ";

let txt2=" التعامل مع الدراما الرقمية يمكن أن يشير مصطلح الدراما الرقمية إلى محتوى ترفيهي يتم توفيره عبر الإنترنت، مثل المسلسلات والبرامج التلفزيونية التي يمكن مشاهدتها عبر منصات البث الرقمي. فيما يلي بعض النصائح للتعامل مع الدراما الرقمية: اختيار المنصة: قم باختيار منصة توفر محتوى الدراما الرقمية الذي يهمك.  التخطيط الزمني: قم بتحديد وقت محدد لمشاهدة الدراما الرقمية حتى لا تؤثر على وقتك الحياتي اليومي. مراعاة الحقوق التأليفية: تأكد من أنك تستخدم منصات قانونية لتجنب انتهاك حقوق الملكية الفكرية وتدعيم الصناعة الإبداعية. ";

let txt3=" التنمر الإلكتروني أو الإي-بلاغ هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتنمر على الأفراد أو المجموعات. يمكن أن يظهر التنمر الإلكتروني بأشكال مختلفة، منها: التنمر اللفظي: استخدام اللغة البذيئة أو العدائية عبر الإنترنت لإلحاق الأذى بالأشخاص. التنمر الاجتماعي: تشكيل مجموعات على وسائل التواصل الاجتماعي لاستهداف شخص معين والتنمر عليه. التنمر الإلكتروني الجنسي: إرسال رسائل جنسية غير مرغوب فيها أو مشاركة محتوى جنسي دون إذن. التنمر السيبراني: استخدام التكنولوجيا للتلاعب بالمعلومات أو الاختراق للحاق الضرر. التنمر الاقتصادي: استخدام الوسائل الرقمية للتأثير على الأوضاع الاقتصادية للأفراد أو المؤسسات.  ";

let txt4="آثار التنمر الإلكتروني التنمر الإلكتروني هو نوع من أنواع التنمر يتم عبر وسائل الاتصال الإلكترونية، مثل الإنترنت ووسائل التواصل الاجتماعي. يمكن أن يكون للتنمر الإلكتروني آثار سلبية جسيمة على الأفراد والمجتمعات. إليك بعض الآثار الشائعة للتنمر الإلكتروني: تأثير نفسي: يمكن أن يؤدي التنمر الإلكتروني إلى آثار نفسية خطيرة على الأفراد المتعرضين له. قد يعاني الضحايا من القلق، والاكتئاب، وانخراط في سلوكيات غير صحية نتيجة للتنمر الإلكتروني. تأثير اجتماعي: يمكن أن يؤدي التنمر الإلكتروني إلى الانعزال الاجتماعي وفقدان الثقة بالنفس، حيث يشعر الأفراد بأنهم غير محميين ومعرضين للخطر في بيئة الإنترنت. تأثير التعليم والعمل: يمكن أن يؤثر التنمر الإلكتروني على الأداء الأكاديمي للطلاب والموظفين، حيث يشعرون بصعوبة في التركيز والمشاركة في الأنشطة التعليمية أو العملية. تأثير صحي: يمكن أن يؤدي التنمر الإلكتروني إلى مشاكل صحية في بعض الحالات، مثل الأرق والصداع والتوتر العصبي. تأثير قانوني: في بعض الحالات، يمكن أن يكون للتنمر الإلكتروني عواقب قانونية. يمكن محاسبة المتنمرين الإلكترونيين قانونيًا في بعض الدول على أفعالهم الضارة.";

let txt5=" دوافع التنمر الإلكتروني التنمر الإلكتروني هو استخدام التكنولوجيا الرقمية، مثل الإنترنت ووسائل التواصل الاجتماعي، للتحرش أو التنمر على الأفراد. يمكن أن تكون هناك عدة دوافع للتنمر الإلكتروني، ومن بين هذه الدوافع: التسلية أو التسلية السلبية: قد يقوم بعض الأشخاص بمضايقة الآخرين عبر الإنترنت بسبب فراغهم الوقت أو للمتعة الشخصية، ويرىون أنها طريقة للتسلية على حساب الآخرين. الغضب والانتقام: يمكن أن يكون التنمر الإلكتروني رد فعل على إحساس بالغضب أو الانتقام. يمكن أن يكون هذا ناتجًا عن خلافات شخصية أو تصادم في العلاقات الاجتماعية. الغيرة والتحقير: قد يتم توجيه التنمر الإلكتروني نحو أفراد ذوي شهرة أو نجاح، حيث يمكن أن يكون الغيرة أو الرغبة في التحقير دافعًا للتصرف بشكل سلبي. عدم فهم للآخرين: قد يقوم بعض الأفراد بالتنمر الإلكتروني بسبب عدم فهمهم للتأثير السلبي لأفعالهم على الضحايا، حيث يمكن أن يكونوا غير حساسين لمشاعر الآخرين. التفرغ للإنترنت: بعض الأشخاص الذين يقضون وقتًا طويلاً على الإنترنت قد يلجأون إلى التنمر الإلكتروني كوسيلة لتملأة وقتهم أو لتحقيق الشهرة السريعة دون التفكير في تداولهم للمعلومات السلبية. المشاكل النفسية: قد يكون للمشاكل النفسية لدى الفرد دور في قيامه بأفعال تنمر إلكتروني، حيث يستخدم هذا الفعل كسيل لتفريغ مشاعره السلبية أو الضغط النفسي الذي يواجهه.";

let txt6=" التعامل مع التنمر الإلكتروني  التنمر الإلكتروني هو استخدام التكنولوجيا للتحرش أو التضييق الإلكتروني للأفراد أو المجموعات. يمكن أن يكون التنمر الإلكتروني عبر وسائل التواصل الاجتماعي، البريد الإلكتروني، الرسائل النصية، أو أي وسائل أخرى عبر الإنترنت. إذا كنت تواجه التنمر الإلكتروني، فإليك بعض الخطوات التي يمكنك اتخاذها للتعامل مع هذا الوضع: الابتعاد وعدم الاستجابة: قد يكون الرد على التنمر إشارة للمتنمرين بأنك تستجيب وتعتبر ذلك مهمًا. حاول تجاهل التنمر وعدم الاستجابة لتقليل فعالية المتنمرين. الإبلاغ: في حالة التنمر عبر منصات معينة، يفضل الإبلاغ عن المشكلة إلى الجهة المسؤولة. معظم المنصات لديها آليات للإبلاغ عن المضايقات والتنمر. حظر المتنمرين: قم بحظر الأشخاص الذين يقومون بالتنمر عليك عبر وسائل التواصل الاجتماعي أو أي وسائل أخرى. هذا يقلل من فرصهم للوصول إليك. الحفاظ على الأدلة: احتفظ بنسخ من جميع الرسائل أو المحتوى المسيء كدليل، حيث قد تكون هذه الأدلة مفيدة في حالة اللجوء إلى القانون. التحدث مع الأشخاص المختصين: إذا كنت تعتقد أن الموضوع قد تجاوز حدود التنمر الإلكتروني البسيط، فقد يكون من المفيد التحدث مع أصدقائك أو أفراد العائلة أو المعلمين أو المسؤولين في مؤسستك للحصول على الدعم والمساعدة. التوجه للسلطات: في حال استمرار التنمر وتدهور الوضع، قد تحتاج إلى اللجوء للسلطات المختصة. يجب عليك التوجه للشرطة أو الجهات القانونية للحصول على المساعدة. العناية بالصحة النفسية: قد يكون التنمر الإلكتروني مؤثرًا على الصحة النفسية. لا تتردد في البحث عن الدعم النفسي إذا كنت بحاجة إليه. ";

let txt7=" خطاب الكراهية عبر الإنترنت  يشكل تهديدًا خطيرًا للمجتمع والتواصل السلمي عبر العالم الرقمي. الخطاب الكراهية يمكن أن يكون أي نوع من التعبيرات التي تشجع على التمييز أو العنف ضد فئة معينة من الناس بناءً على عوامل مثل العرق، الدين، الجنس، الجنسية، الهوية الجندرية، أو أي سمة أخرى. تؤثر الكلمات بشكل كبير على آراء الأفراد وسلوكهم، وعندما يتم نشر خطاب الكراهية عبر الإنترنت، يمكن أن يؤدي ذلك إلى زيادة التوتر والتصاعد في المجتمع. إن استخدام اللغة لتحريض الكراهية يعرض الأفراد والمجتمعات للخطر، ويمكن أن يؤدي إلى أعمال عنف وتمييز. تحمي العديد من الدول حرية التعبير، ولكن يجب أن يكون هذا الحق مصحوبًا بالمسؤولية. يجب على مستخدمي الإنترنت أن يكونوا حذرين ويتجنبوا نشر أو ترويج للخطاب الكراهية. يعتبر التفاعل بشكل إيجابي واحترام الآراء المختلفة أمورًا أساسية في بناء مجتمع رقمي صحي ومتنوع.";

let txt8=" التعامل مع الخطاب الكراهية التعامل مع الخطاب الكراهية يمكن أن يكون تحديًا، ولكن هناك بعض الطرق التي يمكنك اتباعها للتعامل معه بشكل فعال: البقاء هادئًا: حاول أن تظل هادئًا ولا تستجيب بعنف. الرد بعنف قد يؤدي إلى تصاعد الموقف وزيادة التوتر. تجنب التجاوب المباشر: قد يكون من الأفضل تجاهل الخطاب الكراهية أو عدم الرد عليه مباشرة، خاصة إذا كان المرسل يبحث عن رد فعل سلبي. تحديد حدود: إذا كان بالإمكان، قد تحتاج إلى تحديد حدود واضحة مع الأشخاص الذين يروجون للخطاب الكراهي. اترك الشخص يعلم أن هناك خطوطًا لا يجب تجاوزها. البحث عن الدعم: لا تتردد في البحث عن دعم من الأصدقاء والعائلة أو المجتمع الذي تنتمي إليه. قد يكون لديهم نصائح قيمة أو دعم عاطفي يمكن أن يكون مفيدًا. الإبلاغ عن المضايقات: إذا كنت تشعر بأنك تتعرض لمضايقات على وسائل التواصل الاجتماعي أو في أي مكان آخر على الإنترنت، قد تكون هناك خيارات للإبلاغ عن هذا السلوك وطلب المساعدة. ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7,txt8];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}

}

