function ExecuteScript(strId)
{
  switch (strId)
  {
      case "5nxoTeHdoJO":
        Script1();
        break;
      case "6dgMGYBLmn0":
        Script2();
        break;
      case "60Biv22ZUbb":
        Script3();
        break;
      case "6bqOLMJAKPU":
        Script4();
        break;
      case "5yr0ze7snh6":
        Script5();
        break;
      case "6mkVHf31lag":
        Script6();
        break;
  }
}

function Script1()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" الإدمان الرقمي : الإدمان الرقمي يشير إلى الاعتماد الشديد على التكنولوجيا الرقمية ووسائل الإعلام الاجتماعية بشكل يؤثر سلبًا على الحياة اليومية والصحة النفسية للفرد. يتعلق الأمر بتكرار استخدام وسائل الإعلام الرقمية بشكل مفرط، مما يؤدي إلى إدمان نفسي يمكن أن يؤثر على القدرة على القيام بالواجبات اليومية والتفاعل مع البيئة الاجتماعية. يمكن أن يظهر الإدمان الرقمي في عدة مجالات، مثل الألعاب الرقمية، وسائل التواصل الاجتماعي، مشاهدة الفيديوهات عبر الإنترنت، واستخدام الهواتف الذكية بشكل مكثف. الأفراد الذين يعانون من إدمان رقمي قد يجدون صعوبة في التحكم في وقتهم الذي يقضونه أمام الشاشات، ويمكن أن يتجاهلوا التزاماتهم اليومية وحتى صحتهم الشخصية. تتضمن أعراض الإدمان الرقمي عدم القدرة على التوقف عن استخدام الوسائل الرقمية، والشعور بالقلق أو الاكتئاب عندما يتم منع الوصول إليها، وتأثير سلبي على العلاقات الاجتماعية والأداء الوظيفي. يعتبر الوعي بمشكلة الإدمان الرقمي وتطوير استراتيجيات صحية لاستخدام التكنولوجيا أمورًا هامة للحفاظ على التوازن في الحياة اليومية.";

let txt2=" أعراض الإدمان الرقمي السلوكية: الإدمان الرقمي السلوكي يشير إلى الإدمان على الاستخدام الزائد للتكنولوجيا الرقمية والوسائل الإلكترونية مثل الهواتف الذكية، وسائل التواصل الاجتماعي، والألعاب الإلكترونية، والإنترنت بشكل عام. قد تظهر عدة أعراض تشير إلى وجود إدمان رقمي سلوكي، ومن هذه الأعراض:  فقدان السيطرة: عدم القدرة على التحكم في كمية الوقت المستهلك عبر الوسائل الرقمية، حيث يصبح الشخص مفتونًا بها وصعب التوقف عن استخدامها. زيادة الاستخدام: زيادة تدريجية في مدة الاستخدام، حيث يقضي الفرد أوقاتًا أطول على الأجهزة الرقمية دون أن يشعر بالرضا أو الاستفادة الحقيقية. الانعزال الاجتماعي: قد يتسبب الإدمان الرقمي في انعزال الشخص عن العلاقات الاجتماعية الحقيقية، حيث يفضل قضاء وقت أكبر على الإنترنت بدلاً من التفاعل الواقعي مع الأصدقاء والعائلة. تأثير سلبي على الصحة النفسية: قد يتسبب الإدمان في زيادة مستويات التوتر والقلق، وتقليل النوم الجيد، وزيادة مشاكل الصحة النفسية مثل الاكتئاب. تهميش الالتزامات اليومية: قد يتسبب الاستخدام المفرط في التكنولوجيا في تهميش الالتزامات اليومية، مثل العمل أو الدراسة، مما يؤدي إلى تأثير سلبي على الأداء الوظيفي أو الأكاديمي. تغير في السلوك الشخصي: يمكن أن يؤدي الإدمان الرقمي إلى تغير في سلوك الشخص، مثل التهرب من المسؤوليات، أو التجاهل للهموم والأولويات الحقيقية. التحفيز الدائم للتفاعل الرقمي: الحاجة المستمرة إلى التفاعل مع الأجهزة الرقمية، حتى عندما تكون النشاطات غير مجدية أو مكررة.";

let txt3=" أعراض الإدمان الرقمي الصحية والاجتماعية : الإدمان الرقمي يمكن أن يؤثر سلباً على الصحة الجسدية والنفسية، فضلاً عن التأثيرات الاجتماعية. إليك بعض الأعراض التي قد تظهر عند الإصابة بالإدمان الرقمي: الأعراض الصحية: قلة النوم: الإفراط في استخدام الأجهزة الرقمية قبل النوم يمكن أن يؤثر على نوعية النوم ويؤدي إلى قلة النوم. تقلبات في الوزن: قد يؤدي الجلوس المطول أمام الشاشات إلى نقص النشاط البدني، مما يزيد من خطر زيادة الوزن. توتر العيون: الاستخدام المفرط للشاشات قد يسبب توترًا في العيون وقد يسهم في تطور مشاكل بصرية. ألم في الظهر والرقبة: الجلوس لفترات طويلة أمام الأجهزة الرقمية يمكن أن يسبب ألما في الظهر والرقبة.الأعراض النفسية: قلق واكتئاب: قد يؤدي الإدمان الرقمي إلى انعزال اجتماعي وزيادة مستويات القلق والاكتئاب. فقدان التركيز: الاستخدام المفرط للهواتف الذكية ووسائل التواصل الاجتماعي قد يؤثر على قدرة الشخص على التركيز والانتباه. تقلبات المزاج: الاعتماد الشديد على الوسائل الرقمية يمكن أن يسبب تقلبات في المزاج وزيادة في التوتر النفسي. فقدان الاهتمام بالأنشطة الاجتماعية: يمكن أن يؤدي الانغماس في عالم الإنترنت إلى إهمال العلاقات الاجتماعية الحقيقية والأنشطة الاجتماعية. الأعراض الاجتماعية: انعزال اجتماعي: يمكن أن يؤدي الإدمان الرقمي إلى انعزال الشخص وانقطاعه عن العلاقات الاجتماعية الحقيقية. ضعف الأداء الوظيفي: قد يؤثر الاعتماد الشديد على الأجهزة الرقمية على أداء الشخص في العمل أو الدراسة. تأثير على العلاقات العائلية: يمكن أن يؤدي الإهمال الزمني للأسرة بسبب الاستخدام المفرط للأجهزة الرقمية إلى تدهور العلاقات العائلية. الإهمال الاجتماعي: قد يؤدي الفقدان للاهتمام بالأنشطة الاجتماعية الحقيقية إلى الإهمال الاجتماعي والتبديل إلى العلاقات الافتراضية. ";

let txt4="أسباب الإدمان الرقمي هناك العديد من الأسباب التي قد تؤدي إلى الإدمان الرقمي، وتتنوع هذه الأسباب حسب الفرد والسياق. من بين الأسباب الشائعة: تأثير وسائل التواصل الاجتماعي: قد تكون وسائل التواصل الاجتماعي مصدرًا للتفاعل الاجتماعي والانتماء، ولكن في بعض الحالات، يمكن أن يؤدي الاستخدام المفرط إلى الإدمان نتيجة لرغبة الفرد في الحصول على تفاعل وتأكيد اجتماعي. ألعاب الفيديو: يمكن أن تكون الألعاب الرقمية تحفيزية للعب الأدوار والتحديات، ولكن الاستمرار في اللعب لفترات طويلة قد يؤدي إلى الإدمان، خاصة إذا كانت تقدم تحفيزًا دائمًا من خلال نظم الجوائز والتقدير. توفر المحتوى الرقمي: مع توسع الإنترنت، أصبح المحتوى الرقمي متاحًا بشكل كبير، ويمكن للأفراد أن يقضوا ساعات طويلة في استهلاك المحتوى عبر الإنترنت، سواء كان ذلك مقاطع الفيديو، الأخبار، المقالات، أو أي نوع آخر من المحتوى. الهروب الرقمي: يمكن للعالم الرقمي أن يكون وسيلة للهروب من الواقع، وبالتالي يمكن للأفراد اللجوء إليه لتجنب التحديات أو المشاكل الحقيقية في حياتهم. تأثير الهواتف الذكية: استخدام الهواتف الذكية بشكل متكرر يمكن أن يسهم في الإدمان، خاصة عند استخدام التطبيقات والخدمات التي تصمم بشكل متعمد لجعلها جذابة ومثيرة للاهتمام. الاعتماد الشديد على التكنولوجيا: في حالات أخرى، قد يكون الإدمان الرقمي نتيجة للاعتماد الكبير على التكنولوجيا في مجالات مثل العمل، الدراسة، أو الترفيه.  ";

let txt5="الصحة والاتزان الرقمي الصحة العامة والاتزان الرقمي هما مجالان مهمان يتعلقان بالرفاهية الشاملة للفرد، ويمكن أن يكون للتكنولوجيا والوسائل الرقمية دور كبير في تحسين هذين الجانبين. إليك بعض النقاط حول الصحة والاتزان الرقمي: الصحة: تكنولوجيا الصحة: استخدام التكنولوجيا في تحسين رعاية المرضى وتشخيص الأمراض. تطبيقات الصحة الرقمية والأجهزة القابلة للارتداء تعزز من متابعة الصحة الشخصية. صحة الإنترنت: الاستفادة من الإنترنت لتقديم خدمات الرعاية عن بُعد. تطوير منصات الاستشارات الطبية عبر الإنترنت والتطبيقات الصحية. الصحة النفسية الرقمية: تقديم خدمات الدعم النفسي عبر الإنترنت وتطبيقات الصحة النفسية. استخدام التكنولوجيا لتحسين التوعية حول الصحة النفسية.   ";

let txt6="الاتزان الرقمي: إدارة الوقت: تحسين فهم الفرد لكيفية استخدام وقته عبر تطبيقات إدارة الوقت الرقمي. الاستخدام الصحي لوسائل التواصل الاجتماعي: توعية حول تأثير وسائل التواصل الاجتماعي على الصحة النفسية وتعزيز استخدامها الإيجابي. توازن الحياة الرقمية والحياة الواقعية: تشجيع على فصل الوقت بين الأنشطة الرقمية والنشاطات الواقعية. تنمية الوعي حول أهمية التوازن في حياة الفرد. السلامة الرقمية: تعزيز السلوكيات الآمنة عبر الإنترنت والوقاية من التحديات الأمنية الرقمية. تطوير المهارات الرقمية: تشجيع على تطوير المهارات الرقمية الإيجابية والإبداعية.  ";

let txt7="الطرائق والحلول المساعدة على تحقيق الاتزان الرقمي تحقيق الاتزان الرقمي يعني القدرة على استخدام التكنولوجيا بشكل فعّال ومتوازن لتحسين الحياة الشخصية والمهنية. فيما يلي بعض الطرائق والحلول التي قد تساعدك في تحقيق الاتزان الرقمي: تحديد الأهداف الرقمية: حدد أهدافًا واقعية وملموسة لاستخدام التكنولوجيا في حياتك اليومية. قم بتحديد أهداف قصيرة الأمد وطويلة الأمد لتحقيق توازن بين النجاح الفوري والرؤية الطويلة المدى. تنظيم الوقت: استخدم تقنيات إدارة الوقت لتحسين إنتاجيتك وتخصيص وقت لأنشطتك الرقمية. قم بتحديد فترات زمنية لاستخدام وسائل التواصل الاجتماعي والبريد الإلكتروني بدقة. اعتماد تقنيات الاستراحة: قم بتحديد فترات للاستراحة وابتعد عن الأجهزة الرقمية خلالها لتجنب التشتت الرقمي والتعب. اعتمد تقنيات الاستراحة والتأمل لتحسين التوازن العقلي. تحديد حدود الاتصال الرقمي: حدد حدودًا لاستخدام وسائل التواصل الاجتماعي والتكنولوجيا في محيطك الشخصي والمهني. تجنب البقاء متصلًا على مدار الساعة والسماح بفترات منعزلة. تنمية مهارات الاستخدام الذكي للتكنولوجيا: اتعلم كيفية استخدام التكنولوجيا بشكل فعال لتحسين إنتاجيتك وحل المشاكل. استفد من تطبيقات إدارة المهام وتنظيم الأنشطة اليومية. التواصل الفعّال: قم بالتواصل مع الأصدقاء والعائلة بشكل واقعي وليس فقط عبر وسائل التواصل الاجتماعي. اختبر الاستمتاع بلحظات الحياة دون التسارع إلى التقاط صور أو مشاركتها على الفور. تحديث المهارات الرقمية: كن على اطلاع بأحدث التقنيات والأدوات التي تساعد في تسهيل حياتك اليومية. قم بتحديث مهاراتك الرقمية بشكل دوري لتكون على مواكبة التطورات التكنولوجية. اعتماد سياسات الأمان الرقمي: اتخذ إجراءات أمان رقمية لحماية بياناتك الشخصية والحفاظ على خصوصيتك. كن حذرًا أثناء التفاعل عبر الإنترنت وتجنب مشاركة معلومات حساسة بشكل عشوائي.  ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}



}

function Script2()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" الإدمان الرقمي : الإدمان الرقمي يشير إلى الاعتماد الشديد على التكنولوجيا الرقمية ووسائل الإعلام الاجتماعية بشكل يؤثر سلبًا على الحياة اليومية والصحة النفسية للفرد. يتعلق الأمر بتكرار استخدام وسائل الإعلام الرقمية بشكل مفرط، مما يؤدي إلى إدمان نفسي يمكن أن يؤثر على القدرة على القيام بالواجبات اليومية والتفاعل مع البيئة الاجتماعية. يمكن أن يظهر الإدمان الرقمي في عدة مجالات، مثل الألعاب الرقمية، وسائل التواصل الاجتماعي، مشاهدة الفيديوهات عبر الإنترنت، واستخدام الهواتف الذكية بشكل مكثف. الأفراد الذين يعانون من إدمان رقمي قد يجدون صعوبة في التحكم في وقتهم الذي يقضونه أمام الشاشات، ويمكن أن يتجاهلوا التزاماتهم اليومية وحتى صحتهم الشخصية. تتضمن أعراض الإدمان الرقمي عدم القدرة على التوقف عن استخدام الوسائل الرقمية، والشعور بالقلق أو الاكتئاب عندما يتم منع الوصول إليها، وتأثير سلبي على العلاقات الاجتماعية والأداء الوظيفي. يعتبر الوعي بمشكلة الإدمان الرقمي وتطوير استراتيجيات صحية لاستخدام التكنولوجيا أمورًا هامة للحفاظ على التوازن في الحياة اليومية.";

let txt2=" أعراض الإدمان الرقمي السلوكية: الإدمان الرقمي السلوكي يشير إلى الإدمان على الاستخدام الزائد للتكنولوجيا الرقمية والوسائل الإلكترونية مثل الهواتف الذكية، وسائل التواصل الاجتماعي، والألعاب الإلكترونية، والإنترنت بشكل عام. قد تظهر عدة أعراض تشير إلى وجود إدمان رقمي سلوكي، ومن هذه الأعراض:  فقدان السيطرة: عدم القدرة على التحكم في كمية الوقت المستهلك عبر الوسائل الرقمية، حيث يصبح الشخص مفتونًا بها وصعب التوقف عن استخدامها. زيادة الاستخدام: زيادة تدريجية في مدة الاستخدام، حيث يقضي الفرد أوقاتًا أطول على الأجهزة الرقمية دون أن يشعر بالرضا أو الاستفادة الحقيقية. الانعزال الاجتماعي: قد يتسبب الإدمان الرقمي في انعزال الشخص عن العلاقات الاجتماعية الحقيقية، حيث يفضل قضاء وقت أكبر على الإنترنت بدلاً من التفاعل الواقعي مع الأصدقاء والعائلة. تأثير سلبي على الصحة النفسية: قد يتسبب الإدمان في زيادة مستويات التوتر والقلق، وتقليل النوم الجيد، وزيادة مشاكل الصحة النفسية مثل الاكتئاب. تهميش الالتزامات اليومية: قد يتسبب الاستخدام المفرط في التكنولوجيا في تهميش الالتزامات اليومية، مثل العمل أو الدراسة، مما يؤدي إلى تأثير سلبي على الأداء الوظيفي أو الأكاديمي. تغير في السلوك الشخصي: يمكن أن يؤدي الإدمان الرقمي إلى تغير في سلوك الشخص، مثل التهرب من المسؤوليات، أو التجاهل للهموم والأولويات الحقيقية. التحفيز الدائم للتفاعل الرقمي: الحاجة المستمرة إلى التفاعل مع الأجهزة الرقمية، حتى عندما تكون النشاطات غير مجدية أو مكررة.";

let txt3=" أعراض الإدمان الرقمي الصحية والاجتماعية : الإدمان الرقمي يمكن أن يؤثر سلباً على الصحة الجسدية والنفسية، فضلاً عن التأثيرات الاجتماعية. إليك بعض الأعراض التي قد تظهر عند الإصابة بالإدمان الرقمي: الأعراض الصحية: قلة النوم: الإفراط في استخدام الأجهزة الرقمية قبل النوم يمكن أن يؤثر على نوعية النوم ويؤدي إلى قلة النوم. تقلبات في الوزن: قد يؤدي الجلوس المطول أمام الشاشات إلى نقص النشاط البدني، مما يزيد من خطر زيادة الوزن. توتر العيون: الاستخدام المفرط للشاشات قد يسبب توترًا في العيون وقد يسهم في تطور مشاكل بصرية. ألم في الظهر والرقبة: الجلوس لفترات طويلة أمام الأجهزة الرقمية يمكن أن يسبب ألما في الظهر والرقبة.الأعراض النفسية: قلق واكتئاب: قد يؤدي الإدمان الرقمي إلى انعزال اجتماعي وزيادة مستويات القلق والاكتئاب. فقدان التركيز: الاستخدام المفرط للهواتف الذكية ووسائل التواصل الاجتماعي قد يؤثر على قدرة الشخص على التركيز والانتباه. تقلبات المزاج: الاعتماد الشديد على الوسائل الرقمية يمكن أن يسبب تقلبات في المزاج وزيادة في التوتر النفسي. فقدان الاهتمام بالأنشطة الاجتماعية: يمكن أن يؤدي الانغماس في عالم الإنترنت إلى إهمال العلاقات الاجتماعية الحقيقية والأنشطة الاجتماعية. الأعراض الاجتماعية: انعزال اجتماعي: يمكن أن يؤدي الإدمان الرقمي إلى انعزال الشخص وانقطاعه عن العلاقات الاجتماعية الحقيقية. ضعف الأداء الوظيفي: قد يؤثر الاعتماد الشديد على الأجهزة الرقمية على أداء الشخص في العمل أو الدراسة. تأثير على العلاقات العائلية: يمكن أن يؤدي الإهمال الزمني للأسرة بسبب الاستخدام المفرط للأجهزة الرقمية إلى تدهور العلاقات العائلية. الإهمال الاجتماعي: قد يؤدي الفقدان للاهتمام بالأنشطة الاجتماعية الحقيقية إلى الإهمال الاجتماعي والتبديل إلى العلاقات الافتراضية. ";

let txt4="أسباب الإدمان الرقمي هناك العديد من الأسباب التي قد تؤدي إلى الإدمان الرقمي، وتتنوع هذه الأسباب حسب الفرد والسياق. من بين الأسباب الشائعة: تأثير وسائل التواصل الاجتماعي: قد تكون وسائل التواصل الاجتماعي مصدرًا للتفاعل الاجتماعي والانتماء، ولكن في بعض الحالات، يمكن أن يؤدي الاستخدام المفرط إلى الإدمان نتيجة لرغبة الفرد في الحصول على تفاعل وتأكيد اجتماعي. ألعاب الفيديو: يمكن أن تكون الألعاب الرقمية تحفيزية للعب الأدوار والتحديات، ولكن الاستمرار في اللعب لفترات طويلة قد يؤدي إلى الإدمان، خاصة إذا كانت تقدم تحفيزًا دائمًا من خلال نظم الجوائز والتقدير. توفر المحتوى الرقمي: مع توسع الإنترنت، أصبح المحتوى الرقمي متاحًا بشكل كبير، ويمكن للأفراد أن يقضوا ساعات طويلة في استهلاك المحتوى عبر الإنترنت، سواء كان ذلك مقاطع الفيديو، الأخبار، المقالات، أو أي نوع آخر من المحتوى. الهروب الرقمي: يمكن للعالم الرقمي أن يكون وسيلة للهروب من الواقع، وبالتالي يمكن للأفراد اللجوء إليه لتجنب التحديات أو المشاكل الحقيقية في حياتهم. تأثير الهواتف الذكية: استخدام الهواتف الذكية بشكل متكرر يمكن أن يسهم في الإدمان، خاصة عند استخدام التطبيقات والخدمات التي تصمم بشكل متعمد لجعلها جذابة ومثيرة للاهتمام. الاعتماد الشديد على التكنولوجيا: في حالات أخرى، قد يكون الإدمان الرقمي نتيجة للاعتماد الكبير على التكنولوجيا في مجالات مثل العمل، الدراسة، أو الترفيه.  ";

let txt5="الصحة والاتزان الرقمي الصحة العامة والاتزان الرقمي هما مجالان مهمان يتعلقان بالرفاهية الشاملة للفرد، ويمكن أن يكون للتكنولوجيا والوسائل الرقمية دور كبير في تحسين هذين الجانبين. إليك بعض النقاط حول الصحة والاتزان الرقمي: الصحة: تكنولوجيا الصحة: استخدام التكنولوجيا في تحسين رعاية المرضى وتشخيص الأمراض. تطبيقات الصحة الرقمية والأجهزة القابلة للارتداء تعزز من متابعة الصحة الشخصية. صحة الإنترنت: الاستفادة من الإنترنت لتقديم خدمات الرعاية عن بُعد. تطوير منصات الاستشارات الطبية عبر الإنترنت والتطبيقات الصحية. الصحة النفسية الرقمية: تقديم خدمات الدعم النفسي عبر الإنترنت وتطبيقات الصحة النفسية. استخدام التكنولوجيا لتحسين التوعية حول الصحة النفسية.   ";

let txt6="الاتزان الرقمي: إدارة الوقت: تحسين فهم الفرد لكيفية استخدام وقته عبر تطبيقات إدارة الوقت الرقمي. الاستخدام الصحي لوسائل التواصل الاجتماعي: توعية حول تأثير وسائل التواصل الاجتماعي على الصحة النفسية وتعزيز استخدامها الإيجابي. توازن الحياة الرقمية والحياة الواقعية: تشجيع على فصل الوقت بين الأنشطة الرقمية والنشاطات الواقعية. تنمية الوعي حول أهمية التوازن في حياة الفرد. السلامة الرقمية: تعزيز السلوكيات الآمنة عبر الإنترنت والوقاية من التحديات الأمنية الرقمية. تطوير المهارات الرقمية: تشجيع على تطوير المهارات الرقمية الإيجابية والإبداعية.  ";

let txt7="الطرائق والحلول المساعدة على تحقيق الاتزان الرقمي تحقيق الاتزان الرقمي يعني القدرة على استخدام التكنولوجيا بشكل فعّال ومتوازن لتحسين الحياة الشخصية والمهنية. فيما يلي بعض الطرائق والحلول التي قد تساعدك في تحقيق الاتزان الرقمي: تحديد الأهداف الرقمية: حدد أهدافًا واقعية وملموسة لاستخدام التكنولوجيا في حياتك اليومية. قم بتحديد أهداف قصيرة الأمد وطويلة الأمد لتحقيق توازن بين النجاح الفوري والرؤية الطويلة المدى. تنظيم الوقت: استخدم تقنيات إدارة الوقت لتحسين إنتاجيتك وتخصيص وقت لأنشطتك الرقمية. قم بتحديد فترات زمنية لاستخدام وسائل التواصل الاجتماعي والبريد الإلكتروني بدقة. اعتماد تقنيات الاستراحة: قم بتحديد فترات للاستراحة وابتعد عن الأجهزة الرقمية خلالها لتجنب التشتت الرقمي والتعب. اعتمد تقنيات الاستراحة والتأمل لتحسين التوازن العقلي. تحديد حدود الاتصال الرقمي: حدد حدودًا لاستخدام وسائل التواصل الاجتماعي والتكنولوجيا في محيطك الشخصي والمهني. تجنب البقاء متصلًا على مدار الساعة والسماح بفترات منعزلة. تنمية مهارات الاستخدام الذكي للتكنولوجيا: اتعلم كيفية استخدام التكنولوجيا بشكل فعال لتحسين إنتاجيتك وحل المشاكل. استفد من تطبيقات إدارة المهام وتنظيم الأنشطة اليومية. التواصل الفعّال: قم بالتواصل مع الأصدقاء والعائلة بشكل واقعي وليس فقط عبر وسائل التواصل الاجتماعي. اختبر الاستمتاع بلحظات الحياة دون التسارع إلى التقاط صور أو مشاركتها على الفور. تحديث المهارات الرقمية: كن على اطلاع بأحدث التقنيات والأدوات التي تساعد في تسهيل حياتك اليومية. قم بتحديث مهاراتك الرقمية بشكل دوري لتكون على مواكبة التطورات التكنولوجية. اعتماد سياسات الأمان الرقمي: اتخذ إجراءات أمان رقمية لحماية بياناتك الشخصية والحفاظ على خصوصيتك. كن حذرًا أثناء التفاعل عبر الإنترنت وتجنب مشاركة معلومات حساسة بشكل عشوائي.  ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}



}

function Script3()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" الإدمان الرقمي : الإدمان الرقمي يشير إلى الاعتماد الشديد على التكنولوجيا الرقمية ووسائل الإعلام الاجتماعية بشكل يؤثر سلبًا على الحياة اليومية والصحة النفسية للفرد. يتعلق الأمر بتكرار استخدام وسائل الإعلام الرقمية بشكل مفرط، مما يؤدي إلى إدمان نفسي يمكن أن يؤثر على القدرة على القيام بالواجبات اليومية والتفاعل مع البيئة الاجتماعية. يمكن أن يظهر الإدمان الرقمي في عدة مجالات، مثل الألعاب الرقمية، وسائل التواصل الاجتماعي، مشاهدة الفيديوهات عبر الإنترنت، واستخدام الهواتف الذكية بشكل مكثف. الأفراد الذين يعانون من إدمان رقمي قد يجدون صعوبة في التحكم في وقتهم الذي يقضونه أمام الشاشات، ويمكن أن يتجاهلوا التزاماتهم اليومية وحتى صحتهم الشخصية. تتضمن أعراض الإدمان الرقمي عدم القدرة على التوقف عن استخدام الوسائل الرقمية، والشعور بالقلق أو الاكتئاب عندما يتم منع الوصول إليها، وتأثير سلبي على العلاقات الاجتماعية والأداء الوظيفي. يعتبر الوعي بمشكلة الإدمان الرقمي وتطوير استراتيجيات صحية لاستخدام التكنولوجيا أمورًا هامة للحفاظ على التوازن في الحياة اليومية.";

let txt2=" أعراض الإدمان الرقمي السلوكية: الإدمان الرقمي السلوكي يشير إلى الإدمان على الاستخدام الزائد للتكنولوجيا الرقمية والوسائل الإلكترونية مثل الهواتف الذكية، وسائل التواصل الاجتماعي، والألعاب الإلكترونية، والإنترنت بشكل عام. قد تظهر عدة أعراض تشير إلى وجود إدمان رقمي سلوكي، ومن هذه الأعراض:  فقدان السيطرة: عدم القدرة على التحكم في كمية الوقت المستهلك عبر الوسائل الرقمية، حيث يصبح الشخص مفتونًا بها وصعب التوقف عن استخدامها. زيادة الاستخدام: زيادة تدريجية في مدة الاستخدام، حيث يقضي الفرد أوقاتًا أطول على الأجهزة الرقمية دون أن يشعر بالرضا أو الاستفادة الحقيقية. الانعزال الاجتماعي: قد يتسبب الإدمان الرقمي في انعزال الشخص عن العلاقات الاجتماعية الحقيقية، حيث يفضل قضاء وقت أكبر على الإنترنت بدلاً من التفاعل الواقعي مع الأصدقاء والعائلة. تأثير سلبي على الصحة النفسية: قد يتسبب الإدمان في زيادة مستويات التوتر والقلق، وتقليل النوم الجيد، وزيادة مشاكل الصحة النفسية مثل الاكتئاب. تهميش الالتزامات اليومية: قد يتسبب الاستخدام المفرط في التكنولوجيا في تهميش الالتزامات اليومية، مثل العمل أو الدراسة، مما يؤدي إلى تأثير سلبي على الأداء الوظيفي أو الأكاديمي. تغير في السلوك الشخصي: يمكن أن يؤدي الإدمان الرقمي إلى تغير في سلوك الشخص، مثل التهرب من المسؤوليات، أو التجاهل للهموم والأولويات الحقيقية. التحفيز الدائم للتفاعل الرقمي: الحاجة المستمرة إلى التفاعل مع الأجهزة الرقمية، حتى عندما تكون النشاطات غير مجدية أو مكررة.";

let txt3=" أعراض الإدمان الرقمي الصحية والاجتماعية : الإدمان الرقمي يمكن أن يؤثر سلباً على الصحة الجسدية والنفسية، فضلاً عن التأثيرات الاجتماعية. إليك بعض الأعراض التي قد تظهر عند الإصابة بالإدمان الرقمي: الأعراض الصحية: قلة النوم: الإفراط في استخدام الأجهزة الرقمية قبل النوم يمكن أن يؤثر على نوعية النوم ويؤدي إلى قلة النوم. تقلبات في الوزن: قد يؤدي الجلوس المطول أمام الشاشات إلى نقص النشاط البدني، مما يزيد من خطر زيادة الوزن. توتر العيون: الاستخدام المفرط للشاشات قد يسبب توترًا في العيون وقد يسهم في تطور مشاكل بصرية. ألم في الظهر والرقبة: الجلوس لفترات طويلة أمام الأجهزة الرقمية يمكن أن يسبب ألما في الظهر والرقبة.الأعراض النفسية: قلق واكتئاب: قد يؤدي الإدمان الرقمي إلى انعزال اجتماعي وزيادة مستويات القلق والاكتئاب. فقدان التركيز: الاستخدام المفرط للهواتف الذكية ووسائل التواصل الاجتماعي قد يؤثر على قدرة الشخص على التركيز والانتباه. تقلبات المزاج: الاعتماد الشديد على الوسائل الرقمية يمكن أن يسبب تقلبات في المزاج وزيادة في التوتر النفسي. فقدان الاهتمام بالأنشطة الاجتماعية: يمكن أن يؤدي الانغماس في عالم الإنترنت إلى إهمال العلاقات الاجتماعية الحقيقية والأنشطة الاجتماعية. الأعراض الاجتماعية: انعزال اجتماعي: يمكن أن يؤدي الإدمان الرقمي إلى انعزال الشخص وانقطاعه عن العلاقات الاجتماعية الحقيقية. ضعف الأداء الوظيفي: قد يؤثر الاعتماد الشديد على الأجهزة الرقمية على أداء الشخص في العمل أو الدراسة. تأثير على العلاقات العائلية: يمكن أن يؤدي الإهمال الزمني للأسرة بسبب الاستخدام المفرط للأجهزة الرقمية إلى تدهور العلاقات العائلية. الإهمال الاجتماعي: قد يؤدي الفقدان للاهتمام بالأنشطة الاجتماعية الحقيقية إلى الإهمال الاجتماعي والتبديل إلى العلاقات الافتراضية. ";

let txt4="أسباب الإدمان الرقمي هناك العديد من الأسباب التي قد تؤدي إلى الإدمان الرقمي، وتتنوع هذه الأسباب حسب الفرد والسياق. من بين الأسباب الشائعة: تأثير وسائل التواصل الاجتماعي: قد تكون وسائل التواصل الاجتماعي مصدرًا للتفاعل الاجتماعي والانتماء، ولكن في بعض الحالات، يمكن أن يؤدي الاستخدام المفرط إلى الإدمان نتيجة لرغبة الفرد في الحصول على تفاعل وتأكيد اجتماعي. ألعاب الفيديو: يمكن أن تكون الألعاب الرقمية تحفيزية للعب الأدوار والتحديات، ولكن الاستمرار في اللعب لفترات طويلة قد يؤدي إلى الإدمان، خاصة إذا كانت تقدم تحفيزًا دائمًا من خلال نظم الجوائز والتقدير. توفر المحتوى الرقمي: مع توسع الإنترنت، أصبح المحتوى الرقمي متاحًا بشكل كبير، ويمكن للأفراد أن يقضوا ساعات طويلة في استهلاك المحتوى عبر الإنترنت، سواء كان ذلك مقاطع الفيديو، الأخبار، المقالات، أو أي نوع آخر من المحتوى. الهروب الرقمي: يمكن للعالم الرقمي أن يكون وسيلة للهروب من الواقع، وبالتالي يمكن للأفراد اللجوء إليه لتجنب التحديات أو المشاكل الحقيقية في حياتهم. تأثير الهواتف الذكية: استخدام الهواتف الذكية بشكل متكرر يمكن أن يسهم في الإدمان، خاصة عند استخدام التطبيقات والخدمات التي تصمم بشكل متعمد لجعلها جذابة ومثيرة للاهتمام. الاعتماد الشديد على التكنولوجيا: في حالات أخرى، قد يكون الإدمان الرقمي نتيجة للاعتماد الكبير على التكنولوجيا في مجالات مثل العمل، الدراسة، أو الترفيه.  ";

let txt5="الصحة والاتزان الرقمي الصحة العامة والاتزان الرقمي هما مجالان مهمان يتعلقان بالرفاهية الشاملة للفرد، ويمكن أن يكون للتكنولوجيا والوسائل الرقمية دور كبير في تحسين هذين الجانبين. إليك بعض النقاط حول الصحة والاتزان الرقمي: الصحة: تكنولوجيا الصحة: استخدام التكنولوجيا في تحسين رعاية المرضى وتشخيص الأمراض. تطبيقات الصحة الرقمية والأجهزة القابلة للارتداء تعزز من متابعة الصحة الشخصية. صحة الإنترنت: الاستفادة من الإنترنت لتقديم خدمات الرعاية عن بُعد. تطوير منصات الاستشارات الطبية عبر الإنترنت والتطبيقات الصحية. الصحة النفسية الرقمية: تقديم خدمات الدعم النفسي عبر الإنترنت وتطبيقات الصحة النفسية. استخدام التكنولوجيا لتحسين التوعية حول الصحة النفسية.   ";

let txt6="الاتزان الرقمي: إدارة الوقت: تحسين فهم الفرد لكيفية استخدام وقته عبر تطبيقات إدارة الوقت الرقمي. الاستخدام الصحي لوسائل التواصل الاجتماعي: توعية حول تأثير وسائل التواصل الاجتماعي على الصحة النفسية وتعزيز استخدامها الإيجابي. توازن الحياة الرقمية والحياة الواقعية: تشجيع على فصل الوقت بين الأنشطة الرقمية والنشاطات الواقعية. تنمية الوعي حول أهمية التوازن في حياة الفرد. السلامة الرقمية: تعزيز السلوكيات الآمنة عبر الإنترنت والوقاية من التحديات الأمنية الرقمية. تطوير المهارات الرقمية: تشجيع على تطوير المهارات الرقمية الإيجابية والإبداعية.  ";

let txt7="الطرائق والحلول المساعدة على تحقيق الاتزان الرقمي تحقيق الاتزان الرقمي يعني القدرة على استخدام التكنولوجيا بشكل فعّال ومتوازن لتحسين الحياة الشخصية والمهنية. فيما يلي بعض الطرائق والحلول التي قد تساعدك في تحقيق الاتزان الرقمي: تحديد الأهداف الرقمية: حدد أهدافًا واقعية وملموسة لاستخدام التكنولوجيا في حياتك اليومية. قم بتحديد أهداف قصيرة الأمد وطويلة الأمد لتحقيق توازن بين النجاح الفوري والرؤية الطويلة المدى. تنظيم الوقت: استخدم تقنيات إدارة الوقت لتحسين إنتاجيتك وتخصيص وقت لأنشطتك الرقمية. قم بتحديد فترات زمنية لاستخدام وسائل التواصل الاجتماعي والبريد الإلكتروني بدقة. اعتماد تقنيات الاستراحة: قم بتحديد فترات للاستراحة وابتعد عن الأجهزة الرقمية خلالها لتجنب التشتت الرقمي والتعب. اعتمد تقنيات الاستراحة والتأمل لتحسين التوازن العقلي. تحديد حدود الاتصال الرقمي: حدد حدودًا لاستخدام وسائل التواصل الاجتماعي والتكنولوجيا في محيطك الشخصي والمهني. تجنب البقاء متصلًا على مدار الساعة والسماح بفترات منعزلة. تنمية مهارات الاستخدام الذكي للتكنولوجيا: اتعلم كيفية استخدام التكنولوجيا بشكل فعال لتحسين إنتاجيتك وحل المشاكل. استفد من تطبيقات إدارة المهام وتنظيم الأنشطة اليومية. التواصل الفعّال: قم بالتواصل مع الأصدقاء والعائلة بشكل واقعي وليس فقط عبر وسائل التواصل الاجتماعي. اختبر الاستمتاع بلحظات الحياة دون التسارع إلى التقاط صور أو مشاركتها على الفور. تحديث المهارات الرقمية: كن على اطلاع بأحدث التقنيات والأدوات التي تساعد في تسهيل حياتك اليومية. قم بتحديث مهاراتك الرقمية بشكل دوري لتكون على مواكبة التطورات التكنولوجية. اعتماد سياسات الأمان الرقمي: اتخذ إجراءات أمان رقمية لحماية بياناتك الشخصية والحفاظ على خصوصيتك. كن حذرًا أثناء التفاعل عبر الإنترنت وتجنب مشاركة معلومات حساسة بشكل عشوائي.  ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}



}

function Script4()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" الإدمان الرقمي : الإدمان الرقمي يشير إلى الاعتماد الشديد على التكنولوجيا الرقمية ووسائل الإعلام الاجتماعية بشكل يؤثر سلبًا على الحياة اليومية والصحة النفسية للفرد. يتعلق الأمر بتكرار استخدام وسائل الإعلام الرقمية بشكل مفرط، مما يؤدي إلى إدمان نفسي يمكن أن يؤثر على القدرة على القيام بالواجبات اليومية والتفاعل مع البيئة الاجتماعية. يمكن أن يظهر الإدمان الرقمي في عدة مجالات، مثل الألعاب الرقمية، وسائل التواصل الاجتماعي، مشاهدة الفيديوهات عبر الإنترنت، واستخدام الهواتف الذكية بشكل مكثف. الأفراد الذين يعانون من إدمان رقمي قد يجدون صعوبة في التحكم في وقتهم الذي يقضونه أمام الشاشات، ويمكن أن يتجاهلوا التزاماتهم اليومية وحتى صحتهم الشخصية. تتضمن أعراض الإدمان الرقمي عدم القدرة على التوقف عن استخدام الوسائل الرقمية، والشعور بالقلق أو الاكتئاب عندما يتم منع الوصول إليها، وتأثير سلبي على العلاقات الاجتماعية والأداء الوظيفي. يعتبر الوعي بمشكلة الإدمان الرقمي وتطوير استراتيجيات صحية لاستخدام التكنولوجيا أمورًا هامة للحفاظ على التوازن في الحياة اليومية.";

let txt2=" أعراض الإدمان الرقمي السلوكية: الإدمان الرقمي السلوكي يشير إلى الإدمان على الاستخدام الزائد للتكنولوجيا الرقمية والوسائل الإلكترونية مثل الهواتف الذكية، وسائل التواصل الاجتماعي، والألعاب الإلكترونية، والإنترنت بشكل عام. قد تظهر عدة أعراض تشير إلى وجود إدمان رقمي سلوكي، ومن هذه الأعراض:  فقدان السيطرة: عدم القدرة على التحكم في كمية الوقت المستهلك عبر الوسائل الرقمية، حيث يصبح الشخص مفتونًا بها وصعب التوقف عن استخدامها. زيادة الاستخدام: زيادة تدريجية في مدة الاستخدام، حيث يقضي الفرد أوقاتًا أطول على الأجهزة الرقمية دون أن يشعر بالرضا أو الاستفادة الحقيقية. الانعزال الاجتماعي: قد يتسبب الإدمان الرقمي في انعزال الشخص عن العلاقات الاجتماعية الحقيقية، حيث يفضل قضاء وقت أكبر على الإنترنت بدلاً من التفاعل الواقعي مع الأصدقاء والعائلة. تأثير سلبي على الصحة النفسية: قد يتسبب الإدمان في زيادة مستويات التوتر والقلق، وتقليل النوم الجيد، وزيادة مشاكل الصحة النفسية مثل الاكتئاب. تهميش الالتزامات اليومية: قد يتسبب الاستخدام المفرط في التكنولوجيا في تهميش الالتزامات اليومية، مثل العمل أو الدراسة، مما يؤدي إلى تأثير سلبي على الأداء الوظيفي أو الأكاديمي. تغير في السلوك الشخصي: يمكن أن يؤدي الإدمان الرقمي إلى تغير في سلوك الشخص، مثل التهرب من المسؤوليات، أو التجاهل للهموم والأولويات الحقيقية. التحفيز الدائم للتفاعل الرقمي: الحاجة المستمرة إلى التفاعل مع الأجهزة الرقمية، حتى عندما تكون النشاطات غير مجدية أو مكررة.";

let txt3=" أعراض الإدمان الرقمي الصحية والاجتماعية : الإدمان الرقمي يمكن أن يؤثر سلباً على الصحة الجسدية والنفسية، فضلاً عن التأثيرات الاجتماعية. إليك بعض الأعراض التي قد تظهر عند الإصابة بالإدمان الرقمي: الأعراض الصحية: قلة النوم: الإفراط في استخدام الأجهزة الرقمية قبل النوم يمكن أن يؤثر على نوعية النوم ويؤدي إلى قلة النوم. تقلبات في الوزن: قد يؤدي الجلوس المطول أمام الشاشات إلى نقص النشاط البدني، مما يزيد من خطر زيادة الوزن. توتر العيون: الاستخدام المفرط للشاشات قد يسبب توترًا في العيون وقد يسهم في تطور مشاكل بصرية. ألم في الظهر والرقبة: الجلوس لفترات طويلة أمام الأجهزة الرقمية يمكن أن يسبب ألما في الظهر والرقبة.الأعراض النفسية: قلق واكتئاب: قد يؤدي الإدمان الرقمي إلى انعزال اجتماعي وزيادة مستويات القلق والاكتئاب. فقدان التركيز: الاستخدام المفرط للهواتف الذكية ووسائل التواصل الاجتماعي قد يؤثر على قدرة الشخص على التركيز والانتباه. تقلبات المزاج: الاعتماد الشديد على الوسائل الرقمية يمكن أن يسبب تقلبات في المزاج وزيادة في التوتر النفسي. فقدان الاهتمام بالأنشطة الاجتماعية: يمكن أن يؤدي الانغماس في عالم الإنترنت إلى إهمال العلاقات الاجتماعية الحقيقية والأنشطة الاجتماعية. الأعراض الاجتماعية: انعزال اجتماعي: يمكن أن يؤدي الإدمان الرقمي إلى انعزال الشخص وانقطاعه عن العلاقات الاجتماعية الحقيقية. ضعف الأداء الوظيفي: قد يؤثر الاعتماد الشديد على الأجهزة الرقمية على أداء الشخص في العمل أو الدراسة. تأثير على العلاقات العائلية: يمكن أن يؤدي الإهمال الزمني للأسرة بسبب الاستخدام المفرط للأجهزة الرقمية إلى تدهور العلاقات العائلية. الإهمال الاجتماعي: قد يؤدي الفقدان للاهتمام بالأنشطة الاجتماعية الحقيقية إلى الإهمال الاجتماعي والتبديل إلى العلاقات الافتراضية. ";

let txt4="أسباب الإدمان الرقمي هناك العديد من الأسباب التي قد تؤدي إلى الإدمان الرقمي، وتتنوع هذه الأسباب حسب الفرد والسياق. من بين الأسباب الشائعة: تأثير وسائل التواصل الاجتماعي: قد تكون وسائل التواصل الاجتماعي مصدرًا للتفاعل الاجتماعي والانتماء، ولكن في بعض الحالات، يمكن أن يؤدي الاستخدام المفرط إلى الإدمان نتيجة لرغبة الفرد في الحصول على تفاعل وتأكيد اجتماعي. ألعاب الفيديو: يمكن أن تكون الألعاب الرقمية تحفيزية للعب الأدوار والتحديات، ولكن الاستمرار في اللعب لفترات طويلة قد يؤدي إلى الإدمان، خاصة إذا كانت تقدم تحفيزًا دائمًا من خلال نظم الجوائز والتقدير. توفر المحتوى الرقمي: مع توسع الإنترنت، أصبح المحتوى الرقمي متاحًا بشكل كبير، ويمكن للأفراد أن يقضوا ساعات طويلة في استهلاك المحتوى عبر الإنترنت، سواء كان ذلك مقاطع الفيديو، الأخبار، المقالات، أو أي نوع آخر من المحتوى. الهروب الرقمي: يمكن للعالم الرقمي أن يكون وسيلة للهروب من الواقع، وبالتالي يمكن للأفراد اللجوء إليه لتجنب التحديات أو المشاكل الحقيقية في حياتهم. تأثير الهواتف الذكية: استخدام الهواتف الذكية بشكل متكرر يمكن أن يسهم في الإدمان، خاصة عند استخدام التطبيقات والخدمات التي تصمم بشكل متعمد لجعلها جذابة ومثيرة للاهتمام. الاعتماد الشديد على التكنولوجيا: في حالات أخرى، قد يكون الإدمان الرقمي نتيجة للاعتماد الكبير على التكنولوجيا في مجالات مثل العمل، الدراسة، أو الترفيه.  ";

let txt5="الصحة والاتزان الرقمي الصحة العامة والاتزان الرقمي هما مجالان مهمان يتعلقان بالرفاهية الشاملة للفرد، ويمكن أن يكون للتكنولوجيا والوسائل الرقمية دور كبير في تحسين هذين الجانبين. إليك بعض النقاط حول الصحة والاتزان الرقمي: الصحة: تكنولوجيا الصحة: استخدام التكنولوجيا في تحسين رعاية المرضى وتشخيص الأمراض. تطبيقات الصحة الرقمية والأجهزة القابلة للارتداء تعزز من متابعة الصحة الشخصية. صحة الإنترنت: الاستفادة من الإنترنت لتقديم خدمات الرعاية عن بُعد. تطوير منصات الاستشارات الطبية عبر الإنترنت والتطبيقات الصحية. الصحة النفسية الرقمية: تقديم خدمات الدعم النفسي عبر الإنترنت وتطبيقات الصحة النفسية. استخدام التكنولوجيا لتحسين التوعية حول الصحة النفسية.   ";

let txt6="الاتزان الرقمي: إدارة الوقت: تحسين فهم الفرد لكيفية استخدام وقته عبر تطبيقات إدارة الوقت الرقمي. الاستخدام الصحي لوسائل التواصل الاجتماعي: توعية حول تأثير وسائل التواصل الاجتماعي على الصحة النفسية وتعزيز استخدامها الإيجابي. توازن الحياة الرقمية والحياة الواقعية: تشجيع على فصل الوقت بين الأنشطة الرقمية والنشاطات الواقعية. تنمية الوعي حول أهمية التوازن في حياة الفرد. السلامة الرقمية: تعزيز السلوكيات الآمنة عبر الإنترنت والوقاية من التحديات الأمنية الرقمية. تطوير المهارات الرقمية: تشجيع على تطوير المهارات الرقمية الإيجابية والإبداعية.  ";

let txt7="الطرائق والحلول المساعدة على تحقيق الاتزان الرقمي تحقيق الاتزان الرقمي يعني القدرة على استخدام التكنولوجيا بشكل فعّال ومتوازن لتحسين الحياة الشخصية والمهنية. فيما يلي بعض الطرائق والحلول التي قد تساعدك في تحقيق الاتزان الرقمي: تحديد الأهداف الرقمية: حدد أهدافًا واقعية وملموسة لاستخدام التكنولوجيا في حياتك اليومية. قم بتحديد أهداف قصيرة الأمد وطويلة الأمد لتحقيق توازن بين النجاح الفوري والرؤية الطويلة المدى. تنظيم الوقت: استخدم تقنيات إدارة الوقت لتحسين إنتاجيتك وتخصيص وقت لأنشطتك الرقمية. قم بتحديد فترات زمنية لاستخدام وسائل التواصل الاجتماعي والبريد الإلكتروني بدقة. اعتماد تقنيات الاستراحة: قم بتحديد فترات للاستراحة وابتعد عن الأجهزة الرقمية خلالها لتجنب التشتت الرقمي والتعب. اعتمد تقنيات الاستراحة والتأمل لتحسين التوازن العقلي. تحديد حدود الاتصال الرقمي: حدد حدودًا لاستخدام وسائل التواصل الاجتماعي والتكنولوجيا في محيطك الشخصي والمهني. تجنب البقاء متصلًا على مدار الساعة والسماح بفترات منعزلة. تنمية مهارات الاستخدام الذكي للتكنولوجيا: اتعلم كيفية استخدام التكنولوجيا بشكل فعال لتحسين إنتاجيتك وحل المشاكل. استفد من تطبيقات إدارة المهام وتنظيم الأنشطة اليومية. التواصل الفعّال: قم بالتواصل مع الأصدقاء والعائلة بشكل واقعي وليس فقط عبر وسائل التواصل الاجتماعي. اختبر الاستمتاع بلحظات الحياة دون التسارع إلى التقاط صور أو مشاركتها على الفور. تحديث المهارات الرقمية: كن على اطلاع بأحدث التقنيات والأدوات التي تساعد في تسهيل حياتك اليومية. قم بتحديث مهاراتك الرقمية بشكل دوري لتكون على مواكبة التطورات التكنولوجية. اعتماد سياسات الأمان الرقمي: اتخذ إجراءات أمان رقمية لحماية بياناتك الشخصية والحفاظ على خصوصيتك. كن حذرًا أثناء التفاعل عبر الإنترنت وتجنب مشاركة معلومات حساسة بشكل عشوائي.  ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}



}

function Script5()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" الإدمان الرقمي : الإدمان الرقمي يشير إلى الاعتماد الشديد على التكنولوجيا الرقمية ووسائل الإعلام الاجتماعية بشكل يؤثر سلبًا على الحياة اليومية والصحة النفسية للفرد. يتعلق الأمر بتكرار استخدام وسائل الإعلام الرقمية بشكل مفرط، مما يؤدي إلى إدمان نفسي يمكن أن يؤثر على القدرة على القيام بالواجبات اليومية والتفاعل مع البيئة الاجتماعية. يمكن أن يظهر الإدمان الرقمي في عدة مجالات، مثل الألعاب الرقمية، وسائل التواصل الاجتماعي، مشاهدة الفيديوهات عبر الإنترنت، واستخدام الهواتف الذكية بشكل مكثف. الأفراد الذين يعانون من إدمان رقمي قد يجدون صعوبة في التحكم في وقتهم الذي يقضونه أمام الشاشات، ويمكن أن يتجاهلوا التزاماتهم اليومية وحتى صحتهم الشخصية. تتضمن أعراض الإدمان الرقمي عدم القدرة على التوقف عن استخدام الوسائل الرقمية، والشعور بالقلق أو الاكتئاب عندما يتم منع الوصول إليها، وتأثير سلبي على العلاقات الاجتماعية والأداء الوظيفي. يعتبر الوعي بمشكلة الإدمان الرقمي وتطوير استراتيجيات صحية لاستخدام التكنولوجيا أمورًا هامة للحفاظ على التوازن في الحياة اليومية.";

let txt2=" أعراض الإدمان الرقمي السلوكية: الإدمان الرقمي السلوكي يشير إلى الإدمان على الاستخدام الزائد للتكنولوجيا الرقمية والوسائل الإلكترونية مثل الهواتف الذكية، وسائل التواصل الاجتماعي، والألعاب الإلكترونية، والإنترنت بشكل عام. قد تظهر عدة أعراض تشير إلى وجود إدمان رقمي سلوكي، ومن هذه الأعراض:  فقدان السيطرة: عدم القدرة على التحكم في كمية الوقت المستهلك عبر الوسائل الرقمية، حيث يصبح الشخص مفتونًا بها وصعب التوقف عن استخدامها. زيادة الاستخدام: زيادة تدريجية في مدة الاستخدام، حيث يقضي الفرد أوقاتًا أطول على الأجهزة الرقمية دون أن يشعر بالرضا أو الاستفادة الحقيقية. الانعزال الاجتماعي: قد يتسبب الإدمان الرقمي في انعزال الشخص عن العلاقات الاجتماعية الحقيقية، حيث يفضل قضاء وقت أكبر على الإنترنت بدلاً من التفاعل الواقعي مع الأصدقاء والعائلة. تأثير سلبي على الصحة النفسية: قد يتسبب الإدمان في زيادة مستويات التوتر والقلق، وتقليل النوم الجيد، وزيادة مشاكل الصحة النفسية مثل الاكتئاب. تهميش الالتزامات اليومية: قد يتسبب الاستخدام المفرط في التكنولوجيا في تهميش الالتزامات اليومية، مثل العمل أو الدراسة، مما يؤدي إلى تأثير سلبي على الأداء الوظيفي أو الأكاديمي. تغير في السلوك الشخصي: يمكن أن يؤدي الإدمان الرقمي إلى تغير في سلوك الشخص، مثل التهرب من المسؤوليات، أو التجاهل للهموم والأولويات الحقيقية. التحفيز الدائم للتفاعل الرقمي: الحاجة المستمرة إلى التفاعل مع الأجهزة الرقمية، حتى عندما تكون النشاطات غير مجدية أو مكررة.";

let txt3=" أعراض الإدمان الرقمي الصحية والاجتماعية : الإدمان الرقمي يمكن أن يؤثر سلباً على الصحة الجسدية والنفسية، فضلاً عن التأثيرات الاجتماعية. إليك بعض الأعراض التي قد تظهر عند الإصابة بالإدمان الرقمي: الأعراض الصحية: قلة النوم: الإفراط في استخدام الأجهزة الرقمية قبل النوم يمكن أن يؤثر على نوعية النوم ويؤدي إلى قلة النوم. تقلبات في الوزن: قد يؤدي الجلوس المطول أمام الشاشات إلى نقص النشاط البدني، مما يزيد من خطر زيادة الوزن. توتر العيون: الاستخدام المفرط للشاشات قد يسبب توترًا في العيون وقد يسهم في تطور مشاكل بصرية. ألم في الظهر والرقبة: الجلوس لفترات طويلة أمام الأجهزة الرقمية يمكن أن يسبب ألما في الظهر والرقبة.الأعراض النفسية: قلق واكتئاب: قد يؤدي الإدمان الرقمي إلى انعزال اجتماعي وزيادة مستويات القلق والاكتئاب. فقدان التركيز: الاستخدام المفرط للهواتف الذكية ووسائل التواصل الاجتماعي قد يؤثر على قدرة الشخص على التركيز والانتباه. تقلبات المزاج: الاعتماد الشديد على الوسائل الرقمية يمكن أن يسبب تقلبات في المزاج وزيادة في التوتر النفسي. فقدان الاهتمام بالأنشطة الاجتماعية: يمكن أن يؤدي الانغماس في عالم الإنترنت إلى إهمال العلاقات الاجتماعية الحقيقية والأنشطة الاجتماعية. الأعراض الاجتماعية: انعزال اجتماعي: يمكن أن يؤدي الإدمان الرقمي إلى انعزال الشخص وانقطاعه عن العلاقات الاجتماعية الحقيقية. ضعف الأداء الوظيفي: قد يؤثر الاعتماد الشديد على الأجهزة الرقمية على أداء الشخص في العمل أو الدراسة. تأثير على العلاقات العائلية: يمكن أن يؤدي الإهمال الزمني للأسرة بسبب الاستخدام المفرط للأجهزة الرقمية إلى تدهور العلاقات العائلية. الإهمال الاجتماعي: قد يؤدي الفقدان للاهتمام بالأنشطة الاجتماعية الحقيقية إلى الإهمال الاجتماعي والتبديل إلى العلاقات الافتراضية. ";

let txt4="أسباب الإدمان الرقمي هناك العديد من الأسباب التي قد تؤدي إلى الإدمان الرقمي، وتتنوع هذه الأسباب حسب الفرد والسياق. من بين الأسباب الشائعة: تأثير وسائل التواصل الاجتماعي: قد تكون وسائل التواصل الاجتماعي مصدرًا للتفاعل الاجتماعي والانتماء، ولكن في بعض الحالات، يمكن أن يؤدي الاستخدام المفرط إلى الإدمان نتيجة لرغبة الفرد في الحصول على تفاعل وتأكيد اجتماعي. ألعاب الفيديو: يمكن أن تكون الألعاب الرقمية تحفيزية للعب الأدوار والتحديات، ولكن الاستمرار في اللعب لفترات طويلة قد يؤدي إلى الإدمان، خاصة إذا كانت تقدم تحفيزًا دائمًا من خلال نظم الجوائز والتقدير. توفر المحتوى الرقمي: مع توسع الإنترنت، أصبح المحتوى الرقمي متاحًا بشكل كبير، ويمكن للأفراد أن يقضوا ساعات طويلة في استهلاك المحتوى عبر الإنترنت، سواء كان ذلك مقاطع الفيديو، الأخبار، المقالات، أو أي نوع آخر من المحتوى. الهروب الرقمي: يمكن للعالم الرقمي أن يكون وسيلة للهروب من الواقع، وبالتالي يمكن للأفراد اللجوء إليه لتجنب التحديات أو المشاكل الحقيقية في حياتهم. تأثير الهواتف الذكية: استخدام الهواتف الذكية بشكل متكرر يمكن أن يسهم في الإدمان، خاصة عند استخدام التطبيقات والخدمات التي تصمم بشكل متعمد لجعلها جذابة ومثيرة للاهتمام. الاعتماد الشديد على التكنولوجيا: في حالات أخرى، قد يكون الإدمان الرقمي نتيجة للاعتماد الكبير على التكنولوجيا في مجالات مثل العمل، الدراسة، أو الترفيه.  ";

let txt5="الصحة والاتزان الرقمي الصحة العامة والاتزان الرقمي هما مجالان مهمان يتعلقان بالرفاهية الشاملة للفرد، ويمكن أن يكون للتكنولوجيا والوسائل الرقمية دور كبير في تحسين هذين الجانبين. إليك بعض النقاط حول الصحة والاتزان الرقمي: الصحة: تكنولوجيا الصحة: استخدام التكنولوجيا في تحسين رعاية المرضى وتشخيص الأمراض. تطبيقات الصحة الرقمية والأجهزة القابلة للارتداء تعزز من متابعة الصحة الشخصية. صحة الإنترنت: الاستفادة من الإنترنت لتقديم خدمات الرعاية عن بُعد. تطوير منصات الاستشارات الطبية عبر الإنترنت والتطبيقات الصحية. الصحة النفسية الرقمية: تقديم خدمات الدعم النفسي عبر الإنترنت وتطبيقات الصحة النفسية. استخدام التكنولوجيا لتحسين التوعية حول الصحة النفسية.   ";

let txt6="الاتزان الرقمي: إدارة الوقت: تحسين فهم الفرد لكيفية استخدام وقته عبر تطبيقات إدارة الوقت الرقمي. الاستخدام الصحي لوسائل التواصل الاجتماعي: توعية حول تأثير وسائل التواصل الاجتماعي على الصحة النفسية وتعزيز استخدامها الإيجابي. توازن الحياة الرقمية والحياة الواقعية: تشجيع على فصل الوقت بين الأنشطة الرقمية والنشاطات الواقعية. تنمية الوعي حول أهمية التوازن في حياة الفرد. السلامة الرقمية: تعزيز السلوكيات الآمنة عبر الإنترنت والوقاية من التحديات الأمنية الرقمية. تطوير المهارات الرقمية: تشجيع على تطوير المهارات الرقمية الإيجابية والإبداعية.  ";

let txt7="الطرائق والحلول المساعدة على تحقيق الاتزان الرقمي تحقيق الاتزان الرقمي يعني القدرة على استخدام التكنولوجيا بشكل فعّال ومتوازن لتحسين الحياة الشخصية والمهنية. فيما يلي بعض الطرائق والحلول التي قد تساعدك في تحقيق الاتزان الرقمي: تحديد الأهداف الرقمية: حدد أهدافًا واقعية وملموسة لاستخدام التكنولوجيا في حياتك اليومية. قم بتحديد أهداف قصيرة الأمد وطويلة الأمد لتحقيق توازن بين النجاح الفوري والرؤية الطويلة المدى. تنظيم الوقت: استخدم تقنيات إدارة الوقت لتحسين إنتاجيتك وتخصيص وقت لأنشطتك الرقمية. قم بتحديد فترات زمنية لاستخدام وسائل التواصل الاجتماعي والبريد الإلكتروني بدقة. اعتماد تقنيات الاستراحة: قم بتحديد فترات للاستراحة وابتعد عن الأجهزة الرقمية خلالها لتجنب التشتت الرقمي والتعب. اعتمد تقنيات الاستراحة والتأمل لتحسين التوازن العقلي. تحديد حدود الاتصال الرقمي: حدد حدودًا لاستخدام وسائل التواصل الاجتماعي والتكنولوجيا في محيطك الشخصي والمهني. تجنب البقاء متصلًا على مدار الساعة والسماح بفترات منعزلة. تنمية مهارات الاستخدام الذكي للتكنولوجيا: اتعلم كيفية استخدام التكنولوجيا بشكل فعال لتحسين إنتاجيتك وحل المشاكل. استفد من تطبيقات إدارة المهام وتنظيم الأنشطة اليومية. التواصل الفعّال: قم بالتواصل مع الأصدقاء والعائلة بشكل واقعي وليس فقط عبر وسائل التواصل الاجتماعي. اختبر الاستمتاع بلحظات الحياة دون التسارع إلى التقاط صور أو مشاركتها على الفور. تحديث المهارات الرقمية: كن على اطلاع بأحدث التقنيات والأدوات التي تساعد في تسهيل حياتك اليومية. قم بتحديث مهاراتك الرقمية بشكل دوري لتكون على مواكبة التطورات التكنولوجية. اعتماد سياسات الأمان الرقمي: اتخذ إجراءات أمان رقمية لحماية بياناتك الشخصية والحفاظ على خصوصيتك. كن حذرًا أثناء التفاعل عبر الإنترنت وتجنب مشاركة معلومات حساسة بشكل عشوائي.  ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}



}

function Script6()
{
  var player = GetPlayer();
var txtsrh = player.GetVar("srh");


let txt1=" الإدمان الرقمي : الإدمان الرقمي يشير إلى الاعتماد الشديد على التكنولوجيا الرقمية ووسائل الإعلام الاجتماعية بشكل يؤثر سلبًا على الحياة اليومية والصحة النفسية للفرد. يتعلق الأمر بتكرار استخدام وسائل الإعلام الرقمية بشكل مفرط، مما يؤدي إلى إدمان نفسي يمكن أن يؤثر على القدرة على القيام بالواجبات اليومية والتفاعل مع البيئة الاجتماعية. يمكن أن يظهر الإدمان الرقمي في عدة مجالات، مثل الألعاب الرقمية، وسائل التواصل الاجتماعي، مشاهدة الفيديوهات عبر الإنترنت، واستخدام الهواتف الذكية بشكل مكثف. الأفراد الذين يعانون من إدمان رقمي قد يجدون صعوبة في التحكم في وقتهم الذي يقضونه أمام الشاشات، ويمكن أن يتجاهلوا التزاماتهم اليومية وحتى صحتهم الشخصية. تتضمن أعراض الإدمان الرقمي عدم القدرة على التوقف عن استخدام الوسائل الرقمية، والشعور بالقلق أو الاكتئاب عندما يتم منع الوصول إليها، وتأثير سلبي على العلاقات الاجتماعية والأداء الوظيفي. يعتبر الوعي بمشكلة الإدمان الرقمي وتطوير استراتيجيات صحية لاستخدام التكنولوجيا أمورًا هامة للحفاظ على التوازن في الحياة اليومية.";

let txt2=" أعراض الإدمان الرقمي السلوكية: الإدمان الرقمي السلوكي يشير إلى الإدمان على الاستخدام الزائد للتكنولوجيا الرقمية والوسائل الإلكترونية مثل الهواتف الذكية، وسائل التواصل الاجتماعي، والألعاب الإلكترونية، والإنترنت بشكل عام. قد تظهر عدة أعراض تشير إلى وجود إدمان رقمي سلوكي، ومن هذه الأعراض:  فقدان السيطرة: عدم القدرة على التحكم في كمية الوقت المستهلك عبر الوسائل الرقمية، حيث يصبح الشخص مفتونًا بها وصعب التوقف عن استخدامها. زيادة الاستخدام: زيادة تدريجية في مدة الاستخدام، حيث يقضي الفرد أوقاتًا أطول على الأجهزة الرقمية دون أن يشعر بالرضا أو الاستفادة الحقيقية. الانعزال الاجتماعي: قد يتسبب الإدمان الرقمي في انعزال الشخص عن العلاقات الاجتماعية الحقيقية، حيث يفضل قضاء وقت أكبر على الإنترنت بدلاً من التفاعل الواقعي مع الأصدقاء والعائلة. تأثير سلبي على الصحة النفسية: قد يتسبب الإدمان في زيادة مستويات التوتر والقلق، وتقليل النوم الجيد، وزيادة مشاكل الصحة النفسية مثل الاكتئاب. تهميش الالتزامات اليومية: قد يتسبب الاستخدام المفرط في التكنولوجيا في تهميش الالتزامات اليومية، مثل العمل أو الدراسة، مما يؤدي إلى تأثير سلبي على الأداء الوظيفي أو الأكاديمي. تغير في السلوك الشخصي: يمكن أن يؤدي الإدمان الرقمي إلى تغير في سلوك الشخص، مثل التهرب من المسؤوليات، أو التجاهل للهموم والأولويات الحقيقية. التحفيز الدائم للتفاعل الرقمي: الحاجة المستمرة إلى التفاعل مع الأجهزة الرقمية، حتى عندما تكون النشاطات غير مجدية أو مكررة.";

let txt3=" أعراض الإدمان الرقمي الصحية والاجتماعية : الإدمان الرقمي يمكن أن يؤثر سلباً على الصحة الجسدية والنفسية، فضلاً عن التأثيرات الاجتماعية. إليك بعض الأعراض التي قد تظهر عند الإصابة بالإدمان الرقمي: الأعراض الصحية: قلة النوم: الإفراط في استخدام الأجهزة الرقمية قبل النوم يمكن أن يؤثر على نوعية النوم ويؤدي إلى قلة النوم. تقلبات في الوزن: قد يؤدي الجلوس المطول أمام الشاشات إلى نقص النشاط البدني، مما يزيد من خطر زيادة الوزن. توتر العيون: الاستخدام المفرط للشاشات قد يسبب توترًا في العيون وقد يسهم في تطور مشاكل بصرية. ألم في الظهر والرقبة: الجلوس لفترات طويلة أمام الأجهزة الرقمية يمكن أن يسبب ألما في الظهر والرقبة.الأعراض النفسية: قلق واكتئاب: قد يؤدي الإدمان الرقمي إلى انعزال اجتماعي وزيادة مستويات القلق والاكتئاب. فقدان التركيز: الاستخدام المفرط للهواتف الذكية ووسائل التواصل الاجتماعي قد يؤثر على قدرة الشخص على التركيز والانتباه. تقلبات المزاج: الاعتماد الشديد على الوسائل الرقمية يمكن أن يسبب تقلبات في المزاج وزيادة في التوتر النفسي. فقدان الاهتمام بالأنشطة الاجتماعية: يمكن أن يؤدي الانغماس في عالم الإنترنت إلى إهمال العلاقات الاجتماعية الحقيقية والأنشطة الاجتماعية. الأعراض الاجتماعية: انعزال اجتماعي: يمكن أن يؤدي الإدمان الرقمي إلى انعزال الشخص وانقطاعه عن العلاقات الاجتماعية الحقيقية. ضعف الأداء الوظيفي: قد يؤثر الاعتماد الشديد على الأجهزة الرقمية على أداء الشخص في العمل أو الدراسة. تأثير على العلاقات العائلية: يمكن أن يؤدي الإهمال الزمني للأسرة بسبب الاستخدام المفرط للأجهزة الرقمية إلى تدهور العلاقات العائلية. الإهمال الاجتماعي: قد يؤدي الفقدان للاهتمام بالأنشطة الاجتماعية الحقيقية إلى الإهمال الاجتماعي والتبديل إلى العلاقات الافتراضية. ";

let txt4="أسباب الإدمان الرقمي هناك العديد من الأسباب التي قد تؤدي إلى الإدمان الرقمي، وتتنوع هذه الأسباب حسب الفرد والسياق. من بين الأسباب الشائعة: تأثير وسائل التواصل الاجتماعي: قد تكون وسائل التواصل الاجتماعي مصدرًا للتفاعل الاجتماعي والانتماء، ولكن في بعض الحالات، يمكن أن يؤدي الاستخدام المفرط إلى الإدمان نتيجة لرغبة الفرد في الحصول على تفاعل وتأكيد اجتماعي. ألعاب الفيديو: يمكن أن تكون الألعاب الرقمية تحفيزية للعب الأدوار والتحديات، ولكن الاستمرار في اللعب لفترات طويلة قد يؤدي إلى الإدمان، خاصة إذا كانت تقدم تحفيزًا دائمًا من خلال نظم الجوائز والتقدير. توفر المحتوى الرقمي: مع توسع الإنترنت، أصبح المحتوى الرقمي متاحًا بشكل كبير، ويمكن للأفراد أن يقضوا ساعات طويلة في استهلاك المحتوى عبر الإنترنت، سواء كان ذلك مقاطع الفيديو، الأخبار، المقالات، أو أي نوع آخر من المحتوى. الهروب الرقمي: يمكن للعالم الرقمي أن يكون وسيلة للهروب من الواقع، وبالتالي يمكن للأفراد اللجوء إليه لتجنب التحديات أو المشاكل الحقيقية في حياتهم. تأثير الهواتف الذكية: استخدام الهواتف الذكية بشكل متكرر يمكن أن يسهم في الإدمان، خاصة عند استخدام التطبيقات والخدمات التي تصمم بشكل متعمد لجعلها جذابة ومثيرة للاهتمام. الاعتماد الشديد على التكنولوجيا: في حالات أخرى، قد يكون الإدمان الرقمي نتيجة للاعتماد الكبير على التكنولوجيا في مجالات مثل العمل، الدراسة، أو الترفيه.  ";

let txt5="الصحة والاتزان الرقمي الصحة العامة والاتزان الرقمي هما مجالان مهمان يتعلقان بالرفاهية الشاملة للفرد، ويمكن أن يكون للتكنولوجيا والوسائل الرقمية دور كبير في تحسين هذين الجانبين. إليك بعض النقاط حول الصحة والاتزان الرقمي: الصحة: تكنولوجيا الصحة: استخدام التكنولوجيا في تحسين رعاية المرضى وتشخيص الأمراض. تطبيقات الصحة الرقمية والأجهزة القابلة للارتداء تعزز من متابعة الصحة الشخصية. صحة الإنترنت: الاستفادة من الإنترنت لتقديم خدمات الرعاية عن بُعد. تطوير منصات الاستشارات الطبية عبر الإنترنت والتطبيقات الصحية. الصحة النفسية الرقمية: تقديم خدمات الدعم النفسي عبر الإنترنت وتطبيقات الصحة النفسية. استخدام التكنولوجيا لتحسين التوعية حول الصحة النفسية.   ";

let txt6="الاتزان الرقمي: إدارة الوقت: تحسين فهم الفرد لكيفية استخدام وقته عبر تطبيقات إدارة الوقت الرقمي. الاستخدام الصحي لوسائل التواصل الاجتماعي: توعية حول تأثير وسائل التواصل الاجتماعي على الصحة النفسية وتعزيز استخدامها الإيجابي. توازن الحياة الرقمية والحياة الواقعية: تشجيع على فصل الوقت بين الأنشطة الرقمية والنشاطات الواقعية. تنمية الوعي حول أهمية التوازن في حياة الفرد. السلامة الرقمية: تعزيز السلوكيات الآمنة عبر الإنترنت والوقاية من التحديات الأمنية الرقمية. تطوير المهارات الرقمية: تشجيع على تطوير المهارات الرقمية الإيجابية والإبداعية.  ";

let txt7="الطرائق والحلول المساعدة على تحقيق الاتزان الرقمي تحقيق الاتزان الرقمي يعني القدرة على استخدام التكنولوجيا بشكل فعّال ومتوازن لتحسين الحياة الشخصية والمهنية. فيما يلي بعض الطرائق والحلول التي قد تساعدك في تحقيق الاتزان الرقمي: تحديد الأهداف الرقمية: حدد أهدافًا واقعية وملموسة لاستخدام التكنولوجيا في حياتك اليومية. قم بتحديد أهداف قصيرة الأمد وطويلة الأمد لتحقيق توازن بين النجاح الفوري والرؤية الطويلة المدى. تنظيم الوقت: استخدم تقنيات إدارة الوقت لتحسين إنتاجيتك وتخصيص وقت لأنشطتك الرقمية. قم بتحديد فترات زمنية لاستخدام وسائل التواصل الاجتماعي والبريد الإلكتروني بدقة. اعتماد تقنيات الاستراحة: قم بتحديد فترات للاستراحة وابتعد عن الأجهزة الرقمية خلالها لتجنب التشتت الرقمي والتعب. اعتمد تقنيات الاستراحة والتأمل لتحسين التوازن العقلي. تحديد حدود الاتصال الرقمي: حدد حدودًا لاستخدام وسائل التواصل الاجتماعي والتكنولوجيا في محيطك الشخصي والمهني. تجنب البقاء متصلًا على مدار الساعة والسماح بفترات منعزلة. تنمية مهارات الاستخدام الذكي للتكنولوجيا: اتعلم كيفية استخدام التكنولوجيا بشكل فعال لتحسين إنتاجيتك وحل المشاكل. استفد من تطبيقات إدارة المهام وتنظيم الأنشطة اليومية. التواصل الفعّال: قم بالتواصل مع الأصدقاء والعائلة بشكل واقعي وليس فقط عبر وسائل التواصل الاجتماعي. اختبر الاستمتاع بلحظات الحياة دون التسارع إلى التقاط صور أو مشاركتها على الفور. تحديث المهارات الرقمية: كن على اطلاع بأحدث التقنيات والأدوات التي تساعد في تسهيل حياتك اليومية. قم بتحديث مهاراتك الرقمية بشكل دوري لتكون على مواكبة التطورات التكنولوجية. اعتماد سياسات الأمان الرقمي: اتخذ إجراءات أمان رقمية لحماية بياناتك الشخصية والحفاظ على خصوصيتك. كن حذرًا أثناء التفاعل عبر الإنترنت وتجنب مشاركة معلومات حساسة بشكل عشوائي.  ";

let arrtxt =[txt1,txt2,txt3,txt4,txt5,txt6,txt7];

let wrd = txtsrh;

let result;

for(var i =0;i<arrtxt.length;i++)
{
    if(result = arrtxt[i].match(wrd))
    {

        result=arrtxt[i];
        player.SetVar("fnd",result)
        i=arrtxt.length;
    }
    else
    {
        result="قم بكتابة كلمات تتعلق بموضوع المحتوى أو حاول بعبارة آخرى";
    }
}



}

